start_id|end_id|TYPE
UMLS/C0036609|FMA/54709|ALSO_CODED_AS
UMLS/C0036609|FMA/54721|ALSO_CODED_AS
UMLS/C0036609|LNC/LP199945-9|ALSO_CODED_AS
UMLS/C0036609|LNC/LP36094-8|ALSO_CODED_AS
UMLS/C0036609|LNC/MTHU054285|ALSO_CODED_AS
UMLS/C0036609|MSH/D012658|ALSO_CODED_AS
UMLS/C0036609|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0036609|NCI/C12497|ALSO_CODED_AS
UMLS/C0746408|LNC/LA17213-2|ALSO_CODED_AS
UMLS/C0001074|FMA/51061|ALSO_CODED_AS
UMLS/C0001074|LNC/LP30507-5|ALSO_CODED_AS
UMLS/C0001074|LNC/MTHU014777|ALSO_CODED_AS
UMLS/C0001074|MSH/D000125|ALSO_CODED_AS
UMLS/C0001074|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0001074|NCI/C32043|ALSO_CODED_AS
UMLS/C0002913|MSH/D000767|ALSO_CODED_AS
UMLS/C0002913|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0002913|NCI/C15642|ALSO_CODED_AS
UMLS/C0002928|MSH/D000775|ALSO_CODED_AS
UMLS/C0002928|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0002928|NCI/C92887|ALSO_CODED_AS
UMLS/C0003550|HPO/HP:0002427|ALSO_CODED_AS
UMLS/C0003550|MSH/D001039|ALSO_CODED_AS
UMLS/C0003550|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0003550|NCI/C34394|ALSO_CODED_AS
UMLS/C0003550|OMIM/MTHU008009|ALSO_CODED_AS
UMLS/C0003550|OMIM/MTHU022215|ALSO_CODED_AS
UMLS/C0003968|LNC/LP31695-7|ALSO_CODED_AS
UMLS/C0003968|MEDLINEPLUS/5380|ALSO_CODED_AS
UMLS/C0003968|MSH/D001205|ALSO_CODED_AS
UMLS/C0003968|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0003968|NCI/C285|ALSO_CODED_AS
UMLS/C0003968|RXNORM/1151|ALSO_CODED_AS
UMLS/C0003968|VANDF/4017471|ALSO_CODED_AS
UMLS/C0003968|VANDF/4017646|ALSO_CODED_AS
UMLS/C0004093|HPO/HP:0025406|ALSO_CODED_AS
UMLS/C0004093|MSH/D001247|ALSO_CODED_AS
UMLS/C0004093|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0004093|NCI/C28132|ALSO_CODED_AS
UMLS/C0004093|OMIM/MTHU059936|ALSO_CODED_AS
UMLS/C0004134|HPO/HP:0010867|ALSO_CODED_AS
UMLS/C0004134|LNC/LA24636-5|ALSO_CODED_AS
UMLS/C0004134|MSH/D001259|ALSO_CODED_AS
UMLS/C0004134|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0004134|NCI/C26702|ALSO_CODED_AS
UMLS/C0004134|OMIM/MTHU036349|ALSO_CODED_AS
UMLS/C0004134|OMIM/MTHU068459|ALSO_CODED_AS
UMLS/C0004781|FMA/321900|ALSO_CODED_AS
UMLS/C0004781|FMA/84013|ALSO_CODED_AS
UMLS/C0004781|MSH/D001479|ALSO_CODED_AS
UMLS/C0004781|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0004781|NCI/C12447|ALSO_CODED_AS
UMLS/C0005790|LNC/LP19284-6|ALSO_CODED_AS
UMLS/C0005790|LNC/LP6186-3|ALSO_CODED_AS
UMLS/C0005790|LNC/LP73955-4|ALSO_CODED_AS
UMLS/C0005790|LNC/LP7788-5|ALSO_CODED_AS
UMLS/C0005790|LNC/MTHU000051|ALSO_CODED_AS
UMLS/C0005790|LNC/MTHU008050|ALSO_CODED_AS
UMLS/C0005790|LNC/MTHU008375|ALSO_CODED_AS
UMLS/C0005790|MSH/D001780|ALSO_CODED_AS
UMLS/C0005790|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0005790|NCI/C62662|ALSO_CODED_AS
UMLS/C0006104|FMA/50801|ALSO_CODED_AS
UMLS/C0006104|LNC/LA32232-3|ALSO_CODED_AS
UMLS/C0006104|LNC/LA4254-4|ALSO_CODED_AS
UMLS/C0006104|LNC/LP206702-5|ALSO_CODED_AS
UMLS/C0006104|LNC/LP7084-9|ALSO_CODED_AS
UMLS/C0006104|LNC/MTHU002079|ALSO_CODED_AS
UMLS/C0006104|MSH/D001921|ALSO_CODED_AS
UMLS/C0006104|MTH/U001761|ALSO_CODED_AS
UMLS/C0006104|NCI/C12439|ALSO_CODED_AS
UMLS/C0006121|FMA/79876|ALSO_CODED_AS
UMLS/C0006121|LNC/LP207337-9|ALSO_CODED_AS
UMLS/C0006121|MSH/D001933|ALSO_CODED_AS
UMLS/C0006121|MTH/U001762|ALSO_CODED_AS
UMLS/C0006121|NCI/C12441|ALSO_CODED_AS
UMLS/C0007286|HPO/HP:0012185|ALSO_CODED_AS
UMLS/C0007286|ICD9CM/354.0|ALSO_CODED_AS
UMLS/C0007286|MEDLINEPLUS/179|ALSO_CODED_AS
UMLS/C0007286|MSH/D002349|ALSO_CODED_AS
UMLS/C0007286|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0007286|NCI/C34450|ALSO_CODED_AS
UMLS/C0007286|OMIM/115430|ALSO_CODED_AS
UMLS/C0007286|OMIM/MTHU011164|ALSO_CODED_AS
UMLS/C0007767|ICD9CM/88.41|ALSO_CODED_AS
UMLS/C0007767|MSH/D002533|ALSO_CODED_AS
UMLS/C0010287|LNC/LP15510-8|ALSO_CODED_AS
UMLS/C0010287|LNC/MTHU006937|ALSO_CODED_AS
UMLS/C0010287|MSH/D003402|ALSO_CODED_AS
UMLS/C0010287|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0010287|MTH/U000246|ALSO_CODED_AS
UMLS/C0010287|NCI/C113245|ALSO_CODED_AS
UMLS/C0010592|LNC/LA16776-9|ALSO_CODED_AS
UMLS/C0010592|LNC/LP16098-3|ALSO_CODED_AS
UMLS/C0010592|LNC/MTHU062952|ALSO_CODED_AS
UMLS/C0010592|MSH/D016572|ALSO_CODED_AS
UMLS/C0010592|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0010592|NCI/C406|ALSO_CODED_AS
UMLS/C0010592|RXNORM/3008|ALSO_CODED_AS
UMLS/C0010592|VANDF/4018761|ALSO_CODED_AS
UMLS/C0010594|MSH/D003524|ALSO_CODED_AS
UMLS/C0010594|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0011304|MSH/D003711|ALSO_CODED_AS
UMLS/C0011304|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0011304|NCI/C117277|ALSO_CODED_AS
UMLS/C0011304|OMIM/MTHU002306|ALSO_CODED_AS
UMLS/C0013769|FMA/24901|ALSO_CODED_AS
UMLS/C0013769|FMA/322616|ALSO_CODED_AS
UMLS/C0013769|LNC/LA16717-3|ALSO_CODED_AS
UMLS/C0013769|LNC/LP199967-3|ALSO_CODED_AS
UMLS/C0013769|LNC/LP221486-6|ALSO_CODED_AS
UMLS/C0013769|LNC/LP7196-1|ALSO_CODED_AS
UMLS/C0013769|LNC/MTHU002674|ALSO_CODED_AS
UMLS/C0013769|LNC/MTHU053748|ALSO_CODED_AS
UMLS/C0013769|MSH/D004550|ALSO_CODED_AS
UMLS/C0013769|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0013770|FMA/321843|ALSO_CODED_AS
UMLS/C0013770|FMA/35289|ALSO_CODED_AS
UMLS/C0013770|MSH/D004551|ALSO_CODED_AS
UMLS/C0013770|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0013770|NCI/C32497|ALSO_CODED_AS
UMLS/C0013832|LNC/LP19403-2|ALSO_CODED_AS
UMLS/C0013832|LNC/MTHU008531|ALSO_CODED_AS
UMLS/C0013832|MSH/D004573|ALSO_CODED_AS
UMLS/C0013832|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0013832|NCI/C464|ALSO_CODED_AS
UMLS/C0013832|VANDF/4022490|ALSO_CODED_AS
UMLS/C0013845|MSH/D004578|ALSO_CODED_AS
UMLS/C0013845|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0013845|NCI/C16534|ALSO_CODED_AS
UMLS/C0015230|HPO/HP:0000988|ALSO_CODED_AS
UMLS/C0015230|HPO/HP:4000054|ALSO_CODED_AS
UMLS/C0015230|ICD9CM/782.1|ALSO_CODED_AS
UMLS/C0015230|LNC/LA29194-0|ALSO_CODED_AS
UMLS/C0015230|LNC/LA7469-5|ALSO_CODED_AS
UMLS/C0015230|LNC/LP30547-1|ALSO_CODED_AS
UMLS/C0015230|LNC/LP75487-6|ALSO_CODED_AS
UMLS/C0015230|LNC/MTHU015064|ALSO_CODED_AS
UMLS/C0015230|LNC/MTHU020933|ALSO_CODED_AS
UMLS/C0015230|MEDLINEPLUS/208|ALSO_CODED_AS
UMLS/C0015230|MSH/D005076|ALSO_CODED_AS
UMLS/C0015230|MTH/638|ALSO_CODED_AS
UMLS/C0015230|MTH/U003405|ALSO_CODED_AS
UMLS/C0015230|NCI/C111884|ALSO_CODED_AS
UMLS/C0015230|NCI/C39594|ALSO_CODED_AS
UMLS/C0015230|OMIM/MTHU008860|ALSO_CODED_AS
UMLS/C0015230|OMIM/MTHU011109|ALSO_CODED_AS
UMLS/C0015230|OMIM/MTHU047706|ALSO_CODED_AS
UMLS/C0015672|HPO/HP:0012378|ALSO_CODED_AS
UMLS/C0015672|LNC/LA7542-9|ALSO_CODED_AS
UMLS/C0015672|LNC/LP74831-6|ALSO_CODED_AS
UMLS/C0015672|LNC/MTHU013358|ALSO_CODED_AS
UMLS/C0015672|MEDLINEPLUS/5324|ALSO_CODED_AS
UMLS/C0015672|MSH/D005221|ALSO_CODED_AS
UMLS/C0015672|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0015672|NCI/C3036|ALSO_CODED_AS
UMLS/C0015672|OMIM/MTHU010062|ALSO_CODED_AS
UMLS/C0016928|LNC/LP100865-7|ALSO_CODED_AS
UMLS/C0016928|LNC/LP30516-6|ALSO_CODED_AS
UMLS/C0016928|LNC/MTHU015039|ALSO_CODED_AS
UMLS/C0016928|LNC/MTHU035898|ALSO_CODED_AS
UMLS/C0016928|MSH/D005684|ALSO_CODED_AS
UMLS/C0016928|NCI/C75445|ALSO_CODED_AS
UMLS/C0018126|MSH/D006082|ALSO_CODED_AS
UMLS/C0018563|FMA/9712|ALSO_CODED_AS
UMLS/C0018563|LNC/LA16719-9|ALSO_CODED_AS
UMLS/C0018563|LNC/LP221491-6|ALSO_CODED_AS
UMLS/C0018563|LNC/LP7279-5|ALSO_CODED_AS
UMLS/C0018563|LNC/MTHU002685|ALSO_CODED_AS
UMLS/C0018563|MSH/D006225|ALSO_CODED_AS
UMLS/C0018563|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0018563|NCI/C32712|ALSO_CODED_AS
UMLS/C0018563|OMIM/MTHU000072|ALSO_CODED_AS
UMLS/C0018870|FMA/24994|ALSO_CODED_AS
UMLS/C0018870|FMA/326009|ALSO_CODED_AS
UMLS/C0018870|LNC/LA25778-4|ALSO_CODED_AS
UMLS/C0018870|MSH/D006365|ALSO_CODED_AS
UMLS/C0018870|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0018870|MTH/U003296|ALSO_CODED_AS
UMLS/C0018905|LNC/LP28800-8|ALSO_CODED_AS
UMLS/C0018905|MSH/D006386|ALSO_CODED_AS
UMLS/C0018905|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0018905|NCI/C130173|ALSO_CODED_AS
UMLS/C0020538|HPO/HP:0000822|ALSO_CODED_AS
UMLS/C0020538|ICD9CM/401-405.99|ALSO_CODED_AS
UMLS/C0020538|ICD9CM/997.91|ALSO_CODED_AS
UMLS/C0020538|LNC/LA14293-7|ALSO_CODED_AS
UMLS/C0020538|LNC/LA7444-8|ALSO_CODED_AS
UMLS/C0020538|LNC/LP74941-3|ALSO_CODED_AS
UMLS/C0020538|LNC/MTHU020789|ALSO_CODED_AS
UMLS/C0020538|MEDLINEPLUS/34|ALSO_CODED_AS
UMLS/C0020538|MSH/D006973|ALSO_CODED_AS
UMLS/C0020538|MTH/005|ALSO_CODED_AS
UMLS/C0020538|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0020538|NCI/C3117|ALSO_CODED_AS
UMLS/C0020538|OMIM/MTHU002068|ALSO_CODED_AS
UMLS/C0020538|OMIM/MTHU014957|ALSO_CODED_AS
UMLS/C0020538|OMIM/MTHU058377|ALSO_CODED_AS
UMLS/C0020538|OMIM/MTHU070458|ALSO_CODED_AS
UMLS/C0020580|HPO/HP:0003474|ALSO_CODED_AS
UMLS/C0020580|HPO/HP:0033748|ALSO_CODED_AS
UMLS/C0020580|MSH/D006987|ALSO_CODED_AS
UMLS/C0020580|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0020580|NCI/C50445|ALSO_CODED_AS
UMLS/C0020580|OMIM/MTHU010221|ALSO_CODED_AS
UMLS/C0021081|LNC/LP31454-9|ALSO_CODED_AS
UMLS/C0021081|MSH/D007166|ALSO_CODED_AS
UMLS/C0021081|MTH/U002004|ALSO_CODED_AS
UMLS/C0021081|NCI/C574|ALSO_CODED_AS
UMLS/C0021081|VANDF/4021763|ALSO_CODED_AS
UMLS/C0022369|LNC/LP29657-1|ALSO_CODED_AS
UMLS/C0022369|MSH/D007577|ALSO_CODED_AS
UMLS/C0022369|NCI/C14229|ALSO_CODED_AS
UMLS/C0022742|FMA/24974|ALSO_CODED_AS
UMLS/C0022742|LNC/LA22232-5|ALSO_CODED_AS
UMLS/C0022742|LNC/LP199984-8|ALSO_CODED_AS
UMLS/C0022742|LNC/LP7381-9|ALSO_CODED_AS
UMLS/C0022742|LNC/MTHU002687|ALSO_CODED_AS
UMLS/C0022742|MSH/D007717|ALSO_CODED_AS
UMLS/C0022742|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0022745|FMA/35175|ALSO_CODED_AS
UMLS/C0022745|FMA/35184|ALSO_CODED_AS
UMLS/C0022745|MSH/D007719|ALSO_CODED_AS
UMLS/C0022745|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0022745|NCI/C32898|ALSO_CODED_AS
UMLS/C0022885|MEDLINEPLUS/210|ALSO_CODED_AS
UMLS/C0022885|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0022885|NCI/C25294|ALSO_CODED_AS
UMLS/C0022917|LNC/LP15033-1|ALSO_CODED_AS
UMLS/C0022917|LNC/MTHU002348|ALSO_CODED_AS
UMLS/C0022917|MSH/D007770|ALSO_CODED_AS
UMLS/C0022917|MTH/U000295|ALSO_CODED_AS
UMLS/C0022917|MTH/U002030|ALSO_CODED_AS
UMLS/C0022917|NCI/C25184|ALSO_CODED_AS
UMLS/C0023216|FMA/7184|ALSO_CODED_AS
UMLS/C0023216|LNC/LA18112-5|ALSO_CODED_AS
UMLS/C0023216|LNC/LA30846-2|ALSO_CODED_AS
UMLS/C0023216|LNC/LP199985-5|ALSO_CODED_AS
UMLS/C0023216|LNC/LP29948-4|ALSO_CODED_AS
UMLS/C0023216|LNC/MTHU011970|ALSO_CODED_AS
UMLS/C0023216|MSH/D035002|ALSO_CODED_AS
UMLS/C0023216|MTH/U003308|ALSO_CODED_AS
UMLS/C0023216|NCI/C12742|ALSO_CODED_AS
UMLS/C0023216|NCI/C77625|ALSO_CODED_AS
UMLS/C0024090|FMA/61681|ALSO_CODED_AS
UMLS/C0024090|LNC/LA22230-9|ALSO_CODED_AS
UMLS/C0024090|MSH/D008161|ALSO_CODED_AS
UMLS/C0024090|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0024090|NCI/C34004|ALSO_CODED_AS
UMLS/C0024485|LNC/LA24328-9|ALSO_CODED_AS
UMLS/C0024485|LNC/LP206549-0|ALSO_CODED_AS
UMLS/C0024485|LNC/LP206574-8|ALSO_CODED_AS
UMLS/C0024485|LNC/LP6406-5|ALSO_CODED_AS
UMLS/C0024485|MEDLINEPLUS/3953|ALSO_CODED_AS
UMLS/C0024485|MSH/D008279|ALSO_CODED_AS
UMLS/C0024485|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0024485|NCI/C16809|ALSO_CODED_AS
UMLS/C0025677|LNC/LA14339-8|ALSO_CODED_AS
UMLS/C0025677|LNC/LP16198-1|ALSO_CODED_AS
UMLS/C0025677|LNC/MTHU005020|ALSO_CODED_AS
UMLS/C0025677|MSH/D008727|ALSO_CODED_AS
UMLS/C0025677|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0025677|NCI/C642|ALSO_CODED_AS
UMLS/C0025677|RXNORM/6851|ALSO_CODED_AS
UMLS/C0025677|VANDF/4019828|ALSO_CODED_AS
UMLS/C0026516|LNC/LP89863-2|ALSO_CODED_AS
UMLS/C0026516|LNC/MTHU031584|ALSO_CODED_AS
UMLS/C0026516|MSH/D000339|ALSO_CODED_AS
UMLS/C0026516|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0026516|NCI/C72883|ALSO_CODED_AS
UMLS/C0026612|MSH/D009048|ALSO_CODED_AS
UMLS/C0026612|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0026649|LNC/LP96286-7|ALSO_CODED_AS
UMLS/C0026649|LNC/MTHU034767|ALSO_CODED_AS
UMLS/C0026649|MSH/D009068|ALSO_CODED_AS
UMLS/C0026649|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0026649|NCI/C37994|ALSO_CODED_AS
UMLS/C0026649|OMIM/MTHU000756|ALSO_CODED_AS
UMLS/C0026845|LNC/LP199993-9|ALSO_CODED_AS
UMLS/C0026845|LNC/LP32940-6|ALSO_CODED_AS
UMLS/C0026845|LNC/LP33444-8|ALSO_CODED_AS
UMLS/C0026845|LNC/MTHU016812|ALSO_CODED_AS
UMLS/C0026845|MSH/D009132|ALSO_CODED_AS
UMLS/C0026845|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0026845|NCI/C12435|ALSO_CODED_AS
UMLS/C0027497|HPO/HP:0002018|ALSO_CODED_AS
UMLS/C0027497|LNC/LA15098-9|ALSO_CODED_AS
UMLS/C0027497|LNC/LP36327-2|ALSO_CODED_AS
UMLS/C0027497|LNC/MTHU013524|ALSO_CODED_AS
UMLS/C0027497|MSH/D009325|ALSO_CODED_AS
UMLS/C0027497|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0027497|NCI/C3258|ALSO_CODED_AS
UMLS/C0027497|OMIM/MTHU002455|ALSO_CODED_AS
UMLS/C0027741|LNC/LA9467-7|ALSO_CODED_AS
UMLS/C0027741|LNC/LP200049-7|ALSO_CODED_AS
UMLS/C0027741|MSH/D009407|ALSO_CODED_AS
UMLS/C0027741|NCI/C21072|ALSO_CODED_AS
UMLS/C0028081|HPO/HP:0030166|ALSO_CODED_AS
UMLS/C0028081|LNC/LP75171-6|ALSO_CODED_AS
UMLS/C0028081|LNC/MTHU013525|ALSO_CODED_AS
UMLS/C0028081|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0028081|NCI/C3279|ALSO_CODED_AS
UMLS/C0028081|OMIM/MTHU071582|ALSO_CODED_AS
UMLS/C0028643|LNC/LA30857-9|ALSO_CODED_AS
UMLS/C0028643|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0028643|NCI/C34857|ALSO_CODED_AS
UMLS/C0028643|OMIM/MTHU008008|ALSO_CODED_AS
UMLS/C0028785|FMA/67325|ALSO_CODED_AS
UMLS/C0028785|MSH/D009778|ALSO_CODED_AS
UMLS/C0028785|MTH/U002117|ALSO_CODED_AS
UMLS/C0028785|NCI/C12355|ALSO_CODED_AS
UMLS/C0028945|HPO/HP:0033681|ALSO_CODED_AS
UMLS/C0028945|MSH/D009837|ALSO_CODED_AS
UMLS/C0028945|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0028945|NCI/C129319|ALSO_CODED_AS
UMLS/C0028945|OMIM/137800|ALSO_CODED_AS
UMLS/C0028945|OMIM/MTHU022890|ALSO_CODED_AS
UMLS/C0028945|OMIM/MTHU036793|ALSO_CODED_AS
UMLS/C0029127|FMA/58634|ALSO_CODED_AS
UMLS/C0029127|FMA/58711|ALSO_CODED_AS
UMLS/C0029127|MSH/D009898|ALSO_CODED_AS
UMLS/C0029127|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0029127|NCI/C12760|ALSO_CODED_AS
UMLS/C0030401|MSH/D000773|ALSO_CODED_AS
UMLS/C0030554|HPO/HP:0003401|ALSO_CODED_AS
UMLS/C0030554|LNC/LP202889-4|ALSO_CODED_AS
UMLS/C0030554|LNC/MTHU051473|ALSO_CODED_AS
UMLS/C0030554|MSH/D010292|ALSO_CODED_AS
UMLS/C0030554|MTH/556|ALSO_CODED_AS
UMLS/C0030554|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0030554|NCI/C28177|ALSO_CODED_AS
UMLS/C0030554|OMIM/MTHU005827|ALSO_CODED_AS
UMLS/C0030554|OMIM/MTHU016055|ALSO_CODED_AS
UMLS/C0030554|OMIM/MTHU016084|ALSO_CODED_AS
UMLS/C0030560|FMA/61826|ALSO_CODED_AS
UMLS/C0030560|MSH/D010296|ALSO_CODED_AS
UMLS/C0030560|MTH/U002145|ALSO_CODED_AS
UMLS/C0030560|NCI/C12354|ALSO_CODED_AS
UMLS/C0030605|MSH/D010314|ALSO_CODED_AS
UMLS/C0030605|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0030605|MTH/U000019|ALSO_CODED_AS
UMLS/C0030605|MTH/U000082|ALSO_CODED_AS
UMLS/C0030605|MTH/U000083|ALSO_CODED_AS
UMLS/C0030605|MTH/U000084|ALSO_CODED_AS
UMLS/C0030605|NCI/C38462|ALSO_CODED_AS
UMLS/C0030647|FMA/24485|ALSO_CODED_AS
UMLS/C0030647|LNC/LA16748-8|ALSO_CODED_AS
UMLS/C0030647|LNC/LP221451-0|ALSO_CODED_AS
UMLS/C0030647|LNC/LP30162-9|ALSO_CODED_AS
UMLS/C0030647|LNC/LP30539-8|ALSO_CODED_AS
UMLS/C0030647|LNC/MTHU014782|ALSO_CODED_AS
UMLS/C0030647|LNC/MTHU053776|ALSO_CODED_AS
UMLS/C0030647|MSH/D010329|ALSO_CODED_AS
UMLS/C0030647|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0030647|NCI/C33282|ALSO_CODED_AS
UMLS/C0030971|MSH/D010465|ALSO_CODED_AS
UMLS/C0030971|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0030971|NCI/C16967|ALSO_CODED_AS
UMLS/C0032207|LNC/LP14931-7|ALSO_CODED_AS
UMLS/C0032207|LNC/MTHU002192|ALSO_CODED_AS
UMLS/C0032207|MSH/D010984|ALSO_CODED_AS
UMLS/C0032207|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0032207|MTH/U000086|ALSO_CODED_AS
UMLS/C0032207|NCI/C376|ALSO_CODED_AS
UMLS/C0032207|NCI/C756|ALSO_CODED_AS
UMLS/C0032207|RXNORM/1311280|ALSO_CODED_AS
UMLS/C0032776|HPO/HP:0033840|ALSO_CODED_AS
UMLS/C0032776|ICD9CM/627.1|ALSO_CODED_AS
UMLS/C0032776|NCI/C34937|ALSO_CODED_AS
UMLS/C0032952|LNC/LP18109-6|ALSO_CODED_AS
UMLS/C0032952|LNC/MTHU062944|ALSO_CODED_AS
UMLS/C0032952|MSH/D011241|ALSO_CODED_AS
UMLS/C0032952|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0032952|NCI/C770|ALSO_CODED_AS
UMLS/C0032952|RXNORM/8640|ALSO_CODED_AS
UMLS/C0032952|VANDF/4017876|ALSO_CODED_AS
UMLS/C0033707|MSH/D011517|ALSO_CODED_AS
UMLS/C0033707|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0033707|MTH/U000023|ALSO_CODED_AS
UMLS/C0033707|NCI/C62656|ALSO_CODED_AS
UMLS/C0034117|LNC/LP263781-9|ALSO_CODED_AS
UMLS/C0034117|MSH/D011677|ALSO_CODED_AS
UMLS/C0034117|MTH/U003461|ALSO_CODED_AS
UMLS/C0034121|FMA/58252|ALSO_CODED_AS
UMLS/C0034121|LNC/LP30546-3|ALSO_CODED_AS
UMLS/C0034121|LNC/MTHU015063|ALSO_CODED_AS
UMLS/C0034121|MSH/D011680|ALSO_CODED_AS
UMLS/C0034121|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0034121|NCI/C33429|ALSO_CODED_AS
UMLS/C0034929|MSH/D012018|ALSO_CODED_AS
UMLS/C0034929|MTH/U003465|ALSO_CODED_AS
UMLS/C0034929|NCI/C78342|ALSO_CODED_AS
UMLS/C0036572|HPO/HP:0001250|ALSO_CODED_AS
UMLS/C0036572|LNC/LA15899-0|ALSO_CODED_AS
UMLS/C0036572|LNC/LA7472-9|ALSO_CODED_AS
UMLS/C0036572|MEDLINEPLUS/396|ALSO_CODED_AS
UMLS/C0036572|MSH/D012640|ALSO_CODED_AS
UMLS/C0036572|MTH/673|ALSO_CODED_AS
UMLS/C0036572|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0036572|NCI/C2962|ALSO_CODED_AS
UMLS/C0036572|OMIM/MTHU000242|ALSO_CODED_AS
UMLS/C0036572|OMIM/MTHU004223|ALSO_CODED_AS
UMLS/C0036658|GO/GO:0007600|ALSO_CODED_AS
UMLS/C0036658|LNC/LP34365-4|ALSO_CODED_AS
UMLS/C0036658|LNC/MTHU017277|ALSO_CODED_AS
UMLS/C0036658|MSH/D012677|ALSO_CODED_AS
UMLS/C0036658|MTH/527|ALSO_CODED_AS
UMLS/C0036658|MTH/U003464|ALSO_CODED_AS
UMLS/C0036674|MSH/D012683|ALSO_CODED_AS
UMLS/C0036743|LNC/LP74327-5|ALSO_CODED_AS
UMLS/C0036743|LNC/MTHU008384|ALSO_CODED_AS
UMLS/C0036743|MSH/D012698|ALSO_CODED_AS
UMLS/C0036743|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0037199|HPO/HP:0000246|ALSO_CODED_AS
UMLS/C0037199|MEDLINEPLUS/404|ALSO_CODED_AS
UMLS/C0037199|MSH/D012852|ALSO_CODED_AS
UMLS/C0037199|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0037199|NCI/C35024|ALSO_CODED_AS
UMLS/C0037199|OMIM/MTHU006260|ALSO_CODED_AS
UMLS/C0037817|LNC/LP121781-1|ALSO_CODED_AS
UMLS/C0037817|LNC/LP251050-3|ALSO_CODED_AS
UMLS/C0037817|LNC/MTHU039958|ALSO_CODED_AS
UMLS/C0037817|MSH/D013060|ALSO_CODED_AS
UMLS/C0037817|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0037817|NCI/C38025|ALSO_CODED_AS
UMLS/C0037886|MSH/D015524|ALSO_CODED_AS
UMLS/C0037886|NCI/C35031|ALSO_CODED_AS
UMLS/C0038454|HPO/HP:0001297|ALSO_CODED_AS
UMLS/C0038454|LNC/LA22099-8|ALSO_CODED_AS
UMLS/C0038454|LNC/LA22244-0|ALSO_CODED_AS
UMLS/C0038454|LNC/LA9553-4|ALSO_CODED_AS
UMLS/C0038454|LNC/LP74605-4|ALSO_CODED_AS
UMLS/C0038454|LNC/MTHU020801|ALSO_CODED_AS
UMLS/C0038454|MEDLINEPLUS/8|ALSO_CODED_AS
UMLS/C0038454|MSH/D020521|ALSO_CODED_AS
UMLS/C0038454|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0038454|MTH/U001797|ALSO_CODED_AS
UMLS/C0038454|NCI/C3390|ALSO_CODED_AS
UMLS/C0038454|OMIM/601367|ALSO_CODED_AS
UMLS/C0038454|OMIM/MTHU008085|ALSO_CODED_AS
UMLS/C0038454|OMIM/MTHU009877|ALSO_CODED_AS
UMLS/C0038454|OMIM/MTHU010049|ALSO_CODED_AS
UMLS/C0038454|OMIM/MTHU012420|ALSO_CODED_AS
UMLS/C0038454|OMIM/MTHU036565|ALSO_CODED_AS
UMLS/C0038454|OMIM/MTHU072910|ALSO_CODED_AS
UMLS/C0039043|ICD9CM/05.31|ALSO_CODED_AS
UMLS/C0039043|MSH/D001340|ALSO_CODED_AS
UMLS/C0039043|NCI/C21110|ALSO_CODED_AS
UMLS/C0039225|LNC/LA21908-1|ALSO_CODED_AS
UMLS/C0039225|LNC/LP136501-6|ALSO_CODED_AS
UMLS/C0039225|MSH/D013607|ALSO_CODED_AS
UMLS/C0039225|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0039225|NCI/C42998|ALSO_CODED_AS
UMLS/C0039225|VANDF/4024284|ALSO_CODED_AS
UMLS/C0039840|LNC/LP15886-2|ALSO_CODED_AS
UMLS/C0039840|LNC/LP31688-2|ALSO_CODED_AS
UMLS/C0039840|LNC/MTHU008943|ALSO_CODED_AS
UMLS/C0039840|MSH/D013831|ALSO_CODED_AS
UMLS/C0039840|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0039840|NCI/C874|ALSO_CODED_AS
UMLS/C0039840|RXNORM/10454|ALSO_CODED_AS
UMLS/C0039840|VANDF/4017474|ALSO_CODED_AS
UMLS/C0039840|VANDF/4017777|ALSO_CODED_AS
UMLS/C0040329|LNC/LA31131-8|ALSO_CODED_AS
UMLS/C0040329|MSH/D062789|ALSO_CODED_AS
UMLS/C0040329|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0040329|NCI/C891|ALSO_CODED_AS
UMLS/C0040329|VANDF/4017291|ALSO_CODED_AS
UMLS/C0040329|VANDF/4024446|ALSO_CODED_AS
UMLS/C0042014|LNC/LP32744-2|ALSO_CODED_AS
UMLS/C0042014|LNC/LP74376-2|ALSO_CODED_AS
UMLS/C0042014|LNC/LP7851-1|ALSO_CODED_AS
UMLS/C0042014|LNC/MTHU000144|ALSO_CODED_AS
UMLS/C0042014|LNC/MTHU008386|ALSO_CODED_AS
UMLS/C0042014|MEDLINEPLUS/6355|ALSO_CODED_AS
UMLS/C0042014|MSH/D016482|ALSO_CODED_AS
UMLS/C0042014|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0042014|MTH/U000062|ALSO_CODED_AS
UMLS/C0042014|NCI/C17241|ALSO_CODED_AS
UMLS/C0042825|ICD9CM/95.05|ALSO_CODED_AS
UMLS/C0042825|MSH/D058609|ALSO_CODED_AS
UMLS/C0042825|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0042963|HPO/HP:0002013|ALSO_CODED_AS
UMLS/C0042963|LNC/LA15099-7|ALSO_CODED_AS
UMLS/C0042963|LNC/LP75864-6|ALSO_CODED_AS
UMLS/C0042963|LNC/MTHU013530|ALSO_CODED_AS
UMLS/C0042963|MEDLINEPLUS/489|ALSO_CODED_AS
UMLS/C0042963|MSH/D014839|ALSO_CODED_AS
UMLS/C0042963|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0042963|NCI/C3442|ALSO_CODED_AS
UMLS/C0042963|OMIM/MTHU000225|ALSO_CODED_AS
UMLS/C0043016|LNC/LA10117-2|ALSO_CODED_AS
UMLS/C0043016|MSH/D014853|ALSO_CODED_AS
UMLS/C0043016|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0043262|FMA/24922|ALSO_CODED_AS
UMLS/C0043262|LNC/LP221474-2|ALSO_CODED_AS
UMLS/C0043262|LNC/LP7733-1|ALSO_CODED_AS
UMLS/C0043262|LNC/MTHU002691|ALSO_CODED_AS
UMLS/C0043262|MSH/D014953|ALSO_CODED_AS
UMLS/C0043262|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0043262|NCI/C111033|ALSO_CODED_AS
UMLS/C0048719|MSH/C025417|ALSO_CODED_AS
UMLS/C0048719|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0048719|NCI/C156702|ALSO_CODED_AS
UMLS/C0066981|MSH/C034368|ALSO_CODED_AS
UMLS/C0085593|HPO/HP:0025143|ALSO_CODED_AS
UMLS/C0085593|LNC/LA30863-7|ALSO_CODED_AS
UMLS/C0085593|LNC/LP74618-7|ALSO_CODED_AS
UMLS/C0085593|LNC/MTHU013512|ALSO_CODED_AS
UMLS/C0085593|MSH/D023341|ALSO_CODED_AS
UMLS/C0085593|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0085593|NCI/C35143|ALSO_CODED_AS
UMLS/C0085636|HPO/HP:0000613|ALSO_CODED_AS
UMLS/C0085636|LNC/LA15103-7|ALSO_CODED_AS
UMLS/C0085636|LNC/LA24849-4|ALSO_CODED_AS
UMLS/C0085636|MSH/D020795|ALSO_CODED_AS
UMLS/C0085636|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0085636|NCI/C28210|ALSO_CODED_AS
UMLS/C0085636|OMIM/MTHU036378|ALSO_CODED_AS
UMLS/C0085655|ICD9CM/710.4|ALSO_CODED_AS
UMLS/C0085655|MSH/D017285|ALSO_CODED_AS
UMLS/C0085655|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0085655|NCI/C26925|ALSO_CODED_AS
UMLS/C0085655|OMIM/MTHU037341|ALSO_CODED_AS
UMLS/C0086024|LNC/LP15505-8|ALSO_CODED_AS
UMLS/C0086024|LNC/LP268966-1|ALSO_CODED_AS
UMLS/C0086024|LNC/MTHU004913|ALSO_CODED_AS
UMLS/C0086024|LNC/MTHU005166|ALSO_CODED_AS
UMLS/C0086024|MSH/D014805|ALSO_CODED_AS
UMLS/C0086024|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0086024|NCI/C939|ALSO_CODED_AS
UMLS/C0086024|RXNORM/42604|ALSO_CODED_AS
UMLS/C0086024|VANDF/4017907|ALSO_CODED_AS
UMLS/C0086097|MSH/D006515|ALSO_CODED_AS
UMLS/C0086097|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0086190|LNC/LA28141-2|ALSO_CODED_AS
UMLS/C0086190|LNC/LA29718-6|ALSO_CODED_AS
UMLS/C0086190|LNC/LP99406-8|ALSO_CODED_AS
UMLS/C0086190|LNC/MTHU035698|ALSO_CODED_AS
UMLS/C0086190|MSH/D013287|ALSO_CODED_AS
UMLS/C0086190|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0087162|LNC/LP31694-0|ALSO_CODED_AS
UMLS/C0087162|MSH/D025101|ALSO_CODED_AS
UMLS/C0087162|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0087162|NCI/C1334|ALSO_CODED_AS
UMLS/C0087162|RXNORM/42954|ALSO_CODED_AS
UMLS/C0087162|VANDF/4017779|ALSO_CODED_AS
UMLS/C0149871|HPO/HP:0002625|ALSO_CODED_AS
UMLS/C0149871|LNC/LA7425-7|ALSO_CODED_AS
UMLS/C0149871|LNC/LP266848-3|ALSO_CODED_AS
UMLS/C0149871|LNC/LP74706-0|ALSO_CODED_AS
UMLS/C0149871|LNC/MTHU020788|ALSO_CODED_AS
UMLS/C0149871|MEDLINEPLUS/1683|ALSO_CODED_AS
UMLS/C0149871|MSH/D020246|ALSO_CODED_AS
UMLS/C0149871|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0149871|NCI/C49343|ALSO_CODED_AS
UMLS/C0149871|OMIM/MTHU015932|ALSO_CODED_AS
UMLS/C0149871|OMIM/MTHU019524|ALSO_CODED_AS
UMLS/C0152307|FMA/61903|ALSO_CODED_AS
UMLS/C0152307|MSH/D009778|ALSO_CODED_AS
UMLS/C0152307|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0178842|MSH/D056228|ALSO_CODED_AS
UMLS/C0178842|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0200069|LNC/LA14524-5|ALSO_CODED_AS
UMLS/C0200069|LNC/LA19798-0|ALSO_CODED_AS
UMLS/C0200069|LNC/LP74053-7|ALSO_CODED_AS
UMLS/C0200069|LNC/LP7798-4|ALSO_CODED_AS
UMLS/C0200069|LNC/MTHU000074|ALSO_CODED_AS
UMLS/C0200069|LNC/MTHU008378|ALSO_CODED_AS
UMLS/C0200069|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0200069|NCI/C15413|ALSO_CODED_AS
UMLS/C0200627|LNC/LP30786-5|ALSO_CODED_AS
UMLS/C0200627|LNC/LP74091-7|ALSO_CODED_AS
UMLS/C0200627|LNC/MTHU008379|ALSO_CODED_AS
UMLS/C0200627|MTH/U002917|ALSO_CODED_AS
UMLS/C0205123|FMA/74529|ALSO_CODED_AS
UMLS/C0205123|FMA/74536|ALSO_CODED_AS
UMLS/C0205123|LNC/LP266855-8|ALSO_CODED_AS
UMLS/C0205123|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0205123|NCI/C161325|ALSO_CODED_AS
UMLS/C0205161|LNC/LA12748-2|ALSO_CODED_AS
UMLS/C0205161|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0205161|NCI/C25401|ALSO_CODED_AS
UMLS/C0221198|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0221198|NCI/C3824|ALSO_CODED_AS
UMLS/C0224264|FMA/38485|ALSO_CODED_AS
UMLS/C0224264|LNC/LP30511-7|ALSO_CODED_AS
UMLS/C0224264|LNC/MTHU014781|ALSO_CODED_AS
UMLS/C0224264|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0224264|NCI/C150849|ALSO_CODED_AS
UMLS/C0228174|FMA/61817|ALSO_CODED_AS
UMLS/C0228174|MSH/D054022|ALSO_CODED_AS
UMLS/C0228174|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0228174|NCI/C12351|ALSO_CODED_AS
UMLS/C0228186|FMA/83727|ALSO_CODED_AS
UMLS/C0228186|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0228186|NCI/C33005|ALSO_CODED_AS
UMLS/C0228187|FMA/77801|ALSO_CODED_AS
UMLS/C0228187|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0228187|NCI/C32615|ALSO_CODED_AS
UMLS/C0228465|FMA/76925|ALSO_CODED_AS
UMLS/C0228465|NCI/C32726|ALSO_CODED_AS
UMLS/C0230420|LNC/LP29949-2|ALSO_CODED_AS
UMLS/C0230420|LNC/MTHU012599|ALSO_CODED_AS
UMLS/C0232462|HPO/HP:0004396|ALSO_CODED_AS
UMLS/C0232462|LNC/LP121703-5|ALSO_CODED_AS
UMLS/C0232462|LNC/MTHU039885|ALSO_CODED_AS
UMLS/C0232462|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0232462|OMIM/MTHU004224|ALSO_CODED_AS
UMLS/C0232462|OMIM/MTHU014773|ALSO_CODED_AS
UMLS/C0234130|LNC/LP207344-5|ALSO_CODED_AS
UMLS/C0234130|LNC/LP30529-9|ALSO_CODED_AS
UMLS/C0234130|LNC/MTHU015052|ALSO_CODED_AS
UMLS/C0234527|MSH/D001072|ALSO_CODED_AS
UMLS/C0237543|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0242192|MSH/D001219|ALSO_CODED_AS
UMLS/C0242192|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0242192|MTH/U000327|ALSO_CODED_AS
UMLS/C0242192|NCI/C25202|ALSO_CODED_AS
UMLS/C0271202|HPO/HP:0030516|ALSO_CODED_AS
UMLS/C0271202|ICD9CM/368.46|ALSO_CODED_AS
UMLS/C0271202|MSH/D006423|ALSO_CODED_AS
UMLS/C0332448|LNC/LA26030-9|ALSO_CODED_AS
UMLS/C0332448|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0332448|NCI/C25754|ALSO_CODED_AS
UMLS/C0423618|MSH/D006261|ALSO_CODED_AS
UMLS/C0427008|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0427008|OMIM/MTHU001298|ALSO_CODED_AS
UMLS/C0427008|OMIM/MTHU012550|ALSO_CODED_AS
UMLS/C0439840|GO/GO:0060004|ALSO_CODED_AS
UMLS/C0439840|MTH/U002855|ALSO_CODED_AS
UMLS/C0441640|LNC/LA9204-4|ALSO_CODED_AS
UMLS/C0441640|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0441640|NCI/C71482|ALSO_CODED_AS
UMLS/C0442025|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0481354|ICD9CM/E929.0|ALSO_CODED_AS
UMLS/C0520966|HPO/HP:0002311|ALSO_CODED_AS
UMLS/C0520966|ICD9CM/781.3|ALSO_CODED_AS
UMLS/C0520966|MSH/D001259|ALSO_CODED_AS
UMLS/C0520966|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0520966|OMIM/MTHU000948|ALSO_CODED_AS
UMLS/C0520966|OMIM/MTHU005124|ALSO_CODED_AS
UMLS/C0520966|OMIM/MTHU008070|ALSO_CODED_AS
UMLS/C0520966|OMIM/MTHU008853|ALSO_CODED_AS
UMLS/C0520966|OMIM/MTHU061012|ALSO_CODED_AS
UMLS/C0520966|OMIM/MTHU064975|ALSO_CODED_AS
UMLS/C0521654|LNC/LA31814-9|ALSO_CODED_AS
UMLS/C0521654|LNC/LA7458-8|ALSO_CODED_AS
UMLS/C0521654|MSH/D009461|ALSO_CODED_AS
UMLS/C0521654|NCI/C116600|ALSO_CODED_AS
UMLS/C0521654|OMIM/MTHU024651|ALSO_CODED_AS
UMLS/C0521654|OMIM/MTHU041954|ALSO_CODED_AS
UMLS/C0533584|MSH/C103292|ALSO_CODED_AS
UMLS/C0559499|FMA/37670|ALSO_CODED_AS
UMLS/C0559499|LNC/LP30510-9|ALSO_CODED_AS
UMLS/C0559499|LNC/MTHU014778|ALSO_CODED_AS
UMLS/C0559499|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0559499|NCI/C32200|ALSO_CODED_AS
UMLS/C0582103|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0582103|NCI/C25305|ALSO_CODED_AS
UMLS/C0592278|MSH/D011899|ALSO_CODED_AS
UMLS/C0592278|NCI/C66506|ALSO_CODED_AS
UMLS/C0592278|RXNORM/152523|ALSO_CODED_AS
UMLS/C0682708|FMA/83929|ALSO_CODED_AS
UMLS/C0682708|MSH/D066127|ALSO_CODED_AS
UMLS/C0682708|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0682708|NCI/C33892|ALSO_CODED_AS
UMLS/C0694547|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0694547|NCI/C167441|ALSO_CODED_AS
UMLS/C0694547|OMIM/MTHU057264|ALSO_CODED_AS
UMLS/C0699129|MSH/D014859|ALSO_CODED_AS
UMLS/C0699129|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0699129|NCI/C1658|ALSO_CODED_AS
UMLS/C0699129|RXNORM/202421|ALSO_CODED_AS
UMLS/C0699177|MSH/D006886|ALSO_CODED_AS
UMLS/C0699177|NCI/C29101|ALSO_CODED_AS
UMLS/C0699177|RXNORM/202462|ALSO_CODED_AS
UMLS/C0699279|MSH/D001379|ALSO_CODED_AS
UMLS/C0699279|NCI/C47961|ALSO_CODED_AS
UMLS/C0699279|RXNORM/202559|ALSO_CODED_AS
UMLS/C0699319|LNC/LA14335-6|ALSO_CODED_AS
UMLS/C0699319|MSH/D003520|ALSO_CODED_AS
UMLS/C0699512|MSH/D010672|ALSO_CODED_AS
UMLS/C0699512|NCI/C48011|ALSO_CODED_AS
UMLS/C0699512|RXNORM/202740|ALSO_CODED_AS
UMLS/C0699702|MSH/D017258|ALSO_CODED_AS
UMLS/C0699702|NCI/C1155|ALSO_CODED_AS
UMLS/C0699702|RXNORM/202888|ALSO_CODED_AS
UMLS/C0699710|MSH/D004966|ALSO_CODED_AS
UMLS/C0699710|NCI/C482|ALSO_CODED_AS
UMLS/C0699710|RXNORM/202896|ALSO_CODED_AS
UMLS/C0702266|ICD9CM/288.65|ALSO_CODED_AS
UMLS/C0702266|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0728763|MSH/D015773|ALSO_CODED_AS
UMLS/C0728763|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0728763|NCI/C468|ALSO_CODED_AS
UMLS/C0728763|RXNORM/224921|ALSO_CODED_AS
UMLS/C0751396|MSH/D009837|ALSO_CODED_AS
UMLS/C0751396|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0751396|NCI/C3288|ALSO_CODED_AS
UMLS/C0751466|HPO/HP:0002183|ALSO_CODED_AS
UMLS/C0751466|MSH/D012001|ALSO_CODED_AS
UMLS/C0751466|NCI/C122579|ALSO_CODED_AS
UMLS/C0751466|OMIM/MTHU003238|ALSO_CODED_AS
UMLS/C0853716|HPO/HP:0031807|ALSO_CODED_AS
UMLS/C0853716|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0853716|NCI/C34414|ALSO_CODED_AS
UMLS/C0878575|HPO/HP:0011096|ALSO_CODED_AS
UMLS/C0878575|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0915981|MSH/C411282|ALSO_CODED_AS
UMLS/C0917711|LNC/LA9478-4|ALSO_CODED_AS
UMLS/C0917711|MEDLINEPLUS/3953|ALSO_CODED_AS
UMLS/C0917711|MSH/D008279|ALSO_CODED_AS
UMLS/C0917711|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0969682|MSH/D024803|ALSO_CODED_AS
UMLS/C0969683|MSH/D024803|ALSO_CODED_AS
UMLS/C0994191|MTH/NOCODE|ALSO_CODED_AS
UMLS/C1140618|FMA/7183|ALSO_CODED_AS
UMLS/C1140618|LNC/LA18113-3|ALSO_CODED_AS
UMLS/C1140618|LNC/LA30845-4|ALSO_CODED_AS
UMLS/C1140618|LNC/LP200031-5|ALSO_CODED_AS
UMLS/C1140618|LNC/LP29957-5|ALSO_CODED_AS
UMLS/C1140618|LNC/MTHU011974|ALSO_CODED_AS
UMLS/C1140618|MSH/D034941|ALSO_CODED_AS
UMLS/C1140618|MTH/NOCODE|ALSO_CODED_AS
UMLS/C1140618|NCI/C12671|ALSO_CODED_AS
UMLS/C1179687|FMA/63503|ALSO_CODED_AS
UMLS/C1179687|MTH/NOCODE|ALSO_CODED_AS
UMLS/C1179688|FMA/63504|ALSO_CODED_AS
UMLS/C1179688|MTH/NOCODE|ALSO_CODED_AS
UMLS/C1184145|FMA/74525|ALSO_CODED_AS
UMLS/C1184145|NCI/C161326|ALSO_CODED_AS
UMLS/C1260928|MTH/NOCODE|ALSO_CODED_AS
UMLS/C1262477|HPO/HP:0001824|ALSO_CODED_AS
UMLS/C1262477|HPO/HP:0004325|ALSO_CODED_AS
UMLS/C1262477|ICD9CM/783.21|ALSO_CODED_AS
UMLS/C1262477|LNC/LP75884-4|ALSO_CODED_AS
UMLS/C1262477|LNC/MTHU020881|ALSO_CODED_AS
UMLS/C1262477|MSH/D015431|ALSO_CODED_AS
UMLS/C1262477|MTH/NOCODE|ALSO_CODED_AS
UMLS/C1262477|NCI/C3445|ALSO_CODED_AS
UMLS/C1262477|OMIM/MTHU004026|ALSO_CODED_AS
UMLS/C1262477|OMIM/MTHU005164|ALSO_CODED_AS
UMLS/C1262477|OMIM/MTHU012809|ALSO_CODED_AS
UMLS/C1262477|OMIM/MTHU072943|ALSO_CODED_AS
UMLS/C1293134|MTH/NOCODE|ALSO_CODED_AS
UMLS/C1293134|NCI/C73432|ALSO_CODED_AS
UMLS/C1322271|FMA/321842|ALSO_CODED_AS
UMLS/C1322271|MSH/D014955|ALSO_CODED_AS
UMLS/C1322271|MTH/NOCODE|ALSO_CODED_AS
UMLS/C1322271|NCI/C33894|ALSO_CODED_AS
UMLS/C1332750|HGNC/HGNC:1836|ALSO_CODED_AS
UMLS/C1332750|MTH/NOCODE|ALSO_CODED_AS
UMLS/C1332750|NCI/C28532|ALSO_CODED_AS
UMLS/C1332750|OMIM/600749|ALSO_CODED_AS
UMLS/C1413766|HGNC/HGNC:2469|ALSO_CODED_AS
UMLS/C1413766|MTH/NOCODE|ALSO_CODED_AS
UMLS/C1413766|OMIM/123876|ALSO_CODED_AS
UMLS/C1414461|HGNC/HGNC:3467|ALSO_CODED_AS
UMLS/C1414461|MTH/NOCODE|ALSO_CODED_AS
UMLS/C1414461|NCI/C38349|ALSO_CODED_AS
UMLS/C1414461|OMIM/133430|ALSO_CODED_AS
UMLS/C1415181|HGNC/HGNC:4432|ALSO_CODED_AS
UMLS/C1415181|MTH/NOCODE|ALSO_CODED_AS
UMLS/C1415181|NCI/C38499|ALSO_CODED_AS
UMLS/C1415181|OMIM/138180|ALSO_CODED_AS
UMLS/C1419129|HGNC/HGNC:9689|ALSO_CODED_AS
UMLS/C1419129|MTH/NOCODE|ALSO_CODED_AS
UMLS/C1419129|OMIM/612719|ALSO_CODED_AS
UMLS/C1420113|HGNC/HGNC:10933|ALSO_CODED_AS
UMLS/C1420113|LNC/LP208425-1|ALSO_CODED_AS
UMLS/C1420113|MTH/NOCODE|ALSO_CODED_AS
UMLS/C1420113|OMIM/604322|ALSO_CODED_AS
UMLS/C1446409|MTH/NOCODE|ALSO_CODED_AS
UMLS/C1446409|NCI/C25246|ALSO_CODED_AS
UMLS/C1449722|MSH/D010129|ALSO_CODED_AS
UMLS/C1449722|MTH/NOCODE|ALSO_CODED_AS
UMLS/C1456461|HGNC/HGNC:4818|ALSO_CODED_AS
UMLS/C1456461|MTH/NOCODE|ALSO_CODED_AS
UMLS/C1456461|OMIM/601463|ALSO_CODED_AS
UMLS/C1457868|LNC/LA11011-6|ALSO_CODED_AS
UMLS/C1457868|LNC/LA14960-1|ALSO_CODED_AS
UMLS/C1457868|LNC/LA32282-8|ALSO_CODED_AS
UMLS/C1457868|LNC/LA66-6|ALSO_CODED_AS
UMLS/C1457868|MTH/NOCODE|ALSO_CODED_AS
UMLS/C1457868|NCI/C71686|ALSO_CODED_AS
UMLS/C1457887|ICD9CM/780-789.99|ALSO_CODED_AS
UMLS/C1457887|LNC/LP185406-8|ALSO_CODED_AS
UMLS/C1457887|LNC/LP75708-5|ALSO_CODED_AS
UMLS/C1457887|LNC/MTHU021540|ALSO_CODED_AS
UMLS/C1457887|LNC/MTHU048142|ALSO_CODED_AS
UMLS/C1457887|MTH/NOCODE|ALSO_CODED_AS
UMLS/C1457887|NCI/C4876|ALSO_CODED_AS
UMLS/C1512399|NCI/C32727|ALSO_CODED_AS
UMLS/C1514241|LNC/LA26053-1|ALSO_CODED_AS
UMLS/C1514241|LNC/LA6576-8|ALSO_CODED_AS
UMLS/C1514241|MTH/NOCODE|ALSO_CODED_AS
UMLS/C1514241|NCI/C38758|ALSO_CODED_AS
UMLS/C1555288|MTH/NOCODE|ALSO_CODED_AS
UMLS/C1704258|MTH/NOCODE|ALSO_CODED_AS
UMLS/C1704258|NCI/C9440|ALSO_CODED_AS
UMLS/C1706041|MTH/NOCODE|ALSO_CODED_AS
UMLS/C1706041|NCI/C52527|ALSO_CODED_AS
UMLS/C1706235|MTH/NOCODE|ALSO_CODED_AS
UMLS/C1706235|NCI/C51574|ALSO_CODED_AS
UMLS/C1706600|MTH/NOCODE|ALSO_CODED_AS
UMLS/C1706600|NCI/C51051|ALSO_CODED_AS
UMLS/C1709077|NCI/C50103|ALSO_CODED_AS
UMLS/C1711202|LNC/LP200054-7|ALSO_CODED_AS
UMLS/C1711202|NCI/C51654|ALSO_CODED_AS
UMLS/C1833300|OMIM/MTHU006304|ALSO_CODED_AS
UMLS/C1872855|MSH/C517212|ALSO_CODED_AS
UMLS/C1872855|MTH/NOCODE|ALSO_CODED_AS
UMLS/C1872855|NCI/C25920|ALSO_CODED_AS
UMLS/C1873497|MTH/NOCODE|ALSO_CODED_AS
UMLS/C1873497|OMIM/MTHU002946|ALSO_CODED_AS
UMLS/C1882346|NCI/C62777|ALSO_CODED_AS
UMLS/C1995013|FMA/32558|ALSO_CODED_AS
UMLS/C1995013|MTH/NOCODE|ALSO_CODED_AS
UMLS/C2242996|LNC/LA30858-7|ALSO_CODED_AS
UMLS/C2242996|MTH/NOCODE|ALSO_CODED_AS
UMLS/C2242996|NCI/C50771|ALSO_CODED_AS
UMLS/C2242996|OMIM/MTHU021951|ALSO_CODED_AS
UMLS/C2242996|OMIM/MTHU067008|ALSO_CODED_AS
UMLS/C2351011|MSH/D024505|ALSO_CODED_AS
UMLS/C2351012|MSH/D024505|ALSO_CODED_AS
UMLS/C2713234|LNC/52497-5|ALSO_CODED_AS
UMLS/C2713234|MTH/NOCODE|ALSO_CODED_AS
UMLS/C2826539|MTH/NOCODE|ALSO_CODED_AS
UMLS/C2826539|NCI/C82853|ALSO_CODED_AS
UMLS/C3146295|LNC/LP7653-1|ALSO_CODED_AS
UMLS/C3146295|LNC/MTHU014783|ALSO_CODED_AS
UMLS/C3146295|MTH/NOCODE|ALSO_CODED_AS
UMLS/C3146295|NCI/C33812|ALSO_CODED_AS
UMLS/C3486148|RXNORM/1305201|ALSO_CODED_AS
UMLS/C3496642|MTH/NOCODE|ALSO_CODED_AS
UMLS/C3714552|ICD9CM/799.3|ALSO_CODED_AS
UMLS/C3714552|LNC/LP75880-2|ALSO_CODED_AS
UMLS/C3714552|LNC/MTHU013531|ALSO_CODED_AS
UMLS/C3714552|MSH/D000073496|ALSO_CODED_AS
UMLS/C3714552|MTH/NOCODE|ALSO_CODED_AS
UMLS/C3714552|NCI/C50809|ALSO_CODED_AS
UMLS/C3714552|OMIM/MTHU036428|ALSO_CODED_AS
UMLS/C3714552|OMIM/MTHU037795|ALSO_CODED_AS
UMLS/C3714552|OMIM/MTHU038351|ALSO_CODED_AS
UMLS/C3714787|FMA/55675|ALSO_CODED_AS
UMLS/C3714787|LNC/LA22164-0|ALSO_CODED_AS
UMLS/C3714787|LNC/LA4174-4|ALSO_CODED_AS
UMLS/C3714787|LNC/LP422652-0|ALSO_CODED_AS
UMLS/C3714787|LNC/MTHU065908|ALSO_CODED_AS
UMLS/C3714787|MSH/D002490|ALSO_CODED_AS
UMLS/C3714787|MTH/NOCODE|ALSO_CODED_AS
UMLS/C3714787|NCI/C12438|ALSO_CODED_AS
UMLS/C3714787|OMIM/MTHU000058|ALSO_CODED_AS
UMLS/C3811621|LNC/LA14562-5|ALSO_CODED_AS
UMLS/C3811621|MTH/NOCODE|ALSO_CODED_AS
UMLS/C3838679|LNC/LA11844-0|ALSO_CODED_AS
UMLS/C3838679|MTH/NOCODE|ALSO_CODED_AS
UMLS/C3887875|HPO/HP:0001123|ALSO_CODED_AS
UMLS/C3887875|ICD9CM/368.4|ALSO_CODED_AS
UMLS/C3887875|ICD9CM/368.40|ALSO_CODED_AS
UMLS/C3887875|LNC/LP201274-0|ALSO_CODED_AS
UMLS/C3887875|LNC/MTHU051243|ALSO_CODED_AS
UMLS/C3887875|MTH/NOCODE|ALSO_CODED_AS
UMLS/C3887875|NCI/C118727|ALSO_CODED_AS
UMLS/C3887875|OMIM/MTHU035290|ALSO_CODED_AS
UMLS/C3887875|OMIM/MTHU037111|ALSO_CODED_AS
UMLS/C3887875|OMIM/MTHU039065|ALSO_CODED_AS
UMLS/C3887875|OMIM/MTHU045031|ALSO_CODED_AS
UMLS/C4036205|LNC/LA6745-9|ALSO_CODED_AS
UMLS/C4053487|MTH/NOCODE|ALSO_CODED_AS
UMLS/C4053487|NCI/C121777|ALSO_CODED_AS
UMLS/C4068812|LNC/LA25149-8|ALSO_CODED_AS
UMLS/C4068813|LNC/LA25148-0|ALSO_CODED_AS
UMLS/C4083049|FMA/30316|ALSO_CODED_AS
UMLS/C4083049|FMA/5022|ALSO_CODED_AS
UMLS/C4083049|LNC/LA24800-7|ALSO_CODED_AS
UMLS/C4083049|LNC/LP234848-2|ALSO_CODED_AS
UMLS/C4083049|MTH/NOCODE|ALSO_CODED_AS
UMLS/C4083049|NCI/C13056|ALSO_CODED_AS
UMLS/C4084902|MTH/NOCODE|ALSO_CODED_AS
UMLS/C4084902|NCI/C125461|ALSO_CODED_AS
UMLS/C4227868|OMIM/MTHU052802|ALSO_CODED_AS
UMLS/C4230085|OMIM/MTHU068777|ALSO_CODED_AS
UMLS/C4266577|LNC/LP206620-9|ALSO_CODED_AS
UMLS/C4266577|LNC/MTHU051712|ALSO_CODED_AS
UMLS/C4266577|MTH/NOCODE|ALSO_CODED_AS
UMLS/C4281786|HPO/HP:0003651|ALSO_CODED_AS
UMLS/C4281786|MTH/NOCODE|ALSO_CODED_AS
UMLS/C4285005|LNC/LP221488-2|ALSO_CODED_AS
UMLS/C4285005|LNC/MTHU053713|ALSO_CODED_AS
UMLS/C4285005|MTH/NOCODE|ALSO_CODED_AS
UMLS/C4285347|LNC/LP220355-4|ALSO_CODED_AS
UMLS/C4285347|LNC/LP220356-2|ALSO_CODED_AS
UMLS/C4285347|LNC/MTHU054543|ALSO_CODED_AS
UMLS/C4285347|MTH/NOCODE|ALSO_CODED_AS
UMLS/C4289861|NCI/C128235|ALSO_CODED_AS
UMLS/C4298907|LNC/LP221473-4|ALSO_CODED_AS
UMLS/C4298907|LNC/MTHU053734|ALSO_CODED_AS
UMLS/C4298907|MTH/NOCODE|ALSO_CODED_AS
UMLS/C4299094|LNC/LP221450-2|ALSO_CODED_AS
UMLS/C4299094|LNC/MTHU053770|ALSO_CODED_AS
UMLS/C4299094|MTH/NOCODE|ALSO_CODED_AS
UMLS/C4314713|OMIM/MTHU054974|ALSO_CODED_AS
UMLS/C4314814|OMIM/MTHU054858|ALSO_CODED_AS
UMLS/C4527419|NCI/C138177|ALSO_CODED_AS
UMLS/C4554543|LNC/LA21963-6|ALSO_CODED_AS
UMLS/C4554543|MTH/NOCODE|ALSO_CODED_AS
UMLS/C4687421|NCI/C146686|ALSO_CODED_AS
UMLS/C4693091|OMIM/MTHU060428|ALSO_CODED_AS
UMLS/C4723682|MTH/NOCODE|ALSO_CODED_AS
UMLS/C4723682|NCI/C150215|ALSO_CODED_AS
UMLS/C4723717|MTH/NOCODE|ALSO_CODED_AS
UMLS/C4723717|NCI/C150217|ALSO_CODED_AS
UMLS/C4744828|NCI/C156447|ALSO_CODED_AS
UMLS/C5195254|OMIM/MTHU064668|ALSO_CODED_AS
UMLS/C5200950|LNC/LA6115-5|ALSO_CODED_AS
UMLS/C5200950|MTH/NOCODE|ALSO_CODED_AS
UMLS/C5205657|NCI/C160918|ALSO_CODED_AS
UMLS/C5206307|NCI/C162076|ALSO_CODED_AS
UMLS/C5401399|MTH/NOCODE|ALSO_CODED_AS
UMLS/C5401399|NCI/C174212|ALSO_CODED_AS
UMLS/C5418622|NCI/C170564|ALSO_CODED_AS
UMLS/C5418804|NCI/C170797|ALSO_CODED_AS
UMLS/C5444025|MTH/NOCODE|ALSO_CODED_AS
UMLS/C5543199|OMIM/MTHU072954|ALSO_CODED_AS
UMLS/C0005558|LNC/LA15393-4|ALSO_CODED_AS
UMLS/C0005558|LNC/LA3911-0|ALSO_CODED_AS
UMLS/C0005558|LNC/LP200041-4|ALSO_CODED_AS
UMLS/C0005558|LNC/LP68311-7|ALSO_CODED_AS
UMLS/C0005558|LNC/MTHU028106|ALSO_CODED_AS
UMLS/C0005558|MEDLINEPLUS/5921|ALSO_CODED_AS
UMLS/C0005558|MSH/D001706|ALSO_CODED_AS
UMLS/C0005558|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0005558|NCI/C15189|ALSO_CODED_AS
UMLS/C0006663|HPO/HP:0003761|ALSO_CODED_AS
UMLS/C0006663|MSH/D002114|ALSO_CODED_AS
UMLS/C0006663|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0006663|NCI/C3672|ALSO_CODED_AS
UMLS/C0006663|OMIM/MTHU060902|ALSO_CODED_AS
UMLS/C0007473|FMA/50772|ALSO_CODED_AS
UMLS/C0007473|MSH/D002426|ALSO_CODED_AS
UMLS/C0007473|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0007473|NCI/C12690|ALSO_CODED_AS
UMLS/C0007594|MSH/D002459|ALSO_CODED_AS
UMLS/C0007594|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0007594|NCI/C16401|ALSO_CODED_AS
UMLS/C0009244|MSH/D015928|ALSO_CODED_AS
UMLS/C0009244|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0009244|NCI/C64345|ALSO_CODED_AS
UMLS/C0012569|HPO/HP:0000651|ALSO_CODED_AS
UMLS/C0012569|ICD9CM/368.2|ALSO_CODED_AS
UMLS/C0012569|LNC/LA15082-3|ALSO_CODED_AS
UMLS/C0012569|MSH/D004172|ALSO_CODED_AS
UMLS/C0012569|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0012569|NCI/C37941|ALSO_CODED_AS
UMLS/C0012569|OMIM/MTHU000786|ALSO_CODED_AS
UMLS/C0012569|OMIM/MTHU062371|ALSO_CODED_AS
UMLS/C0015252|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0015252|NCI/C158758|ALSO_CODED_AS
UMLS/C0015300|HPO/HP:0000520|ALSO_CODED_AS
UMLS/C0015300|ICD9CM/376.30|ALSO_CODED_AS
UMLS/C0015300|MSH/D005094|ALSO_CODED_AS
UMLS/C0015300|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0015300|NCI/C118763|ALSO_CODED_AS
UMLS/C0015300|NCI/C87114|ALSO_CODED_AS
UMLS/C0015300|OMIM/MTHU001173|ALSO_CODED_AS
UMLS/C0015300|OMIM/MTHU004615|ALSO_CODED_AS
UMLS/C0015300|OMIM/MTHU005786|ALSO_CODED_AS
UMLS/C0015300|OMIM/MTHU016288|ALSO_CODED_AS
UMLS/C0015300|OMIM/MTHU019358|ALSO_CODED_AS
UMLS/C0015392|FMA/12513|ALSO_CODED_AS
UMLS/C0015392|LNC/LA14722-5|ALSO_CODED_AS
UMLS/C0015392|LNC/LP117007-7|ALSO_CODED_AS
UMLS/C0015392|LNC/LP207778-4|ALSO_CODED_AS
UMLS/C0015392|LNC/LP7218-3|ALSO_CODED_AS
UMLS/C0015392|LNC/LP7222-5|ALSO_CODED_AS
UMLS/C0015392|LNC/LP7797-6|ALSO_CODED_AS
UMLS/C0015392|LNC/MTHU000064|ALSO_CODED_AS
UMLS/C0015392|LNC/MTHU001409|ALSO_CODED_AS
UMLS/C0015392|LNC/MTHU001430|ALSO_CODED_AS
UMLS/C0015392|LNC/MTHU038905|ALSO_CODED_AS
UMLS/C0015392|MSH/D005123|ALSO_CODED_AS
UMLS/C0015392|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0015392|MTH/U003284|ALSO_CODED_AS
UMLS/C0015392|NCI/C12401|ALSO_CODED_AS
UMLS/C0015392|OMIM/MTHU000020|ALSO_CODED_AS
UMLS/C0018681|HPO/HP:0002315|ALSO_CODED_AS
UMLS/C0018681|ICD9CM/784.0|ALSO_CODED_AS
UMLS/C0018681|LNC/LA15854-5|ALSO_CODED_AS
UMLS/C0018681|LNC/LA15903-0|ALSO_CODED_AS
UMLS/C0018681|LNC/LP217220-5|ALSO_CODED_AS
UMLS/C0018681|LNC/LP74908-2|ALSO_CODED_AS
UMLS/C0018681|LNC/MTHU020860|ALSO_CODED_AS
UMLS/C0018681|LNC/MTHU053651|ALSO_CODED_AS
UMLS/C0018681|MEDLINEPLUS/273|ALSO_CODED_AS
UMLS/C0018681|MSH/D006261|ALSO_CODED_AS
UMLS/C0018681|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0018681|NCI/C34661|ALSO_CODED_AS
UMLS/C0018681|OMIM/MTHU036348|ALSO_CODED_AS
UMLS/C0018681|OMIM/MTHU036635|ALSO_CODED_AS
UMLS/C0025286|HPO/HP:0002858|ALSO_CODED_AS
UMLS/C0025286|MSH/D008579|ALSO_CODED_AS
UMLS/C0025286|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0025286|NCI/C3230|ALSO_CODED_AS
UMLS/C0025286|OMIM/190040|ALSO_CODED_AS
UMLS/C0025286|OMIM/601728|ALSO_CODED_AS
UMLS/C0025286|OMIM/MTHU003590|ALSO_CODED_AS
UMLS/C0025286|OMIM/MTHU036996|ALSO_CODED_AS
UMLS/C0027651|HPO/HP:0002664|ALSO_CODED_AS
UMLS/C0027651|ICD9CM/140-239.99|ALSO_CODED_AS
UMLS/C0027651|LNC/LA16304-0|ALSO_CODED_AS
UMLS/C0027651|LNC/LP207120-9|ALSO_CODED_AS
UMLS/C0027651|LNC/LP7664-8|ALSO_CODED_AS
UMLS/C0027651|LNC/MTHU010346|ALSO_CODED_AS
UMLS/C0027651|MEDLINEPLUS/25|ALSO_CODED_AS
UMLS/C0027651|MSH/D009369|ALSO_CODED_AS
UMLS/C0027651|MTH/471|ALSO_CODED_AS
UMLS/C0027651|MTH/755|ALSO_CODED_AS
UMLS/C0027651|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0027651|NCI/C3262|ALSO_CODED_AS
UMLS/C0027651|OMIM/MTHU000126|ALSO_CODED_AS
UMLS/C0029130|FMA/50863|ALSO_CODED_AS
UMLS/C0029130|LNC/LA24828-8|ALSO_CODED_AS
UMLS/C0029130|LNC/LP201259-1|ALSO_CODED_AS
UMLS/C0029130|MSH/D009900|ALSO_CODED_AS
UMLS/C0029130|MTH/U002120|ALSO_CODED_AS
UMLS/C0029130|NCI/C12761|ALSO_CODED_AS
UMLS/C0029132|MEDLINEPLUS/6427|ALSO_CODED_AS
UMLS/C0029132|MSH/D009901|ALSO_CODED_AS
UMLS/C0029132|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0029132|NCI/C79698|ALSO_CODED_AS
UMLS/C0030193|HPO/HP:0012531|ALSO_CODED_AS
UMLS/C0030193|ICD9CM/338-338.99|ALSO_CODED_AS
UMLS/C0030193|LNC/LA17107-6|ALSO_CODED_AS
UMLS/C0030193|LNC/LA27491-2|ALSO_CODED_AS
UMLS/C0030193|LNC/LA7460-4|ALSO_CODED_AS
UMLS/C0030193|LNC/LP75331-6|ALSO_CODED_AS
UMLS/C0030193|LNC/LP75342-3|ALSO_CODED_AS
UMLS/C0030193|LNC/MTHU021175|ALSO_CODED_AS
UMLS/C0030193|LNC/MTHU029813|ALSO_CODED_AS
UMLS/C0030193|MEDLINEPLUS/351|ALSO_CODED_AS
UMLS/C0030193|MSH/D010146|ALSO_CODED_AS
UMLS/C0030193|MTH/306|ALSO_CODED_AS
UMLS/C0030193|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0030193|NCI/C25271|ALSO_CODED_AS
UMLS/C0030193|NCI/C3303|ALSO_CODED_AS
UMLS/C0030193|OMIM/MTHU033713|ALSO_CODED_AS
UMLS/C0037885|FMA/54683|ALSO_CODED_AS
UMLS/C0037885|MSH/D013101|ALSO_CODED_AS
UMLS/C0037885|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0037885|NCI/C12278|ALSO_CODED_AS
UMLS/C0037935|ICD9CM/81.0|ALSO_CODED_AS
UMLS/C0037935|ICD9CM/81.00|ALSO_CODED_AS
UMLS/C0037935|MSH/D013123|ALSO_CODED_AS
UMLS/C0037935|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0037935|NCI/C157986|ALSO_CODED_AS
UMLS/C0040405|LNC/LA24329-7|ALSO_CODED_AS
UMLS/C0040405|LNC/LA9477-6|ALSO_CODED_AS
UMLS/C0040405|LNC/LP200067-9|ALSO_CODED_AS
UMLS/C0040405|LNC/LP6207-7|ALSO_CODED_AS
UMLS/C0040405|MEDLINEPLUS/3951|ALSO_CODED_AS
UMLS/C0040405|MSH/D014057|ALSO_CODED_AS
UMLS/C0040405|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0040405|NCI/C17204|ALSO_CODED_AS
UMLS/C0041671|LNC/LA29720-2|ALSO_CODED_AS
UMLS/C0041671|MSH/D001289|ALSO_CODED_AS
UMLS/C0041671|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0041671|OMIM/MTHU004474|ALSO_CODED_AS
UMLS/C0041671|OMIM/MTHU007687|ALSO_CODED_AS
UMLS/C0041671|OMIM/MTHU021250|ALSO_CODED_AS
UMLS/C0041671|OMIM/MTHU033846|ALSO_CODED_AS
UMLS/C0041671|OMIM/MTHU060591|ALSO_CODED_AS
UMLS/C0042789|GO/GO:0007601|ALSO_CODED_AS
UMLS/C0042789|LNC/LA28160-2|ALSO_CODED_AS
UMLS/C0042789|LNC/LP30560-4|ALSO_CODED_AS
UMLS/C0042789|LNC/LP75855-4|ALSO_CODED_AS
UMLS/C0042789|LNC/MTHU014733|ALSO_CODED_AS
UMLS/C0042789|LNC/MTHU051591|ALSO_CODED_AS
UMLS/C0042789|MSH/D014785|ALSO_CODED_AS
UMLS/C0042789|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0042789|NCI/C38533|ALSO_CODED_AS
UMLS/C0085635|HPO/HP:0030786|ALSO_CODED_AS
UMLS/C0085635|LNC/LA16376-8|ALSO_CODED_AS
UMLS/C0085635|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0085635|OMIM/MTHU057995|ALSO_CODED_AS
UMLS/C0085635|OMIM/MTHU072494|ALSO_CODED_AS
UMLS/C0154888|ICD9CM/363.34|ALSO_CODED_AS
UMLS/C0186005|ICD9CM/81.01|ALSO_CODED_AS
UMLS/C0186005|MSH/C538196|ALSO_CODED_AS
UMLS/C0187394|ICD9CM/81.26|ALSO_CODED_AS
UMLS/C0187402|ICD9CM/81.25|ALSO_CODED_AS
UMLS/C0187402|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0205146|LNC/LP6782-9|ALSO_CODED_AS
UMLS/C0205146|LNC/LP72094-3|ALSO_CODED_AS
UMLS/C0205146|LNC/MTHU009059|ALSO_CODED_AS
UMLS/C0205146|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0205146|NCI/C25244|ALSO_CODED_AS
UMLS/C0225317|LNC/LA4329-4|ALSO_CODED_AS
UMLS/C0225317|LNC/LP208038-2|ALSO_CODED_AS
UMLS/C0225317|LNC/LP234850-8|ALSO_CODED_AS
UMLS/C0225317|LNC/LP30469-8|ALSO_CODED_AS
UMLS/C0225317|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0225317|NCI/C12471|ALSO_CODED_AS
UMLS/C0229089|FMA/54449|ALSO_CODED_AS
UMLS/C0229089|LNC/LA14703-5|ALSO_CODED_AS
UMLS/C0229089|LNC/LA16257-0|ALSO_CODED_AS
UMLS/C0229089|LNC/LA18789-0|ALSO_CODED_AS
UMLS/C0229089|LNC/LP7220-9|ALSO_CODED_AS
UMLS/C0229089|LNC/MTHU013548|ALSO_CODED_AS
UMLS/C0229089|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0229089|NCI/C119333|ALSO_CODED_AS
UMLS/C0229118|LNC/LA15091-4|ALSO_CODED_AS
UMLS/C0229118|LNC/LA16259-6|ALSO_CODED_AS
UMLS/C0229118|LNC/LA18787-4|ALSO_CODED_AS
UMLS/C0229118|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0229118|NCI/C119335|ALSO_CODED_AS
UMLS/C0231239|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0233794|HPO/HP:0002354|ALSO_CODED_AS
UMLS/C0233794|LNC/LA56-7|ALSO_CODED_AS
UMLS/C0233794|LNC/LP36329-8|ALSO_CODED_AS
UMLS/C0233794|LNC/MTHU019385|ALSO_CODED_AS
UMLS/C0233794|MSH/D008569|ALSO_CODED_AS
UMLS/C0233794|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0233794|NCI/C78444|ALSO_CODED_AS
UMLS/C0233794|OMIM/MTHU000534|ALSO_CODED_AS
UMLS/C0233794|OMIM/MTHU003336|ALSO_CODED_AS
UMLS/C0233794|OMIM/MTHU008726|ALSO_CODED_AS
UMLS/C0239574|HPO/HP:0011134|ALSO_CODED_AS
UMLS/C0239574|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0239574|NCI/C35292|ALSO_CODED_AS
UMLS/C0278138|LNC/LA15111-0|ALSO_CODED_AS
UMLS/C0278138|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0333641|LNC/LA24637-3|ALSO_CODED_AS
UMLS/C0333641|MSH/D001284|ALSO_CODED_AS
UMLS/C0333641|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0333641|NCI/C79748|ALSO_CODED_AS
UMLS/C0333641|OMIM/MTHU006850|ALSO_CODED_AS
UMLS/C0338656|HPO/HP:0100543|ALSO_CODED_AS
UMLS/C0338656|LNC/LA15213-4|ALSO_CODED_AS
UMLS/C0338656|LNC/LP128695-6|ALSO_CODED_AS
UMLS/C0338656|LNC/MTHU040636|ALSO_CODED_AS
UMLS/C0338656|MSH/D060825|ALSO_CODED_AS
UMLS/C0338656|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0338656|NCI/C116921|ALSO_CODED_AS
UMLS/C0338656|NCI/C27101|ALSO_CODED_AS
UMLS/C0338656|NCI/C46083|ALSO_CODED_AS
UMLS/C0338656|OMIM/MTHU003329|ALSO_CODED_AS
UMLS/C0338656|OMIM/MTHU003399|ALSO_CODED_AS
UMLS/C0338656|OMIM/MTHU004473|ALSO_CODED_AS
UMLS/C0338656|OMIM/MTHU004914|ALSO_CODED_AS
UMLS/C0338656|OMIM/MTHU012485|ALSO_CODED_AS
UMLS/C0338656|OMIM/MTHU018589|ALSO_CODED_AS
UMLS/C0338656|OMIM/MTHU067784|ALSO_CODED_AS
UMLS/C0344232|HPO/HP:0000622|ALSO_CODED_AS
UMLS/C0344232|LNC/LA15105-2|ALSO_CODED_AS
UMLS/C0344232|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0344232|NCI/C27123|ALSO_CODED_AS
UMLS/C0344232|OMIM/MTHU000785|ALSO_CODED_AS
UMLS/C0344233|HPO/HP:0000575|ALSO_CODED_AS
UMLS/C0344233|MSH/D009898|ALSO_CODED_AS
UMLS/C0344233|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0347530|LNC/LP15428-3|ALSO_CODED_AS
UMLS/C0347530|LNC/MTHU008590|ALSO_CODED_AS
UMLS/C0347530|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0393706|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0393706|NCI/C116552|ALSO_CODED_AS
UMLS/C0450102|FMA/302850|ALSO_CODED_AS
UMLS/C0450102|FMA/302856|ALSO_CODED_AS
UMLS/C0450102|FMA/54774|ALSO_CODED_AS
UMLS/C0450102|LNC/LP230199-4|ALSO_CODED_AS
UMLS/C0450102|LNC/LP30143-9|ALSO_CODED_AS
UMLS/C0450102|LNC/MTHU053775|ALSO_CODED_AS
UMLS/C0450102|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0456909|HPO/HP:0000618|ALSO_CODED_AS
UMLS/C0456909|LNC/LA17710-7|ALSO_CODED_AS
UMLS/C0456909|MSH/D001766|ALSO_CODED_AS
UMLS/C0456909|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0456909|NCI/C97109|ALSO_CODED_AS
UMLS/C0456909|OMIM/MTHU001370|ALSO_CODED_AS
UMLS/C0554970|HPO/HP:0000543|ALSO_CODED_AS
UMLS/C0554970|OMIM/MTHU000685|ALSO_CODED_AS
UMLS/C0554970|OMIM/MTHU008076|ALSO_CODED_AS
UMLS/C0554970|OMIM/MTHU011096|ALSO_CODED_AS
UMLS/C0554970|OMIM/MTHU013743|ALSO_CODED_AS
UMLS/C0554970|OMIM/MTHU030342|ALSO_CODED_AS
UMLS/C0554970|OMIM/MTHU036072|ALSO_CODED_AS
UMLS/C0554970|OMIM/MTHU051310|ALSO_CODED_AS
UMLS/C0554970|OMIM/MTHU069605|ALSO_CODED_AS
UMLS/C0554970|OMIM/MTHU070605|ALSO_CODED_AS
UMLS/C0577559|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0577559|NCI/C34808|ALSO_CODED_AS
UMLS/C0577573|LNC/LP266903-6|ALSO_CODED_AS
UMLS/C0577573|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0578862|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0578862|NCI/C87143|ALSO_CODED_AS
UMLS/C0700042|FMA/54448|ALSO_CODED_AS
UMLS/C0700042|MTH/U003315|ALSO_CODED_AS
UMLS/C0728940|LNC/LA17736-2|ALSO_CODED_AS
UMLS/C0728940|LNC/LA8951-1|ALSO_CODED_AS
UMLS/C0728940|LNC/LP207803-0|ALSO_CODED_AS
UMLS/C0728940|LNC/MTHU052930|ALSO_CODED_AS
UMLS/C0728940|MTH/NOCODE|ALSO_CODED_AS
UMLS/C0728940|NCI/C15232|ALSO_CODED_AS
UMLS/C0746961|NCI/C50640|ALSO_CODED_AS
UMLS/C1315031|LNC/LP29681-1|ALSO_CODED_AS
UMLS/C1315031|LNC/MTHU000073|ALSO_CODED_AS
UMLS/C1315031|MTH/NOCODE|ALSO_CODED_AS
UMLS/C1533591|MTH/NOCODE|ALSO_CODED_AS
UMLS/C1837545|OMIM/MTHU001863|ALSO_CODED_AS
UMLS/C1839253|OMIM/MTHU006842|ALSO_CODED_AS
UMLS/C1839253|OMIM/MTHU034731|ALSO_CODED_AS
UMLS/C1840417|OMIM/MTHU017793|ALSO_CODED_AS
UMLS/C1861101|MSH/C536916|ALSO_CODED_AS
UMLS/C1861101|MTH/NOCODE|ALSO_CODED_AS
UMLS/C1861101|OMIM/188560|ALSO_CODED_AS
UMLS/C2242558|MTH/NOCODE|ALSO_CODED_AS
UMLS/C2242558|OMIM/MTHU034013|ALSO_CODED_AS
UMLS/C2707266|LNC/54543-4|ALSO_CODED_AS
UMLS/C2707266|MTH/NOCODE|ALSO_CODED_AS
UMLS/C2750202|OMIM/MTHU025210|ALSO_CODED_AS
UMLS/C2936904|MSH/C567932|ALSO_CODED_AS
