start_id|end_id|TYPE
FMA/54709|UMLS/C0036609|ALSO_CODED_AS
FMA/54721|UMLS/C0036609|ALSO_CODED_AS
LNC/LP199945-9|UMLS/C0036609|ALSO_CODED_AS
LNC/LP36094-8|UMLS/C0036609|ALSO_CODED_AS
LNC/MTHU054285|UMLS/C0036609|ALSO_CODED_AS
MSH/D012658|UMLS/C0036609|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0036609|ALSO_CODED_AS
NCI/C12497|UMLS/C0036609|ALSO_CODED_AS
LNC/LA17213-2|UMLS/C0746408|ALSO_CODED_AS
FMA/51061|UMLS/C0001074|ALSO_CODED_AS
LNC/LP30507-5|UMLS/C0001074|ALSO_CODED_AS
LNC/MTHU014777|UMLS/C0001074|ALSO_CODED_AS
MSH/D000125|UMLS/C0001074|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0001074|ALSO_CODED_AS
NCI/C32043|UMLS/C0001074|ALSO_CODED_AS
MSH/D000767|UMLS/C0002913|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0002913|ALSO_CODED_AS
NCI/C15642|UMLS/C0002913|ALSO_CODED_AS
MSH/D000775|UMLS/C0002928|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0002928|ALSO_CODED_AS
NCI/C92887|UMLS/C0002928|ALSO_CODED_AS
HPO/HP:0002427|UMLS/C0003550|ALSO_CODED_AS
MSH/D001039|UMLS/C0003550|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0003550|ALSO_CODED_AS
NCI/C34394|UMLS/C0003550|ALSO_CODED_AS
OMIM/MTHU008009|UMLS/C0003550|ALSO_CODED_AS
OMIM/MTHU022215|UMLS/C0003550|ALSO_CODED_AS
LNC/LP31695-7|UMLS/C0003968|ALSO_CODED_AS
MEDLINEPLUS/5380|UMLS/C0003968|ALSO_CODED_AS
MSH/D001205|UMLS/C0003968|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0003968|ALSO_CODED_AS
NCI/C285|UMLS/C0003968|ALSO_CODED_AS
RXNORM/1151|UMLS/C0003968|ALSO_CODED_AS
VANDF/4017471|UMLS/C0003968|ALSO_CODED_AS
VANDF/4017646|UMLS/C0003968|ALSO_CODED_AS
HPO/HP:0025406|UMLS/C0004093|ALSO_CODED_AS
MSH/D001247|UMLS/C0004093|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0004093|ALSO_CODED_AS
NCI/C28132|UMLS/C0004093|ALSO_CODED_AS
OMIM/MTHU059936|UMLS/C0004093|ALSO_CODED_AS
HPO/HP:0010867|UMLS/C0004134|ALSO_CODED_AS
LNC/LA24636-5|UMLS/C0004134|ALSO_CODED_AS
MSH/D001259|UMLS/C0004134|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0004134|ALSO_CODED_AS
NCI/C26702|UMLS/C0004134|ALSO_CODED_AS
OMIM/MTHU036349|UMLS/C0004134|ALSO_CODED_AS
OMIM/MTHU068459|UMLS/C0004134|ALSO_CODED_AS
FMA/321900|UMLS/C0004781|ALSO_CODED_AS
FMA/84013|UMLS/C0004781|ALSO_CODED_AS
MSH/D001479|UMLS/C0004781|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0004781|ALSO_CODED_AS
NCI/C12447|UMLS/C0004781|ALSO_CODED_AS
LNC/LP19284-6|UMLS/C0005790|ALSO_CODED_AS
LNC/LP6186-3|UMLS/C0005790|ALSO_CODED_AS
LNC/LP73955-4|UMLS/C0005790|ALSO_CODED_AS
LNC/LP7788-5|UMLS/C0005790|ALSO_CODED_AS
LNC/MTHU000051|UMLS/C0005790|ALSO_CODED_AS
LNC/MTHU008050|UMLS/C0005790|ALSO_CODED_AS
LNC/MTHU008375|UMLS/C0005790|ALSO_CODED_AS
MSH/D001780|UMLS/C0005790|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0005790|ALSO_CODED_AS
NCI/C62662|UMLS/C0005790|ALSO_CODED_AS
FMA/50801|UMLS/C0006104|ALSO_CODED_AS
LNC/LA32232-3|UMLS/C0006104|ALSO_CODED_AS
LNC/LA4254-4|UMLS/C0006104|ALSO_CODED_AS
LNC/LP206702-5|UMLS/C0006104|ALSO_CODED_AS
LNC/LP7084-9|UMLS/C0006104|ALSO_CODED_AS
LNC/MTHU002079|UMLS/C0006104|ALSO_CODED_AS
MSH/D001921|UMLS/C0006104|ALSO_CODED_AS
MTH/U001761|UMLS/C0006104|ALSO_CODED_AS
NCI/C12439|UMLS/C0006104|ALSO_CODED_AS
FMA/79876|UMLS/C0006121|ALSO_CODED_AS
LNC/LP207337-9|UMLS/C0006121|ALSO_CODED_AS
MSH/D001933|UMLS/C0006121|ALSO_CODED_AS
MTH/U001762|UMLS/C0006121|ALSO_CODED_AS
NCI/C12441|UMLS/C0006121|ALSO_CODED_AS
HPO/HP:0012185|UMLS/C0007286|ALSO_CODED_AS
ICD9CM/354.0|UMLS/C0007286|ALSO_CODED_AS
MEDLINEPLUS/179|UMLS/C0007286|ALSO_CODED_AS
MSH/D002349|UMLS/C0007286|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0007286|ALSO_CODED_AS
NCI/C34450|UMLS/C0007286|ALSO_CODED_AS
OMIM/115430|UMLS/C0007286|ALSO_CODED_AS
OMIM/MTHU011164|UMLS/C0007286|ALSO_CODED_AS
ICD9CM/88.41|UMLS/C0007767|ALSO_CODED_AS
MSH/D002533|UMLS/C0007767|ALSO_CODED_AS
LNC/LP15510-8|UMLS/C0010287|ALSO_CODED_AS
LNC/MTHU006937|UMLS/C0010287|ALSO_CODED_AS
MSH/D003402|UMLS/C0010287|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0010287|ALSO_CODED_AS
MTH/U000246|UMLS/C0010287|ALSO_CODED_AS
NCI/C113245|UMLS/C0010287|ALSO_CODED_AS
LNC/LA16776-9|UMLS/C0010592|ALSO_CODED_AS
LNC/LP16098-3|UMLS/C0010592|ALSO_CODED_AS
LNC/MTHU062952|UMLS/C0010592|ALSO_CODED_AS
MSH/D016572|UMLS/C0010592|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0010592|ALSO_CODED_AS
NCI/C406|UMLS/C0010592|ALSO_CODED_AS
RXNORM/3008|UMLS/C0010592|ALSO_CODED_AS
VANDF/4018761|UMLS/C0010592|ALSO_CODED_AS
MSH/D003524|UMLS/C0010594|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0010594|ALSO_CODED_AS
MSH/D003711|UMLS/C0011304|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0011304|ALSO_CODED_AS
NCI/C117277|UMLS/C0011304|ALSO_CODED_AS
OMIM/MTHU002306|UMLS/C0011304|ALSO_CODED_AS
FMA/24901|UMLS/C0013769|ALSO_CODED_AS
FMA/322616|UMLS/C0013769|ALSO_CODED_AS
LNC/LA16717-3|UMLS/C0013769|ALSO_CODED_AS
LNC/LP199967-3|UMLS/C0013769|ALSO_CODED_AS
LNC/LP221486-6|UMLS/C0013769|ALSO_CODED_AS
LNC/LP7196-1|UMLS/C0013769|ALSO_CODED_AS
LNC/MTHU002674|UMLS/C0013769|ALSO_CODED_AS
LNC/MTHU053748|UMLS/C0013769|ALSO_CODED_AS
MSH/D004550|UMLS/C0013769|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0013769|ALSO_CODED_AS
FMA/321843|UMLS/C0013770|ALSO_CODED_AS
FMA/35289|UMLS/C0013770|ALSO_CODED_AS
MSH/D004551|UMLS/C0013770|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0013770|ALSO_CODED_AS
NCI/C32497|UMLS/C0013770|ALSO_CODED_AS
LNC/LP19403-2|UMLS/C0013832|ALSO_CODED_AS
LNC/MTHU008531|UMLS/C0013832|ALSO_CODED_AS
MSH/D004573|UMLS/C0013832|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0013832|ALSO_CODED_AS
NCI/C464|UMLS/C0013832|ALSO_CODED_AS
VANDF/4022490|UMLS/C0013832|ALSO_CODED_AS
MSH/D004578|UMLS/C0013845|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0013845|ALSO_CODED_AS
NCI/C16534|UMLS/C0013845|ALSO_CODED_AS
HPO/HP:0000988|UMLS/C0015230|ALSO_CODED_AS
HPO/HP:4000054|UMLS/C0015230|ALSO_CODED_AS
ICD9CM/782.1|UMLS/C0015230|ALSO_CODED_AS
LNC/LA29194-0|UMLS/C0015230|ALSO_CODED_AS
LNC/LA7469-5|UMLS/C0015230|ALSO_CODED_AS
LNC/LP30547-1|UMLS/C0015230|ALSO_CODED_AS
LNC/LP75487-6|UMLS/C0015230|ALSO_CODED_AS
LNC/MTHU015064|UMLS/C0015230|ALSO_CODED_AS
LNC/MTHU020933|UMLS/C0015230|ALSO_CODED_AS
MEDLINEPLUS/208|UMLS/C0015230|ALSO_CODED_AS
MSH/D005076|UMLS/C0015230|ALSO_CODED_AS
MTH/638|UMLS/C0015230|ALSO_CODED_AS
MTH/U003405|UMLS/C0015230|ALSO_CODED_AS
NCI/C111884|UMLS/C0015230|ALSO_CODED_AS
NCI/C39594|UMLS/C0015230|ALSO_CODED_AS
OMIM/MTHU008860|UMLS/C0015230|ALSO_CODED_AS
OMIM/MTHU011109|UMLS/C0015230|ALSO_CODED_AS
OMIM/MTHU047706|UMLS/C0015230|ALSO_CODED_AS
HPO/HP:0012378|UMLS/C0015672|ALSO_CODED_AS
LNC/LA7542-9|UMLS/C0015672|ALSO_CODED_AS
LNC/LP74831-6|UMLS/C0015672|ALSO_CODED_AS
LNC/MTHU013358|UMLS/C0015672|ALSO_CODED_AS
MEDLINEPLUS/5324|UMLS/C0015672|ALSO_CODED_AS
MSH/D005221|UMLS/C0015672|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0015672|ALSO_CODED_AS
NCI/C3036|UMLS/C0015672|ALSO_CODED_AS
OMIM/MTHU010062|UMLS/C0015672|ALSO_CODED_AS
LNC/LP100865-7|UMLS/C0016928|ALSO_CODED_AS
LNC/LP30516-6|UMLS/C0016928|ALSO_CODED_AS
LNC/MTHU015039|UMLS/C0016928|ALSO_CODED_AS
LNC/MTHU035898|UMLS/C0016928|ALSO_CODED_AS
MSH/D005684|UMLS/C0016928|ALSO_CODED_AS
NCI/C75445|UMLS/C0016928|ALSO_CODED_AS
MSH/D006082|UMLS/C0018126|ALSO_CODED_AS
FMA/9712|UMLS/C0018563|ALSO_CODED_AS
LNC/LA16719-9|UMLS/C0018563|ALSO_CODED_AS
LNC/LP221491-6|UMLS/C0018563|ALSO_CODED_AS
LNC/LP7279-5|UMLS/C0018563|ALSO_CODED_AS
LNC/MTHU002685|UMLS/C0018563|ALSO_CODED_AS
MSH/D006225|UMLS/C0018563|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0018563|ALSO_CODED_AS
NCI/C32712|UMLS/C0018563|ALSO_CODED_AS
OMIM/MTHU000072|UMLS/C0018563|ALSO_CODED_AS
FMA/24994|UMLS/C0018870|ALSO_CODED_AS
FMA/326009|UMLS/C0018870|ALSO_CODED_AS
LNC/LA25778-4|UMLS/C0018870|ALSO_CODED_AS
MSH/D006365|UMLS/C0018870|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0018870|ALSO_CODED_AS
MTH/U003296|UMLS/C0018870|ALSO_CODED_AS
LNC/LP28800-8|UMLS/C0018905|ALSO_CODED_AS
MSH/D006386|UMLS/C0018905|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0018905|ALSO_CODED_AS
NCI/C130173|UMLS/C0018905|ALSO_CODED_AS
HPO/HP:0000822|UMLS/C0020538|ALSO_CODED_AS
ICD9CM/401-405.99|UMLS/C0020538|ALSO_CODED_AS
ICD9CM/997.91|UMLS/C0020538|ALSO_CODED_AS
LNC/LA14293-7|UMLS/C0020538|ALSO_CODED_AS
LNC/LA7444-8|UMLS/C0020538|ALSO_CODED_AS
LNC/LP74941-3|UMLS/C0020538|ALSO_CODED_AS
LNC/MTHU020789|UMLS/C0020538|ALSO_CODED_AS
MEDLINEPLUS/34|UMLS/C0020538|ALSO_CODED_AS
MSH/D006973|UMLS/C0020538|ALSO_CODED_AS
MTH/005|UMLS/C0020538|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0020538|ALSO_CODED_AS
NCI/C3117|UMLS/C0020538|ALSO_CODED_AS
OMIM/MTHU002068|UMLS/C0020538|ALSO_CODED_AS
OMIM/MTHU014957|UMLS/C0020538|ALSO_CODED_AS
OMIM/MTHU058377|UMLS/C0020538|ALSO_CODED_AS
OMIM/MTHU070458|UMLS/C0020538|ALSO_CODED_AS
HPO/HP:0003474|UMLS/C0020580|ALSO_CODED_AS
HPO/HP:0033748|UMLS/C0020580|ALSO_CODED_AS
MSH/D006987|UMLS/C0020580|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0020580|ALSO_CODED_AS
NCI/C50445|UMLS/C0020580|ALSO_CODED_AS
OMIM/MTHU010221|UMLS/C0020580|ALSO_CODED_AS
LNC/LP31454-9|UMLS/C0021081|ALSO_CODED_AS
MSH/D007166|UMLS/C0021081|ALSO_CODED_AS
MTH/U002004|UMLS/C0021081|ALSO_CODED_AS
NCI/C574|UMLS/C0021081|ALSO_CODED_AS
VANDF/4021763|UMLS/C0021081|ALSO_CODED_AS
LNC/LP29657-1|UMLS/C0022369|ALSO_CODED_AS
MSH/D007577|UMLS/C0022369|ALSO_CODED_AS
NCI/C14229|UMLS/C0022369|ALSO_CODED_AS
FMA/24974|UMLS/C0022742|ALSO_CODED_AS
LNC/LA22232-5|UMLS/C0022742|ALSO_CODED_AS
LNC/LP199984-8|UMLS/C0022742|ALSO_CODED_AS
LNC/LP7381-9|UMLS/C0022742|ALSO_CODED_AS
LNC/MTHU002687|UMLS/C0022742|ALSO_CODED_AS
MSH/D007717|UMLS/C0022742|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0022742|ALSO_CODED_AS
FMA/35175|UMLS/C0022745|ALSO_CODED_AS
FMA/35184|UMLS/C0022745|ALSO_CODED_AS
MSH/D007719|UMLS/C0022745|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0022745|ALSO_CODED_AS
NCI/C32898|UMLS/C0022745|ALSO_CODED_AS
MEDLINEPLUS/210|UMLS/C0022885|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0022885|ALSO_CODED_AS
NCI/C25294|UMLS/C0022885|ALSO_CODED_AS
LNC/LP15033-1|UMLS/C0022917|ALSO_CODED_AS
LNC/MTHU002348|UMLS/C0022917|ALSO_CODED_AS
MSH/D007770|UMLS/C0022917|ALSO_CODED_AS
MTH/U000295|UMLS/C0022917|ALSO_CODED_AS
MTH/U002030|UMLS/C0022917|ALSO_CODED_AS
NCI/C25184|UMLS/C0022917|ALSO_CODED_AS
FMA/7184|UMLS/C0023216|ALSO_CODED_AS
LNC/LA18112-5|UMLS/C0023216|ALSO_CODED_AS
LNC/LA30846-2|UMLS/C0023216|ALSO_CODED_AS
LNC/LP199985-5|UMLS/C0023216|ALSO_CODED_AS
LNC/LP29948-4|UMLS/C0023216|ALSO_CODED_AS
LNC/MTHU011970|UMLS/C0023216|ALSO_CODED_AS
MSH/D035002|UMLS/C0023216|ALSO_CODED_AS
MTH/U003308|UMLS/C0023216|ALSO_CODED_AS
NCI/C12742|UMLS/C0023216|ALSO_CODED_AS
NCI/C77625|UMLS/C0023216|ALSO_CODED_AS
FMA/61681|UMLS/C0024090|ALSO_CODED_AS
LNC/LA22230-9|UMLS/C0024090|ALSO_CODED_AS
MSH/D008161|UMLS/C0024090|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0024090|ALSO_CODED_AS
NCI/C34004|UMLS/C0024090|ALSO_CODED_AS
LNC/LA24328-9|UMLS/C0024485|ALSO_CODED_AS
LNC/LP206549-0|UMLS/C0024485|ALSO_CODED_AS
LNC/LP206574-8|UMLS/C0024485|ALSO_CODED_AS
LNC/LP6406-5|UMLS/C0024485|ALSO_CODED_AS
MEDLINEPLUS/3953|UMLS/C0024485|ALSO_CODED_AS
MSH/D008279|UMLS/C0024485|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0024485|ALSO_CODED_AS
NCI/C16809|UMLS/C0024485|ALSO_CODED_AS
LNC/LA14339-8|UMLS/C0025677|ALSO_CODED_AS
LNC/LP16198-1|UMLS/C0025677|ALSO_CODED_AS
LNC/MTHU005020|UMLS/C0025677|ALSO_CODED_AS
MSH/D008727|UMLS/C0025677|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0025677|ALSO_CODED_AS
NCI/C642|UMLS/C0025677|ALSO_CODED_AS
RXNORM/6851|UMLS/C0025677|ALSO_CODED_AS
VANDF/4019828|UMLS/C0025677|ALSO_CODED_AS
LNC/LP89863-2|UMLS/C0026516|ALSO_CODED_AS
LNC/MTHU031584|UMLS/C0026516|ALSO_CODED_AS
MSH/D000339|UMLS/C0026516|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0026516|ALSO_CODED_AS
NCI/C72883|UMLS/C0026516|ALSO_CODED_AS
MSH/D009048|UMLS/C0026612|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0026612|ALSO_CODED_AS
LNC/LP96286-7|UMLS/C0026649|ALSO_CODED_AS
LNC/MTHU034767|UMLS/C0026649|ALSO_CODED_AS
MSH/D009068|UMLS/C0026649|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0026649|ALSO_CODED_AS
NCI/C37994|UMLS/C0026649|ALSO_CODED_AS
OMIM/MTHU000756|UMLS/C0026649|ALSO_CODED_AS
LNC/LP199993-9|UMLS/C0026845|ALSO_CODED_AS
LNC/LP32940-6|UMLS/C0026845|ALSO_CODED_AS
LNC/LP33444-8|UMLS/C0026845|ALSO_CODED_AS
LNC/MTHU016812|UMLS/C0026845|ALSO_CODED_AS
MSH/D009132|UMLS/C0026845|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0026845|ALSO_CODED_AS
NCI/C12435|UMLS/C0026845|ALSO_CODED_AS
HPO/HP:0002018|UMLS/C0027497|ALSO_CODED_AS
LNC/LA15098-9|UMLS/C0027497|ALSO_CODED_AS
LNC/LP36327-2|UMLS/C0027497|ALSO_CODED_AS
LNC/MTHU013524|UMLS/C0027497|ALSO_CODED_AS
MSH/D009325|UMLS/C0027497|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0027497|ALSO_CODED_AS
NCI/C3258|UMLS/C0027497|ALSO_CODED_AS
OMIM/MTHU002455|UMLS/C0027497|ALSO_CODED_AS
LNC/LA9467-7|UMLS/C0027741|ALSO_CODED_AS
LNC/LP200049-7|UMLS/C0027741|ALSO_CODED_AS
MSH/D009407|UMLS/C0027741|ALSO_CODED_AS
NCI/C21072|UMLS/C0027741|ALSO_CODED_AS
HPO/HP:0030166|UMLS/C0028081|ALSO_CODED_AS
LNC/LP75171-6|UMLS/C0028081|ALSO_CODED_AS
LNC/MTHU013525|UMLS/C0028081|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0028081|ALSO_CODED_AS
NCI/C3279|UMLS/C0028081|ALSO_CODED_AS
OMIM/MTHU071582|UMLS/C0028081|ALSO_CODED_AS
LNC/LA30857-9|UMLS/C0028643|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0028643|ALSO_CODED_AS
NCI/C34857|UMLS/C0028643|ALSO_CODED_AS
OMIM/MTHU008008|UMLS/C0028643|ALSO_CODED_AS
FMA/67325|UMLS/C0028785|ALSO_CODED_AS
MSH/D009778|UMLS/C0028785|ALSO_CODED_AS
MTH/U002117|UMLS/C0028785|ALSO_CODED_AS
NCI/C12355|UMLS/C0028785|ALSO_CODED_AS
HPO/HP:0033681|UMLS/C0028945|ALSO_CODED_AS
MSH/D009837|UMLS/C0028945|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0028945|ALSO_CODED_AS
NCI/C129319|UMLS/C0028945|ALSO_CODED_AS
OMIM/137800|UMLS/C0028945|ALSO_CODED_AS
OMIM/MTHU022890|UMLS/C0028945|ALSO_CODED_AS
OMIM/MTHU036793|UMLS/C0028945|ALSO_CODED_AS
FMA/58634|UMLS/C0029127|ALSO_CODED_AS
FMA/58711|UMLS/C0029127|ALSO_CODED_AS
MSH/D009898|UMLS/C0029127|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0029127|ALSO_CODED_AS
NCI/C12760|UMLS/C0029127|ALSO_CODED_AS
MSH/D000773|UMLS/C0030401|ALSO_CODED_AS
HPO/HP:0003401|UMLS/C0030554|ALSO_CODED_AS
LNC/LP202889-4|UMLS/C0030554|ALSO_CODED_AS
LNC/MTHU051473|UMLS/C0030554|ALSO_CODED_AS
MSH/D010292|UMLS/C0030554|ALSO_CODED_AS
MTH/556|UMLS/C0030554|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0030554|ALSO_CODED_AS
NCI/C28177|UMLS/C0030554|ALSO_CODED_AS
OMIM/MTHU005827|UMLS/C0030554|ALSO_CODED_AS
OMIM/MTHU016055|UMLS/C0030554|ALSO_CODED_AS
OMIM/MTHU016084|UMLS/C0030554|ALSO_CODED_AS
FMA/61826|UMLS/C0030560|ALSO_CODED_AS
MSH/D010296|UMLS/C0030560|ALSO_CODED_AS
MTH/U002145|UMLS/C0030560|ALSO_CODED_AS
NCI/C12354|UMLS/C0030560|ALSO_CODED_AS
MSH/D010314|UMLS/C0030605|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0030605|ALSO_CODED_AS
MTH/U000019|UMLS/C0030605|ALSO_CODED_AS
MTH/U000082|UMLS/C0030605|ALSO_CODED_AS
MTH/U000083|UMLS/C0030605|ALSO_CODED_AS
MTH/U000084|UMLS/C0030605|ALSO_CODED_AS
NCI/C38462|UMLS/C0030605|ALSO_CODED_AS
FMA/24485|UMLS/C0030647|ALSO_CODED_AS
LNC/LA16748-8|UMLS/C0030647|ALSO_CODED_AS
LNC/LP221451-0|UMLS/C0030647|ALSO_CODED_AS
LNC/LP30162-9|UMLS/C0030647|ALSO_CODED_AS
LNC/LP30539-8|UMLS/C0030647|ALSO_CODED_AS
LNC/MTHU014782|UMLS/C0030647|ALSO_CODED_AS
LNC/MTHU053776|UMLS/C0030647|ALSO_CODED_AS
MSH/D010329|UMLS/C0030647|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0030647|ALSO_CODED_AS
NCI/C33282|UMLS/C0030647|ALSO_CODED_AS
MSH/D010465|UMLS/C0030971|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0030971|ALSO_CODED_AS
NCI/C16967|UMLS/C0030971|ALSO_CODED_AS
LNC/LP14931-7|UMLS/C0032207|ALSO_CODED_AS
LNC/MTHU002192|UMLS/C0032207|ALSO_CODED_AS
MSH/D010984|UMLS/C0032207|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0032207|ALSO_CODED_AS
MTH/U000086|UMLS/C0032207|ALSO_CODED_AS
NCI/C376|UMLS/C0032207|ALSO_CODED_AS
NCI/C756|UMLS/C0032207|ALSO_CODED_AS
RXNORM/1311280|UMLS/C0032207|ALSO_CODED_AS
HPO/HP:0033840|UMLS/C0032776|ALSO_CODED_AS
ICD9CM/627.1|UMLS/C0032776|ALSO_CODED_AS
NCI/C34937|UMLS/C0032776|ALSO_CODED_AS
LNC/LP18109-6|UMLS/C0032952|ALSO_CODED_AS
LNC/MTHU062944|UMLS/C0032952|ALSO_CODED_AS
MSH/D011241|UMLS/C0032952|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0032952|ALSO_CODED_AS
NCI/C770|UMLS/C0032952|ALSO_CODED_AS
RXNORM/8640|UMLS/C0032952|ALSO_CODED_AS
VANDF/4017876|UMLS/C0032952|ALSO_CODED_AS
MSH/D011517|UMLS/C0033707|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0033707|ALSO_CODED_AS
MTH/U000023|UMLS/C0033707|ALSO_CODED_AS
NCI/C62656|UMLS/C0033707|ALSO_CODED_AS
LNC/LP263781-9|UMLS/C0034117|ALSO_CODED_AS
MSH/D011677|UMLS/C0034117|ALSO_CODED_AS
MTH/U003461|UMLS/C0034117|ALSO_CODED_AS
FMA/58252|UMLS/C0034121|ALSO_CODED_AS
LNC/LP30546-3|UMLS/C0034121|ALSO_CODED_AS
LNC/MTHU015063|UMLS/C0034121|ALSO_CODED_AS
MSH/D011680|UMLS/C0034121|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0034121|ALSO_CODED_AS
NCI/C33429|UMLS/C0034121|ALSO_CODED_AS
MSH/D012018|UMLS/C0034929|ALSO_CODED_AS
MTH/U003465|UMLS/C0034929|ALSO_CODED_AS
NCI/C78342|UMLS/C0034929|ALSO_CODED_AS
HPO/HP:0001250|UMLS/C0036572|ALSO_CODED_AS
LNC/LA15899-0|UMLS/C0036572|ALSO_CODED_AS
LNC/LA7472-9|UMLS/C0036572|ALSO_CODED_AS
MEDLINEPLUS/396|UMLS/C0036572|ALSO_CODED_AS
MSH/D012640|UMLS/C0036572|ALSO_CODED_AS
MTH/673|UMLS/C0036572|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0036572|ALSO_CODED_AS
NCI/C2962|UMLS/C0036572|ALSO_CODED_AS
OMIM/MTHU000242|UMLS/C0036572|ALSO_CODED_AS
OMIM/MTHU004223|UMLS/C0036572|ALSO_CODED_AS
GO/GO:0007600|UMLS/C0036658|ALSO_CODED_AS
LNC/LP34365-4|UMLS/C0036658|ALSO_CODED_AS
LNC/MTHU017277|UMLS/C0036658|ALSO_CODED_AS
MSH/D012677|UMLS/C0036658|ALSO_CODED_AS
MTH/527|UMLS/C0036658|ALSO_CODED_AS
MTH/U003464|UMLS/C0036658|ALSO_CODED_AS
MSH/D012683|UMLS/C0036674|ALSO_CODED_AS
LNC/LP74327-5|UMLS/C0036743|ALSO_CODED_AS
LNC/MTHU008384|UMLS/C0036743|ALSO_CODED_AS
MSH/D012698|UMLS/C0036743|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0036743|ALSO_CODED_AS
HPO/HP:0000246|UMLS/C0037199|ALSO_CODED_AS
MEDLINEPLUS/404|UMLS/C0037199|ALSO_CODED_AS
MSH/D012852|UMLS/C0037199|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0037199|ALSO_CODED_AS
NCI/C35024|UMLS/C0037199|ALSO_CODED_AS
OMIM/MTHU006260|UMLS/C0037199|ALSO_CODED_AS
LNC/LP121781-1|UMLS/C0037817|ALSO_CODED_AS
LNC/LP251050-3|UMLS/C0037817|ALSO_CODED_AS
LNC/MTHU039958|UMLS/C0037817|ALSO_CODED_AS
MSH/D013060|UMLS/C0037817|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0037817|ALSO_CODED_AS
NCI/C38025|UMLS/C0037817|ALSO_CODED_AS
MSH/D015524|UMLS/C0037886|ALSO_CODED_AS
NCI/C35031|UMLS/C0037886|ALSO_CODED_AS
HPO/HP:0001297|UMLS/C0038454|ALSO_CODED_AS
LNC/LA22099-8|UMLS/C0038454|ALSO_CODED_AS
LNC/LA22244-0|UMLS/C0038454|ALSO_CODED_AS
LNC/LA9553-4|UMLS/C0038454|ALSO_CODED_AS
LNC/LP74605-4|UMLS/C0038454|ALSO_CODED_AS
LNC/MTHU020801|UMLS/C0038454|ALSO_CODED_AS
MEDLINEPLUS/8|UMLS/C0038454|ALSO_CODED_AS
MSH/D020521|UMLS/C0038454|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0038454|ALSO_CODED_AS
MTH/U001797|UMLS/C0038454|ALSO_CODED_AS
NCI/C3390|UMLS/C0038454|ALSO_CODED_AS
OMIM/601367|UMLS/C0038454|ALSO_CODED_AS
OMIM/MTHU008085|UMLS/C0038454|ALSO_CODED_AS
OMIM/MTHU009877|UMLS/C0038454|ALSO_CODED_AS
OMIM/MTHU010049|UMLS/C0038454|ALSO_CODED_AS
OMIM/MTHU012420|UMLS/C0038454|ALSO_CODED_AS
OMIM/MTHU036565|UMLS/C0038454|ALSO_CODED_AS
OMIM/MTHU072910|UMLS/C0038454|ALSO_CODED_AS
ICD9CM/05.31|UMLS/C0039043|ALSO_CODED_AS
MSH/D001340|UMLS/C0039043|ALSO_CODED_AS
NCI/C21110|UMLS/C0039043|ALSO_CODED_AS
LNC/LA21908-1|UMLS/C0039225|ALSO_CODED_AS
LNC/LP136501-6|UMLS/C0039225|ALSO_CODED_AS
MSH/D013607|UMLS/C0039225|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0039225|ALSO_CODED_AS
NCI/C42998|UMLS/C0039225|ALSO_CODED_AS
VANDF/4024284|UMLS/C0039225|ALSO_CODED_AS
LNC/LP15886-2|UMLS/C0039840|ALSO_CODED_AS
LNC/LP31688-2|UMLS/C0039840|ALSO_CODED_AS
LNC/MTHU008943|UMLS/C0039840|ALSO_CODED_AS
MSH/D013831|UMLS/C0039840|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0039840|ALSO_CODED_AS
NCI/C874|UMLS/C0039840|ALSO_CODED_AS
RXNORM/10454|UMLS/C0039840|ALSO_CODED_AS
VANDF/4017474|UMLS/C0039840|ALSO_CODED_AS
VANDF/4017777|UMLS/C0039840|ALSO_CODED_AS
LNC/LA31131-8|UMLS/C0040329|ALSO_CODED_AS
MSH/D062789|UMLS/C0040329|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0040329|ALSO_CODED_AS
NCI/C891|UMLS/C0040329|ALSO_CODED_AS
VANDF/4017291|UMLS/C0040329|ALSO_CODED_AS
VANDF/4024446|UMLS/C0040329|ALSO_CODED_AS
LNC/LP32744-2|UMLS/C0042014|ALSO_CODED_AS
LNC/LP74376-2|UMLS/C0042014|ALSO_CODED_AS
LNC/LP7851-1|UMLS/C0042014|ALSO_CODED_AS
LNC/MTHU000144|UMLS/C0042014|ALSO_CODED_AS
LNC/MTHU008386|UMLS/C0042014|ALSO_CODED_AS
MEDLINEPLUS/6355|UMLS/C0042014|ALSO_CODED_AS
MSH/D016482|UMLS/C0042014|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0042014|ALSO_CODED_AS
MTH/U000062|UMLS/C0042014|ALSO_CODED_AS
NCI/C17241|UMLS/C0042014|ALSO_CODED_AS
ICD9CM/95.05|UMLS/C0042825|ALSO_CODED_AS
MSH/D058609|UMLS/C0042825|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0042825|ALSO_CODED_AS
HPO/HP:0002013|UMLS/C0042963|ALSO_CODED_AS
LNC/LA15099-7|UMLS/C0042963|ALSO_CODED_AS
LNC/LP75864-6|UMLS/C0042963|ALSO_CODED_AS
LNC/MTHU013530|UMLS/C0042963|ALSO_CODED_AS
MEDLINEPLUS/489|UMLS/C0042963|ALSO_CODED_AS
MSH/D014839|UMLS/C0042963|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0042963|ALSO_CODED_AS
NCI/C3442|UMLS/C0042963|ALSO_CODED_AS
OMIM/MTHU000225|UMLS/C0042963|ALSO_CODED_AS
LNC/LA10117-2|UMLS/C0043016|ALSO_CODED_AS
MSH/D014853|UMLS/C0043016|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0043016|ALSO_CODED_AS
FMA/24922|UMLS/C0043262|ALSO_CODED_AS
LNC/LP221474-2|UMLS/C0043262|ALSO_CODED_AS
LNC/LP7733-1|UMLS/C0043262|ALSO_CODED_AS
LNC/MTHU002691|UMLS/C0043262|ALSO_CODED_AS
MSH/D014953|UMLS/C0043262|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0043262|ALSO_CODED_AS
NCI/C111033|UMLS/C0043262|ALSO_CODED_AS
MSH/C025417|UMLS/C0048719|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0048719|ALSO_CODED_AS
NCI/C156702|UMLS/C0048719|ALSO_CODED_AS
MSH/C034368|UMLS/C0066981|ALSO_CODED_AS
HPO/HP:0025143|UMLS/C0085593|ALSO_CODED_AS
LNC/LA30863-7|UMLS/C0085593|ALSO_CODED_AS
LNC/LP74618-7|UMLS/C0085593|ALSO_CODED_AS
LNC/MTHU013512|UMLS/C0085593|ALSO_CODED_AS
MSH/D023341|UMLS/C0085593|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0085593|ALSO_CODED_AS
NCI/C35143|UMLS/C0085593|ALSO_CODED_AS
HPO/HP:0000613|UMLS/C0085636|ALSO_CODED_AS
LNC/LA15103-7|UMLS/C0085636|ALSO_CODED_AS
LNC/LA24849-4|UMLS/C0085636|ALSO_CODED_AS
MSH/D020795|UMLS/C0085636|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0085636|ALSO_CODED_AS
NCI/C28210|UMLS/C0085636|ALSO_CODED_AS
OMIM/MTHU036378|UMLS/C0085636|ALSO_CODED_AS
ICD9CM/710.4|UMLS/C0085655|ALSO_CODED_AS
MSH/D017285|UMLS/C0085655|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0085655|ALSO_CODED_AS
NCI/C26925|UMLS/C0085655|ALSO_CODED_AS
OMIM/MTHU037341|UMLS/C0085655|ALSO_CODED_AS
LNC/LP15505-8|UMLS/C0086024|ALSO_CODED_AS
LNC/LP268966-1|UMLS/C0086024|ALSO_CODED_AS
LNC/MTHU004913|UMLS/C0086024|ALSO_CODED_AS
LNC/MTHU005166|UMLS/C0086024|ALSO_CODED_AS
MSH/D014805|UMLS/C0086024|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0086024|ALSO_CODED_AS
NCI/C939|UMLS/C0086024|ALSO_CODED_AS
RXNORM/42604|UMLS/C0086024|ALSO_CODED_AS
VANDF/4017907|UMLS/C0086024|ALSO_CODED_AS
MSH/D006515|UMLS/C0086097|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0086097|ALSO_CODED_AS
LNC/LA28141-2|UMLS/C0086190|ALSO_CODED_AS
LNC/LA29718-6|UMLS/C0086190|ALSO_CODED_AS
LNC/LP99406-8|UMLS/C0086190|ALSO_CODED_AS
LNC/MTHU035698|UMLS/C0086190|ALSO_CODED_AS
MSH/D013287|UMLS/C0086190|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0086190|ALSO_CODED_AS
LNC/LP31694-0|UMLS/C0087162|ALSO_CODED_AS
MSH/D025101|UMLS/C0087162|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0087162|ALSO_CODED_AS
NCI/C1334|UMLS/C0087162|ALSO_CODED_AS
RXNORM/42954|UMLS/C0087162|ALSO_CODED_AS
VANDF/4017779|UMLS/C0087162|ALSO_CODED_AS
HPO/HP:0002625|UMLS/C0149871|ALSO_CODED_AS
LNC/LA7425-7|UMLS/C0149871|ALSO_CODED_AS
LNC/LP266848-3|UMLS/C0149871|ALSO_CODED_AS
LNC/LP74706-0|UMLS/C0149871|ALSO_CODED_AS
LNC/MTHU020788|UMLS/C0149871|ALSO_CODED_AS
MEDLINEPLUS/1683|UMLS/C0149871|ALSO_CODED_AS
MSH/D020246|UMLS/C0149871|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0149871|ALSO_CODED_AS
NCI/C49343|UMLS/C0149871|ALSO_CODED_AS
OMIM/MTHU015932|UMLS/C0149871|ALSO_CODED_AS
OMIM/MTHU019524|UMLS/C0149871|ALSO_CODED_AS
FMA/61903|UMLS/C0152307|ALSO_CODED_AS
MSH/D009778|UMLS/C0152307|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0152307|ALSO_CODED_AS
MSH/D056228|UMLS/C0178842|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0178842|ALSO_CODED_AS
LNC/LA14524-5|UMLS/C0200069|ALSO_CODED_AS
LNC/LA19798-0|UMLS/C0200069|ALSO_CODED_AS
LNC/LP74053-7|UMLS/C0200069|ALSO_CODED_AS
LNC/LP7798-4|UMLS/C0200069|ALSO_CODED_AS
LNC/MTHU000074|UMLS/C0200069|ALSO_CODED_AS
LNC/MTHU008378|UMLS/C0200069|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0200069|ALSO_CODED_AS
NCI/C15413|UMLS/C0200069|ALSO_CODED_AS
LNC/LP30786-5|UMLS/C0200627|ALSO_CODED_AS
LNC/LP74091-7|UMLS/C0200627|ALSO_CODED_AS
LNC/MTHU008379|UMLS/C0200627|ALSO_CODED_AS
MTH/U002917|UMLS/C0200627|ALSO_CODED_AS
FMA/74529|UMLS/C0205123|ALSO_CODED_AS
FMA/74536|UMLS/C0205123|ALSO_CODED_AS
LNC/LP266855-8|UMLS/C0205123|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0205123|ALSO_CODED_AS
NCI/C161325|UMLS/C0205123|ALSO_CODED_AS
LNC/LA12748-2|UMLS/C0205161|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0205161|ALSO_CODED_AS
NCI/C25401|UMLS/C0205161|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0221198|ALSO_CODED_AS
NCI/C3824|UMLS/C0221198|ALSO_CODED_AS
FMA/38485|UMLS/C0224264|ALSO_CODED_AS
LNC/LP30511-7|UMLS/C0224264|ALSO_CODED_AS
LNC/MTHU014781|UMLS/C0224264|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0224264|ALSO_CODED_AS
NCI/C150849|UMLS/C0224264|ALSO_CODED_AS
FMA/61817|UMLS/C0228174|ALSO_CODED_AS
MSH/D054022|UMLS/C0228174|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0228174|ALSO_CODED_AS
NCI/C12351|UMLS/C0228174|ALSO_CODED_AS
FMA/83727|UMLS/C0228186|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0228186|ALSO_CODED_AS
NCI/C33005|UMLS/C0228186|ALSO_CODED_AS
FMA/77801|UMLS/C0228187|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0228187|ALSO_CODED_AS
NCI/C32615|UMLS/C0228187|ALSO_CODED_AS
FMA/76925|UMLS/C0228465|ALSO_CODED_AS
NCI/C32726|UMLS/C0228465|ALSO_CODED_AS
LNC/LP29949-2|UMLS/C0230420|ALSO_CODED_AS
LNC/MTHU012599|UMLS/C0230420|ALSO_CODED_AS
HPO/HP:0004396|UMLS/C0232462|ALSO_CODED_AS
LNC/LP121703-5|UMLS/C0232462|ALSO_CODED_AS
LNC/MTHU039885|UMLS/C0232462|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0232462|ALSO_CODED_AS
OMIM/MTHU004224|UMLS/C0232462|ALSO_CODED_AS
OMIM/MTHU014773|UMLS/C0232462|ALSO_CODED_AS
LNC/LP207344-5|UMLS/C0234130|ALSO_CODED_AS
LNC/LP30529-9|UMLS/C0234130|ALSO_CODED_AS
LNC/MTHU015052|UMLS/C0234130|ALSO_CODED_AS
MSH/D001072|UMLS/C0234527|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0237543|ALSO_CODED_AS
MSH/D001219|UMLS/C0242192|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0242192|ALSO_CODED_AS
MTH/U000327|UMLS/C0242192|ALSO_CODED_AS
NCI/C25202|UMLS/C0242192|ALSO_CODED_AS
HPO/HP:0030516|UMLS/C0271202|ALSO_CODED_AS
ICD9CM/368.46|UMLS/C0271202|ALSO_CODED_AS
MSH/D006423|UMLS/C0271202|ALSO_CODED_AS
LNC/LA26030-9|UMLS/C0332448|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0332448|ALSO_CODED_AS
NCI/C25754|UMLS/C0332448|ALSO_CODED_AS
MSH/D006261|UMLS/C0423618|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0427008|ALSO_CODED_AS
OMIM/MTHU001298|UMLS/C0427008|ALSO_CODED_AS
OMIM/MTHU012550|UMLS/C0427008|ALSO_CODED_AS
GO/GO:0060004|UMLS/C0439840|ALSO_CODED_AS
MTH/U002855|UMLS/C0439840|ALSO_CODED_AS
LNC/LA9204-4|UMLS/C0441640|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0441640|ALSO_CODED_AS
NCI/C71482|UMLS/C0441640|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0442025|ALSO_CODED_AS
ICD9CM/E929.0|UMLS/C0481354|ALSO_CODED_AS
HPO/HP:0002311|UMLS/C0520966|ALSO_CODED_AS
ICD9CM/781.3|UMLS/C0520966|ALSO_CODED_AS
MSH/D001259|UMLS/C0520966|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0520966|ALSO_CODED_AS
OMIM/MTHU000948|UMLS/C0520966|ALSO_CODED_AS
OMIM/MTHU005124|UMLS/C0520966|ALSO_CODED_AS
OMIM/MTHU008070|UMLS/C0520966|ALSO_CODED_AS
OMIM/MTHU008853|UMLS/C0520966|ALSO_CODED_AS
OMIM/MTHU061012|UMLS/C0520966|ALSO_CODED_AS
OMIM/MTHU064975|UMLS/C0520966|ALSO_CODED_AS
LNC/LA31814-9|UMLS/C0521654|ALSO_CODED_AS
LNC/LA7458-8|UMLS/C0521654|ALSO_CODED_AS
MSH/D009461|UMLS/C0521654|ALSO_CODED_AS
NCI/C116600|UMLS/C0521654|ALSO_CODED_AS
OMIM/MTHU024651|UMLS/C0521654|ALSO_CODED_AS
OMIM/MTHU041954|UMLS/C0521654|ALSO_CODED_AS
MSH/C103292|UMLS/C0533584|ALSO_CODED_AS
FMA/37670|UMLS/C0559499|ALSO_CODED_AS
LNC/LP30510-9|UMLS/C0559499|ALSO_CODED_AS
LNC/MTHU014778|UMLS/C0559499|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0559499|ALSO_CODED_AS
NCI/C32200|UMLS/C0559499|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0582103|ALSO_CODED_AS
NCI/C25305|UMLS/C0582103|ALSO_CODED_AS
MSH/D011899|UMLS/C0592278|ALSO_CODED_AS
NCI/C66506|UMLS/C0592278|ALSO_CODED_AS
RXNORM/152523|UMLS/C0592278|ALSO_CODED_AS
FMA/83929|UMLS/C0682708|ALSO_CODED_AS
MSH/D066127|UMLS/C0682708|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0682708|ALSO_CODED_AS
NCI/C33892|UMLS/C0682708|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0694547|ALSO_CODED_AS
NCI/C167441|UMLS/C0694547|ALSO_CODED_AS
OMIM/MTHU057264|UMLS/C0694547|ALSO_CODED_AS
MSH/D014859|UMLS/C0699129|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0699129|ALSO_CODED_AS
NCI/C1658|UMLS/C0699129|ALSO_CODED_AS
RXNORM/202421|UMLS/C0699129|ALSO_CODED_AS
MSH/D006886|UMLS/C0699177|ALSO_CODED_AS
NCI/C29101|UMLS/C0699177|ALSO_CODED_AS
RXNORM/202462|UMLS/C0699177|ALSO_CODED_AS
MSH/D001379|UMLS/C0699279|ALSO_CODED_AS
NCI/C47961|UMLS/C0699279|ALSO_CODED_AS
RXNORM/202559|UMLS/C0699279|ALSO_CODED_AS
LNC/LA14335-6|UMLS/C0699319|ALSO_CODED_AS
MSH/D003520|UMLS/C0699319|ALSO_CODED_AS
MSH/D010672|UMLS/C0699512|ALSO_CODED_AS
NCI/C48011|UMLS/C0699512|ALSO_CODED_AS
RXNORM/202740|UMLS/C0699512|ALSO_CODED_AS
MSH/D017258|UMLS/C0699702|ALSO_CODED_AS
NCI/C1155|UMLS/C0699702|ALSO_CODED_AS
RXNORM/202888|UMLS/C0699702|ALSO_CODED_AS
MSH/D004966|UMLS/C0699710|ALSO_CODED_AS
NCI/C482|UMLS/C0699710|ALSO_CODED_AS
RXNORM/202896|UMLS/C0699710|ALSO_CODED_AS
ICD9CM/288.65|UMLS/C0702266|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0702266|ALSO_CODED_AS
MSH/D015773|UMLS/C0728763|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0728763|ALSO_CODED_AS
NCI/C468|UMLS/C0728763|ALSO_CODED_AS
RXNORM/224921|UMLS/C0728763|ALSO_CODED_AS
MSH/D009837|UMLS/C0751396|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0751396|ALSO_CODED_AS
NCI/C3288|UMLS/C0751396|ALSO_CODED_AS
HPO/HP:0002183|UMLS/C0751466|ALSO_CODED_AS
MSH/D012001|UMLS/C0751466|ALSO_CODED_AS
NCI/C122579|UMLS/C0751466|ALSO_CODED_AS
OMIM/MTHU003238|UMLS/C0751466|ALSO_CODED_AS
HPO/HP:0031807|UMLS/C0853716|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0853716|ALSO_CODED_AS
NCI/C34414|UMLS/C0853716|ALSO_CODED_AS
HPO/HP:0011096|UMLS/C0878575|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0878575|ALSO_CODED_AS
MSH/C411282|UMLS/C0915981|ALSO_CODED_AS
LNC/LA9478-4|UMLS/C0917711|ALSO_CODED_AS
MEDLINEPLUS/3953|UMLS/C0917711|ALSO_CODED_AS
MSH/D008279|UMLS/C0917711|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0917711|ALSO_CODED_AS
MSH/D024803|UMLS/C0969682|ALSO_CODED_AS
MSH/D024803|UMLS/C0969683|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0994191|ALSO_CODED_AS
FMA/7183|UMLS/C1140618|ALSO_CODED_AS
LNC/LA18113-3|UMLS/C1140618|ALSO_CODED_AS
LNC/LA30845-4|UMLS/C1140618|ALSO_CODED_AS
LNC/LP200031-5|UMLS/C1140618|ALSO_CODED_AS
LNC/LP29957-5|UMLS/C1140618|ALSO_CODED_AS
LNC/MTHU011974|UMLS/C1140618|ALSO_CODED_AS
MSH/D034941|UMLS/C1140618|ALSO_CODED_AS
MTH/NOCODE|UMLS/C1140618|ALSO_CODED_AS
NCI/C12671|UMLS/C1140618|ALSO_CODED_AS
FMA/63503|UMLS/C1179687|ALSO_CODED_AS
MTH/NOCODE|UMLS/C1179687|ALSO_CODED_AS
FMA/63504|UMLS/C1179688|ALSO_CODED_AS
MTH/NOCODE|UMLS/C1179688|ALSO_CODED_AS
FMA/74525|UMLS/C1184145|ALSO_CODED_AS
NCI/C161326|UMLS/C1184145|ALSO_CODED_AS
MTH/NOCODE|UMLS/C1260928|ALSO_CODED_AS
HPO/HP:0001824|UMLS/C1262477|ALSO_CODED_AS
HPO/HP:0004325|UMLS/C1262477|ALSO_CODED_AS
ICD9CM/783.21|UMLS/C1262477|ALSO_CODED_AS
LNC/LP75884-4|UMLS/C1262477|ALSO_CODED_AS
LNC/MTHU020881|UMLS/C1262477|ALSO_CODED_AS
MSH/D015431|UMLS/C1262477|ALSO_CODED_AS
MTH/NOCODE|UMLS/C1262477|ALSO_CODED_AS
NCI/C3445|UMLS/C1262477|ALSO_CODED_AS
OMIM/MTHU004026|UMLS/C1262477|ALSO_CODED_AS
OMIM/MTHU005164|UMLS/C1262477|ALSO_CODED_AS
OMIM/MTHU012809|UMLS/C1262477|ALSO_CODED_AS
OMIM/MTHU072943|UMLS/C1262477|ALSO_CODED_AS
MTH/NOCODE|UMLS/C1293134|ALSO_CODED_AS
NCI/C73432|UMLS/C1293134|ALSO_CODED_AS
FMA/321842|UMLS/C1322271|ALSO_CODED_AS
MSH/D014955|UMLS/C1322271|ALSO_CODED_AS
MTH/NOCODE|UMLS/C1322271|ALSO_CODED_AS
NCI/C33894|UMLS/C1322271|ALSO_CODED_AS
HGNC/HGNC:1836|UMLS/C1332750|ALSO_CODED_AS
MTH/NOCODE|UMLS/C1332750|ALSO_CODED_AS
NCI/C28532|UMLS/C1332750|ALSO_CODED_AS
OMIM/600749|UMLS/C1332750|ALSO_CODED_AS
HGNC/HGNC:2469|UMLS/C1413766|ALSO_CODED_AS
MTH/NOCODE|UMLS/C1413766|ALSO_CODED_AS
OMIM/123876|UMLS/C1413766|ALSO_CODED_AS
HGNC/HGNC:3467|UMLS/C1414461|ALSO_CODED_AS
MTH/NOCODE|UMLS/C1414461|ALSO_CODED_AS
NCI/C38349|UMLS/C1414461|ALSO_CODED_AS
OMIM/133430|UMLS/C1414461|ALSO_CODED_AS
HGNC/HGNC:4432|UMLS/C1415181|ALSO_CODED_AS
MTH/NOCODE|UMLS/C1415181|ALSO_CODED_AS
NCI/C38499|UMLS/C1415181|ALSO_CODED_AS
OMIM/138180|UMLS/C1415181|ALSO_CODED_AS
HGNC/HGNC:9689|UMLS/C1419129|ALSO_CODED_AS
MTH/NOCODE|UMLS/C1419129|ALSO_CODED_AS
OMIM/612719|UMLS/C1419129|ALSO_CODED_AS
HGNC/HGNC:10933|UMLS/C1420113|ALSO_CODED_AS
LNC/LP208425-1|UMLS/C1420113|ALSO_CODED_AS
MTH/NOCODE|UMLS/C1420113|ALSO_CODED_AS
OMIM/604322|UMLS/C1420113|ALSO_CODED_AS
MTH/NOCODE|UMLS/C1446409|ALSO_CODED_AS
NCI/C25246|UMLS/C1446409|ALSO_CODED_AS
MSH/D010129|UMLS/C1449722|ALSO_CODED_AS
MTH/NOCODE|UMLS/C1449722|ALSO_CODED_AS
HGNC/HGNC:4818|UMLS/C1456461|ALSO_CODED_AS
MTH/NOCODE|UMLS/C1456461|ALSO_CODED_AS
OMIM/601463|UMLS/C1456461|ALSO_CODED_AS
LNC/LA11011-6|UMLS/C1457868|ALSO_CODED_AS
LNC/LA14960-1|UMLS/C1457868|ALSO_CODED_AS
LNC/LA32282-8|UMLS/C1457868|ALSO_CODED_AS
LNC/LA66-6|UMLS/C1457868|ALSO_CODED_AS
MTH/NOCODE|UMLS/C1457868|ALSO_CODED_AS
NCI/C71686|UMLS/C1457868|ALSO_CODED_AS
ICD9CM/780-789.99|UMLS/C1457887|ALSO_CODED_AS
LNC/LP185406-8|UMLS/C1457887|ALSO_CODED_AS
LNC/LP75708-5|UMLS/C1457887|ALSO_CODED_AS
LNC/MTHU021540|UMLS/C1457887|ALSO_CODED_AS
LNC/MTHU048142|UMLS/C1457887|ALSO_CODED_AS
MTH/NOCODE|UMLS/C1457887|ALSO_CODED_AS
NCI/C4876|UMLS/C1457887|ALSO_CODED_AS
NCI/C32727|UMLS/C1512399|ALSO_CODED_AS
LNC/LA26053-1|UMLS/C1514241|ALSO_CODED_AS
LNC/LA6576-8|UMLS/C1514241|ALSO_CODED_AS
MTH/NOCODE|UMLS/C1514241|ALSO_CODED_AS
NCI/C38758|UMLS/C1514241|ALSO_CODED_AS
MTH/NOCODE|UMLS/C1555288|ALSO_CODED_AS
MTH/NOCODE|UMLS/C1704258|ALSO_CODED_AS
NCI/C9440|UMLS/C1704258|ALSO_CODED_AS
MTH/NOCODE|UMLS/C1706041|ALSO_CODED_AS
NCI/C52527|UMLS/C1706041|ALSO_CODED_AS
MTH/NOCODE|UMLS/C1706235|ALSO_CODED_AS
NCI/C51574|UMLS/C1706235|ALSO_CODED_AS
MTH/NOCODE|UMLS/C1706600|ALSO_CODED_AS
NCI/C51051|UMLS/C1706600|ALSO_CODED_AS
NCI/C50103|UMLS/C1709077|ALSO_CODED_AS
LNC/LP200054-7|UMLS/C1711202|ALSO_CODED_AS
NCI/C51654|UMLS/C1711202|ALSO_CODED_AS
OMIM/MTHU006304|UMLS/C1833300|ALSO_CODED_AS
MSH/C517212|UMLS/C1872855|ALSO_CODED_AS
MTH/NOCODE|UMLS/C1872855|ALSO_CODED_AS
NCI/C25920|UMLS/C1872855|ALSO_CODED_AS
MTH/NOCODE|UMLS/C1873497|ALSO_CODED_AS
OMIM/MTHU002946|UMLS/C1873497|ALSO_CODED_AS
NCI/C62777|UMLS/C1882346|ALSO_CODED_AS
FMA/32558|UMLS/C1995013|ALSO_CODED_AS
MTH/NOCODE|UMLS/C1995013|ALSO_CODED_AS
LNC/LA30858-7|UMLS/C2242996|ALSO_CODED_AS
MTH/NOCODE|UMLS/C2242996|ALSO_CODED_AS
NCI/C50771|UMLS/C2242996|ALSO_CODED_AS
OMIM/MTHU021951|UMLS/C2242996|ALSO_CODED_AS
OMIM/MTHU067008|UMLS/C2242996|ALSO_CODED_AS
MSH/D024505|UMLS/C2351011|ALSO_CODED_AS
MSH/D024505|UMLS/C2351012|ALSO_CODED_AS
LNC/52497-5|UMLS/C2713234|ALSO_CODED_AS
MTH/NOCODE|UMLS/C2713234|ALSO_CODED_AS
MTH/NOCODE|UMLS/C2826539|ALSO_CODED_AS
NCI/C82853|UMLS/C2826539|ALSO_CODED_AS
LNC/LP7653-1|UMLS/C3146295|ALSO_CODED_AS
LNC/MTHU014783|UMLS/C3146295|ALSO_CODED_AS
MTH/NOCODE|UMLS/C3146295|ALSO_CODED_AS
NCI/C33812|UMLS/C3146295|ALSO_CODED_AS
RXNORM/1305201|UMLS/C3486148|ALSO_CODED_AS
MTH/NOCODE|UMLS/C3496642|ALSO_CODED_AS
ICD9CM/799.3|UMLS/C3714552|ALSO_CODED_AS
LNC/LP75880-2|UMLS/C3714552|ALSO_CODED_AS
LNC/MTHU013531|UMLS/C3714552|ALSO_CODED_AS
MSH/D000073496|UMLS/C3714552|ALSO_CODED_AS
MTH/NOCODE|UMLS/C3714552|ALSO_CODED_AS
NCI/C50809|UMLS/C3714552|ALSO_CODED_AS
OMIM/MTHU036428|UMLS/C3714552|ALSO_CODED_AS
OMIM/MTHU037795|UMLS/C3714552|ALSO_CODED_AS
OMIM/MTHU038351|UMLS/C3714552|ALSO_CODED_AS
FMA/55675|UMLS/C3714787|ALSO_CODED_AS
LNC/LA22164-0|UMLS/C3714787|ALSO_CODED_AS
LNC/LA4174-4|UMLS/C3714787|ALSO_CODED_AS
LNC/LP422652-0|UMLS/C3714787|ALSO_CODED_AS
LNC/MTHU065908|UMLS/C3714787|ALSO_CODED_AS
MSH/D002490|UMLS/C3714787|ALSO_CODED_AS
MTH/NOCODE|UMLS/C3714787|ALSO_CODED_AS
NCI/C12438|UMLS/C3714787|ALSO_CODED_AS
OMIM/MTHU000058|UMLS/C3714787|ALSO_CODED_AS
LNC/LA14562-5|UMLS/C3811621|ALSO_CODED_AS
MTH/NOCODE|UMLS/C3811621|ALSO_CODED_AS
LNC/LA11844-0|UMLS/C3838679|ALSO_CODED_AS
MTH/NOCODE|UMLS/C3838679|ALSO_CODED_AS
HPO/HP:0001123|UMLS/C3887875|ALSO_CODED_AS
ICD9CM/368.4|UMLS/C3887875|ALSO_CODED_AS
ICD9CM/368.40|UMLS/C3887875|ALSO_CODED_AS
LNC/LP201274-0|UMLS/C3887875|ALSO_CODED_AS
LNC/MTHU051243|UMLS/C3887875|ALSO_CODED_AS
MTH/NOCODE|UMLS/C3887875|ALSO_CODED_AS
NCI/C118727|UMLS/C3887875|ALSO_CODED_AS
OMIM/MTHU035290|UMLS/C3887875|ALSO_CODED_AS
OMIM/MTHU037111|UMLS/C3887875|ALSO_CODED_AS
OMIM/MTHU039065|UMLS/C3887875|ALSO_CODED_AS
OMIM/MTHU045031|UMLS/C3887875|ALSO_CODED_AS
LNC/LA6745-9|UMLS/C4036205|ALSO_CODED_AS
MTH/NOCODE|UMLS/C4053487|ALSO_CODED_AS
NCI/C121777|UMLS/C4053487|ALSO_CODED_AS
LNC/LA25149-8|UMLS/C4068812|ALSO_CODED_AS
LNC/LA25148-0|UMLS/C4068813|ALSO_CODED_AS
FMA/30316|UMLS/C4083049|ALSO_CODED_AS
FMA/5022|UMLS/C4083049|ALSO_CODED_AS
LNC/LA24800-7|UMLS/C4083049|ALSO_CODED_AS
LNC/LP234848-2|UMLS/C4083049|ALSO_CODED_AS
MTH/NOCODE|UMLS/C4083049|ALSO_CODED_AS
NCI/C13056|UMLS/C4083049|ALSO_CODED_AS
MTH/NOCODE|UMLS/C4084902|ALSO_CODED_AS
NCI/C125461|UMLS/C4084902|ALSO_CODED_AS
OMIM/MTHU052802|UMLS/C4227868|ALSO_CODED_AS
OMIM/MTHU068777|UMLS/C4230085|ALSO_CODED_AS
LNC/LP206620-9|UMLS/C4266577|ALSO_CODED_AS
LNC/MTHU051712|UMLS/C4266577|ALSO_CODED_AS
MTH/NOCODE|UMLS/C4266577|ALSO_CODED_AS
HPO/HP:0003651|UMLS/C4281786|ALSO_CODED_AS
MTH/NOCODE|UMLS/C4281786|ALSO_CODED_AS
LNC/LP221488-2|UMLS/C4285005|ALSO_CODED_AS
LNC/MTHU053713|UMLS/C4285005|ALSO_CODED_AS
MTH/NOCODE|UMLS/C4285005|ALSO_CODED_AS
LNC/LP220355-4|UMLS/C4285347|ALSO_CODED_AS
LNC/LP220356-2|UMLS/C4285347|ALSO_CODED_AS
LNC/MTHU054543|UMLS/C4285347|ALSO_CODED_AS
MTH/NOCODE|UMLS/C4285347|ALSO_CODED_AS
NCI/C128235|UMLS/C4289861|ALSO_CODED_AS
LNC/LP221473-4|UMLS/C4298907|ALSO_CODED_AS
LNC/MTHU053734|UMLS/C4298907|ALSO_CODED_AS
MTH/NOCODE|UMLS/C4298907|ALSO_CODED_AS
LNC/LP221450-2|UMLS/C4299094|ALSO_CODED_AS
LNC/MTHU053770|UMLS/C4299094|ALSO_CODED_AS
MTH/NOCODE|UMLS/C4299094|ALSO_CODED_AS
OMIM/MTHU054974|UMLS/C4314713|ALSO_CODED_AS
OMIM/MTHU054858|UMLS/C4314814|ALSO_CODED_AS
NCI/C138177|UMLS/C4527419|ALSO_CODED_AS
LNC/LA21963-6|UMLS/C4554543|ALSO_CODED_AS
MTH/NOCODE|UMLS/C4554543|ALSO_CODED_AS
NCI/C146686|UMLS/C4687421|ALSO_CODED_AS
OMIM/MTHU060428|UMLS/C4693091|ALSO_CODED_AS
MTH/NOCODE|UMLS/C4723682|ALSO_CODED_AS
NCI/C150215|UMLS/C4723682|ALSO_CODED_AS
MTH/NOCODE|UMLS/C4723717|ALSO_CODED_AS
NCI/C150217|UMLS/C4723717|ALSO_CODED_AS
NCI/C156447|UMLS/C4744828|ALSO_CODED_AS
OMIM/MTHU064668|UMLS/C5195254|ALSO_CODED_AS
LNC/LA6115-5|UMLS/C5200950|ALSO_CODED_AS
MTH/NOCODE|UMLS/C5200950|ALSO_CODED_AS
NCI/C160918|UMLS/C5205657|ALSO_CODED_AS
NCI/C162076|UMLS/C5206307|ALSO_CODED_AS
MTH/NOCODE|UMLS/C5401399|ALSO_CODED_AS
NCI/C174212|UMLS/C5401399|ALSO_CODED_AS
NCI/C170564|UMLS/C5418622|ALSO_CODED_AS
NCI/C170797|UMLS/C5418804|ALSO_CODED_AS
MTH/NOCODE|UMLS/C5444025|ALSO_CODED_AS
OMIM/MTHU072954|UMLS/C5543199|ALSO_CODED_AS
LNC/LA15393-4|UMLS/C0005558|ALSO_CODED_AS
LNC/LA3911-0|UMLS/C0005558|ALSO_CODED_AS
LNC/LP200041-4|UMLS/C0005558|ALSO_CODED_AS
LNC/LP68311-7|UMLS/C0005558|ALSO_CODED_AS
LNC/MTHU028106|UMLS/C0005558|ALSO_CODED_AS
MEDLINEPLUS/5921|UMLS/C0005558|ALSO_CODED_AS
MSH/D001706|UMLS/C0005558|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0005558|ALSO_CODED_AS
NCI/C15189|UMLS/C0005558|ALSO_CODED_AS
HPO/HP:0003761|UMLS/C0006663|ALSO_CODED_AS
MSH/D002114|UMLS/C0006663|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0006663|ALSO_CODED_AS
NCI/C3672|UMLS/C0006663|ALSO_CODED_AS
OMIM/MTHU060902|UMLS/C0006663|ALSO_CODED_AS
FMA/50772|UMLS/C0007473|ALSO_CODED_AS
MSH/D002426|UMLS/C0007473|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0007473|ALSO_CODED_AS
NCI/C12690|UMLS/C0007473|ALSO_CODED_AS
MSH/D002459|UMLS/C0007594|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0007594|ALSO_CODED_AS
NCI/C16401|UMLS/C0007594|ALSO_CODED_AS
MSH/D015928|UMLS/C0009244|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0009244|ALSO_CODED_AS
NCI/C64345|UMLS/C0009244|ALSO_CODED_AS
HPO/HP:0000651|UMLS/C0012569|ALSO_CODED_AS
ICD9CM/368.2|UMLS/C0012569|ALSO_CODED_AS
LNC/LA15082-3|UMLS/C0012569|ALSO_CODED_AS
MSH/D004172|UMLS/C0012569|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0012569|ALSO_CODED_AS
NCI/C37941|UMLS/C0012569|ALSO_CODED_AS
OMIM/MTHU000786|UMLS/C0012569|ALSO_CODED_AS
OMIM/MTHU062371|UMLS/C0012569|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0015252|ALSO_CODED_AS
NCI/C158758|UMLS/C0015252|ALSO_CODED_AS
HPO/HP:0000520|UMLS/C0015300|ALSO_CODED_AS
ICD9CM/376.30|UMLS/C0015300|ALSO_CODED_AS
MSH/D005094|UMLS/C0015300|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0015300|ALSO_CODED_AS
NCI/C118763|UMLS/C0015300|ALSO_CODED_AS
NCI/C87114|UMLS/C0015300|ALSO_CODED_AS
OMIM/MTHU001173|UMLS/C0015300|ALSO_CODED_AS
OMIM/MTHU004615|UMLS/C0015300|ALSO_CODED_AS
OMIM/MTHU005786|UMLS/C0015300|ALSO_CODED_AS
OMIM/MTHU016288|UMLS/C0015300|ALSO_CODED_AS
OMIM/MTHU019358|UMLS/C0015300|ALSO_CODED_AS
FMA/12513|UMLS/C0015392|ALSO_CODED_AS
LNC/LA14722-5|UMLS/C0015392|ALSO_CODED_AS
LNC/LP117007-7|UMLS/C0015392|ALSO_CODED_AS
LNC/LP207778-4|UMLS/C0015392|ALSO_CODED_AS
LNC/LP7218-3|UMLS/C0015392|ALSO_CODED_AS
LNC/LP7222-5|UMLS/C0015392|ALSO_CODED_AS
LNC/LP7797-6|UMLS/C0015392|ALSO_CODED_AS
LNC/MTHU000064|UMLS/C0015392|ALSO_CODED_AS
LNC/MTHU001409|UMLS/C0015392|ALSO_CODED_AS
LNC/MTHU001430|UMLS/C0015392|ALSO_CODED_AS
LNC/MTHU038905|UMLS/C0015392|ALSO_CODED_AS
MSH/D005123|UMLS/C0015392|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0015392|ALSO_CODED_AS
MTH/U003284|UMLS/C0015392|ALSO_CODED_AS
NCI/C12401|UMLS/C0015392|ALSO_CODED_AS
OMIM/MTHU000020|UMLS/C0015392|ALSO_CODED_AS
HPO/HP:0002315|UMLS/C0018681|ALSO_CODED_AS
ICD9CM/784.0|UMLS/C0018681|ALSO_CODED_AS
LNC/LA15854-5|UMLS/C0018681|ALSO_CODED_AS
LNC/LA15903-0|UMLS/C0018681|ALSO_CODED_AS
LNC/LP217220-5|UMLS/C0018681|ALSO_CODED_AS
LNC/LP74908-2|UMLS/C0018681|ALSO_CODED_AS
LNC/MTHU020860|UMLS/C0018681|ALSO_CODED_AS
LNC/MTHU053651|UMLS/C0018681|ALSO_CODED_AS
MEDLINEPLUS/273|UMLS/C0018681|ALSO_CODED_AS
MSH/D006261|UMLS/C0018681|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0018681|ALSO_CODED_AS
NCI/C34661|UMLS/C0018681|ALSO_CODED_AS
OMIM/MTHU036348|UMLS/C0018681|ALSO_CODED_AS
OMIM/MTHU036635|UMLS/C0018681|ALSO_CODED_AS
HPO/HP:0002858|UMLS/C0025286|ALSO_CODED_AS
MSH/D008579|UMLS/C0025286|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0025286|ALSO_CODED_AS
NCI/C3230|UMLS/C0025286|ALSO_CODED_AS
OMIM/190040|UMLS/C0025286|ALSO_CODED_AS
OMIM/601728|UMLS/C0025286|ALSO_CODED_AS
OMIM/MTHU003590|UMLS/C0025286|ALSO_CODED_AS
OMIM/MTHU036996|UMLS/C0025286|ALSO_CODED_AS
HPO/HP:0002664|UMLS/C0027651|ALSO_CODED_AS
ICD9CM/140-239.99|UMLS/C0027651|ALSO_CODED_AS
LNC/LA16304-0|UMLS/C0027651|ALSO_CODED_AS
LNC/LP207120-9|UMLS/C0027651|ALSO_CODED_AS
LNC/LP7664-8|UMLS/C0027651|ALSO_CODED_AS
LNC/MTHU010346|UMLS/C0027651|ALSO_CODED_AS
MEDLINEPLUS/25|UMLS/C0027651|ALSO_CODED_AS
MSH/D009369|UMLS/C0027651|ALSO_CODED_AS
MTH/471|UMLS/C0027651|ALSO_CODED_AS
MTH/755|UMLS/C0027651|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0027651|ALSO_CODED_AS
NCI/C3262|UMLS/C0027651|ALSO_CODED_AS
OMIM/MTHU000126|UMLS/C0027651|ALSO_CODED_AS
FMA/50863|UMLS/C0029130|ALSO_CODED_AS
LNC/LA24828-8|UMLS/C0029130|ALSO_CODED_AS
LNC/LP201259-1|UMLS/C0029130|ALSO_CODED_AS
MSH/D009900|UMLS/C0029130|ALSO_CODED_AS
MTH/U002120|UMLS/C0029130|ALSO_CODED_AS
NCI/C12761|UMLS/C0029130|ALSO_CODED_AS
MEDLINEPLUS/6427|UMLS/C0029132|ALSO_CODED_AS
MSH/D009901|UMLS/C0029132|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0029132|ALSO_CODED_AS
NCI/C79698|UMLS/C0029132|ALSO_CODED_AS
HPO/HP:0012531|UMLS/C0030193|ALSO_CODED_AS
ICD9CM/338-338.99|UMLS/C0030193|ALSO_CODED_AS
LNC/LA17107-6|UMLS/C0030193|ALSO_CODED_AS
LNC/LA27491-2|UMLS/C0030193|ALSO_CODED_AS
LNC/LA7460-4|UMLS/C0030193|ALSO_CODED_AS
LNC/LP75331-6|UMLS/C0030193|ALSO_CODED_AS
LNC/LP75342-3|UMLS/C0030193|ALSO_CODED_AS
LNC/MTHU021175|UMLS/C0030193|ALSO_CODED_AS
LNC/MTHU029813|UMLS/C0030193|ALSO_CODED_AS
MEDLINEPLUS/351|UMLS/C0030193|ALSO_CODED_AS
MSH/D010146|UMLS/C0030193|ALSO_CODED_AS
MTH/306|UMLS/C0030193|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0030193|ALSO_CODED_AS
NCI/C25271|UMLS/C0030193|ALSO_CODED_AS
NCI/C3303|UMLS/C0030193|ALSO_CODED_AS
OMIM/MTHU033713|UMLS/C0030193|ALSO_CODED_AS
FMA/54683|UMLS/C0037885|ALSO_CODED_AS
MSH/D013101|UMLS/C0037885|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0037885|ALSO_CODED_AS
NCI/C12278|UMLS/C0037885|ALSO_CODED_AS
ICD9CM/81.0|UMLS/C0037935|ALSO_CODED_AS
ICD9CM/81.00|UMLS/C0037935|ALSO_CODED_AS
MSH/D013123|UMLS/C0037935|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0037935|ALSO_CODED_AS
NCI/C157986|UMLS/C0037935|ALSO_CODED_AS
LNC/LA24329-7|UMLS/C0040405|ALSO_CODED_AS
LNC/LA9477-6|UMLS/C0040405|ALSO_CODED_AS
LNC/LP200067-9|UMLS/C0040405|ALSO_CODED_AS
LNC/LP6207-7|UMLS/C0040405|ALSO_CODED_AS
MEDLINEPLUS/3951|UMLS/C0040405|ALSO_CODED_AS
MSH/D014057|UMLS/C0040405|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0040405|ALSO_CODED_AS
NCI/C17204|UMLS/C0040405|ALSO_CODED_AS
LNC/LA29720-2|UMLS/C0041671|ALSO_CODED_AS
MSH/D001289|UMLS/C0041671|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0041671|ALSO_CODED_AS
OMIM/MTHU004474|UMLS/C0041671|ALSO_CODED_AS
OMIM/MTHU007687|UMLS/C0041671|ALSO_CODED_AS
OMIM/MTHU021250|UMLS/C0041671|ALSO_CODED_AS
OMIM/MTHU033846|UMLS/C0041671|ALSO_CODED_AS
OMIM/MTHU060591|UMLS/C0041671|ALSO_CODED_AS
GO/GO:0007601|UMLS/C0042789|ALSO_CODED_AS
LNC/LA28160-2|UMLS/C0042789|ALSO_CODED_AS
LNC/LP30560-4|UMLS/C0042789|ALSO_CODED_AS
LNC/LP75855-4|UMLS/C0042789|ALSO_CODED_AS
LNC/MTHU014733|UMLS/C0042789|ALSO_CODED_AS
LNC/MTHU051591|UMLS/C0042789|ALSO_CODED_AS
MSH/D014785|UMLS/C0042789|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0042789|ALSO_CODED_AS
NCI/C38533|UMLS/C0042789|ALSO_CODED_AS
HPO/HP:0030786|UMLS/C0085635|ALSO_CODED_AS
LNC/LA16376-8|UMLS/C0085635|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0085635|ALSO_CODED_AS
OMIM/MTHU057995|UMLS/C0085635|ALSO_CODED_AS
OMIM/MTHU072494|UMLS/C0085635|ALSO_CODED_AS
ICD9CM/363.34|UMLS/C0154888|ALSO_CODED_AS
ICD9CM/81.01|UMLS/C0186005|ALSO_CODED_AS
MSH/C538196|UMLS/C0186005|ALSO_CODED_AS
ICD9CM/81.26|UMLS/C0187394|ALSO_CODED_AS
ICD9CM/81.25|UMLS/C0187402|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0187402|ALSO_CODED_AS
LNC/LP6782-9|UMLS/C0205146|ALSO_CODED_AS
LNC/LP72094-3|UMLS/C0205146|ALSO_CODED_AS
LNC/MTHU009059|UMLS/C0205146|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0205146|ALSO_CODED_AS
NCI/C25244|UMLS/C0205146|ALSO_CODED_AS
LNC/LA4329-4|UMLS/C0225317|ALSO_CODED_AS
LNC/LP208038-2|UMLS/C0225317|ALSO_CODED_AS
LNC/LP234850-8|UMLS/C0225317|ALSO_CODED_AS
LNC/LP30469-8|UMLS/C0225317|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0225317|ALSO_CODED_AS
NCI/C12471|UMLS/C0225317|ALSO_CODED_AS
FMA/54449|UMLS/C0229089|ALSO_CODED_AS
LNC/LA14703-5|UMLS/C0229089|ALSO_CODED_AS
LNC/LA16257-0|UMLS/C0229089|ALSO_CODED_AS
LNC/LA18789-0|UMLS/C0229089|ALSO_CODED_AS
LNC/LP7220-9|UMLS/C0229089|ALSO_CODED_AS
LNC/MTHU013548|UMLS/C0229089|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0229089|ALSO_CODED_AS
NCI/C119333|UMLS/C0229089|ALSO_CODED_AS
LNC/LA15091-4|UMLS/C0229118|ALSO_CODED_AS
LNC/LA16259-6|UMLS/C0229118|ALSO_CODED_AS
LNC/LA18787-4|UMLS/C0229118|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0229118|ALSO_CODED_AS
NCI/C119335|UMLS/C0229118|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0231239|ALSO_CODED_AS
HPO/HP:0002354|UMLS/C0233794|ALSO_CODED_AS
LNC/LA56-7|UMLS/C0233794|ALSO_CODED_AS
LNC/LP36329-8|UMLS/C0233794|ALSO_CODED_AS
LNC/MTHU019385|UMLS/C0233794|ALSO_CODED_AS
MSH/D008569|UMLS/C0233794|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0233794|ALSO_CODED_AS
NCI/C78444|UMLS/C0233794|ALSO_CODED_AS
OMIM/MTHU000534|UMLS/C0233794|ALSO_CODED_AS
OMIM/MTHU003336|UMLS/C0233794|ALSO_CODED_AS
OMIM/MTHU008726|UMLS/C0233794|ALSO_CODED_AS
HPO/HP:0011134|UMLS/C0239574|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0239574|ALSO_CODED_AS
NCI/C35292|UMLS/C0239574|ALSO_CODED_AS
LNC/LA15111-0|UMLS/C0278138|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0278138|ALSO_CODED_AS
LNC/LA24637-3|UMLS/C0333641|ALSO_CODED_AS
MSH/D001284|UMLS/C0333641|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0333641|ALSO_CODED_AS
NCI/C79748|UMLS/C0333641|ALSO_CODED_AS
OMIM/MTHU006850|UMLS/C0333641|ALSO_CODED_AS
HPO/HP:0100543|UMLS/C0338656|ALSO_CODED_AS
LNC/LA15213-4|UMLS/C0338656|ALSO_CODED_AS
LNC/LP128695-6|UMLS/C0338656|ALSO_CODED_AS
LNC/MTHU040636|UMLS/C0338656|ALSO_CODED_AS
MSH/D060825|UMLS/C0338656|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0338656|ALSO_CODED_AS
NCI/C116921|UMLS/C0338656|ALSO_CODED_AS
NCI/C27101|UMLS/C0338656|ALSO_CODED_AS
NCI/C46083|UMLS/C0338656|ALSO_CODED_AS
OMIM/MTHU003329|UMLS/C0338656|ALSO_CODED_AS
OMIM/MTHU003399|UMLS/C0338656|ALSO_CODED_AS
OMIM/MTHU004473|UMLS/C0338656|ALSO_CODED_AS
OMIM/MTHU004914|UMLS/C0338656|ALSO_CODED_AS
OMIM/MTHU012485|UMLS/C0338656|ALSO_CODED_AS
OMIM/MTHU018589|UMLS/C0338656|ALSO_CODED_AS
OMIM/MTHU067784|UMLS/C0338656|ALSO_CODED_AS
HPO/HP:0000622|UMLS/C0344232|ALSO_CODED_AS
LNC/LA15105-2|UMLS/C0344232|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0344232|ALSO_CODED_AS
NCI/C27123|UMLS/C0344232|ALSO_CODED_AS
OMIM/MTHU000785|UMLS/C0344232|ALSO_CODED_AS
HPO/HP:0000575|UMLS/C0344233|ALSO_CODED_AS
MSH/D009898|UMLS/C0344233|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0344233|ALSO_CODED_AS
LNC/LP15428-3|UMLS/C0347530|ALSO_CODED_AS
LNC/MTHU008590|UMLS/C0347530|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0347530|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0393706|ALSO_CODED_AS
NCI/C116552|UMLS/C0393706|ALSO_CODED_AS
FMA/302850|UMLS/C0450102|ALSO_CODED_AS
FMA/302856|UMLS/C0450102|ALSO_CODED_AS
FMA/54774|UMLS/C0450102|ALSO_CODED_AS
LNC/LP230199-4|UMLS/C0450102|ALSO_CODED_AS
LNC/LP30143-9|UMLS/C0450102|ALSO_CODED_AS
LNC/MTHU053775|UMLS/C0450102|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0450102|ALSO_CODED_AS
HPO/HP:0000618|UMLS/C0456909|ALSO_CODED_AS
LNC/LA17710-7|UMLS/C0456909|ALSO_CODED_AS
MSH/D001766|UMLS/C0456909|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0456909|ALSO_CODED_AS
NCI/C97109|UMLS/C0456909|ALSO_CODED_AS
OMIM/MTHU001370|UMLS/C0456909|ALSO_CODED_AS
HPO/HP:0000543|UMLS/C0554970|ALSO_CODED_AS
OMIM/MTHU000685|UMLS/C0554970|ALSO_CODED_AS
OMIM/MTHU008076|UMLS/C0554970|ALSO_CODED_AS
OMIM/MTHU011096|UMLS/C0554970|ALSO_CODED_AS
OMIM/MTHU013743|UMLS/C0554970|ALSO_CODED_AS
OMIM/MTHU030342|UMLS/C0554970|ALSO_CODED_AS
OMIM/MTHU036072|UMLS/C0554970|ALSO_CODED_AS
OMIM/MTHU051310|UMLS/C0554970|ALSO_CODED_AS
OMIM/MTHU069605|UMLS/C0554970|ALSO_CODED_AS
OMIM/MTHU070605|UMLS/C0554970|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0577559|ALSO_CODED_AS
NCI/C34808|UMLS/C0577559|ALSO_CODED_AS
LNC/LP266903-6|UMLS/C0577573|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0577573|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0578862|ALSO_CODED_AS
NCI/C87143|UMLS/C0578862|ALSO_CODED_AS
FMA/54448|UMLS/C0700042|ALSO_CODED_AS
MTH/U003315|UMLS/C0700042|ALSO_CODED_AS
LNC/LA17736-2|UMLS/C0728940|ALSO_CODED_AS
LNC/LA8951-1|UMLS/C0728940|ALSO_CODED_AS
LNC/LP207803-0|UMLS/C0728940|ALSO_CODED_AS
LNC/MTHU052930|UMLS/C0728940|ALSO_CODED_AS
MTH/NOCODE|UMLS/C0728940|ALSO_CODED_AS
NCI/C15232|UMLS/C0728940|ALSO_CODED_AS
NCI/C50640|UMLS/C0746961|ALSO_CODED_AS
LNC/LP29681-1|UMLS/C1315031|ALSO_CODED_AS
LNC/MTHU000073|UMLS/C1315031|ALSO_CODED_AS
MTH/NOCODE|UMLS/C1315031|ALSO_CODED_AS
MTH/NOCODE|UMLS/C1533591|ALSO_CODED_AS
OMIM/MTHU001863|UMLS/C1837545|ALSO_CODED_AS
OMIM/MTHU006842|UMLS/C1839253|ALSO_CODED_AS
OMIM/MTHU034731|UMLS/C1839253|ALSO_CODED_AS
OMIM/MTHU017793|UMLS/C1840417|ALSO_CODED_AS
MSH/C536916|UMLS/C1861101|ALSO_CODED_AS
MTH/NOCODE|UMLS/C1861101|ALSO_CODED_AS
OMIM/188560|UMLS/C1861101|ALSO_CODED_AS
MTH/NOCODE|UMLS/C2242558|ALSO_CODED_AS
OMIM/MTHU034013|UMLS/C2242558|ALSO_CODED_AS
LNC/54543-4|UMLS/C2707266|ALSO_CODED_AS
MTH/NOCODE|UMLS/C2707266|ALSO_CODED_AS
OMIM/MTHU025210|UMLS/C2750202|ALSO_CODED_AS
MSH/C567932|UMLS/C2936904|ALSO_CODED_AS
