id|vocabulary_code|LABEL
FMA/54709|FMA/54709|UmlsVocabulary
FMA/54721|FMA/54721|UmlsVocabulary
LNC/LP199945-9|LNC/LP199945-9|UmlsVocabulary
LNC/LP36094-8|LNC/LP36094-8|UmlsVocabulary
LNC/MTHU054285|LNC/MTHU054285|UmlsVocabulary
MSH/D012658|MSH/D012658|UmlsVocabulary
MTH/NOCODE|MTH/NOCODE|UmlsVocabulary
NCI/C12497|NCI/C12497|UmlsVocabulary
LNC/LA17213-2|LNC/LA17213-2|UmlsVocabulary
FMA/51061|FMA/51061|UmlsVocabulary
LNC/LP30507-5|LNC/LP30507-5|UmlsVocabulary
LNC/MTHU014777|LNC/MTHU014777|UmlsVocabulary
MSH/D000125|MSH/D000125|UmlsVocabulary
NCI/C32043|NCI/C32043|UmlsVocabulary
MSH/D000767|MSH/D000767|UmlsVocabulary
NCI/C15642|NCI/C15642|UmlsVocabulary
MSH/D000775|MSH/D000775|UmlsVocabulary
NCI/C92887|NCI/C92887|UmlsVocabulary
HPO/HP:0002427|HPO/HP:0002427|UmlsVocabulary
MSH/D001039|MSH/D001039|UmlsVocabulary
NCI/C34394|NCI/C34394|UmlsVocabulary
OMIM/MTHU008009|OMIM/MTHU008009|UmlsVocabulary
OMIM/MTHU022215|OMIM/MTHU022215|UmlsVocabulary
LNC/LP31695-7|LNC/LP31695-7|UmlsVocabulary
MEDLINEPLUS/5380|MEDLINEPLUS/5380|UmlsVocabulary
MSH/D001205|MSH/D001205|UmlsVocabulary
NCI/C285|NCI/C285|UmlsVocabulary
RXNORM/1151|RXNORM/1151|UmlsVocabulary
VANDF/4017471|VANDF/4017471|UmlsVocabulary
VANDF/4017646|VANDF/4017646|UmlsVocabulary
HPO/HP:0025406|HPO/HP:0025406|UmlsVocabulary
MSH/D001247|MSH/D001247|UmlsVocabulary
NCI/C28132|NCI/C28132|UmlsVocabulary
OMIM/MTHU059936|OMIM/MTHU059936|UmlsVocabulary
HPO/HP:0010867|HPO/HP:0010867|UmlsVocabulary
LNC/LA24636-5|LNC/LA24636-5|UmlsVocabulary
MSH/D001259|MSH/D001259|UmlsVocabulary
NCI/C26702|NCI/C26702|UmlsVocabulary
OMIM/MTHU036349|OMIM/MTHU036349|UmlsVocabulary
OMIM/MTHU068459|OMIM/MTHU068459|UmlsVocabulary
FMA/321900|FMA/321900|UmlsVocabulary
FMA/84013|FMA/84013|UmlsVocabulary
MSH/D001479|MSH/D001479|UmlsVocabulary
NCI/C12447|NCI/C12447|UmlsVocabulary
LNC/LP19284-6|LNC/LP19284-6|UmlsVocabulary
LNC/LP6186-3|LNC/LP6186-3|UmlsVocabulary
LNC/LP73955-4|LNC/LP73955-4|UmlsVocabulary
LNC/LP7788-5|LNC/LP7788-5|UmlsVocabulary
LNC/MTHU000051|LNC/MTHU000051|UmlsVocabulary
LNC/MTHU008050|LNC/MTHU008050|UmlsVocabulary
LNC/MTHU008375|LNC/MTHU008375|UmlsVocabulary
MSH/D001780|MSH/D001780|UmlsVocabulary
NCI/C62662|NCI/C62662|UmlsVocabulary
FMA/50801|FMA/50801|UmlsVocabulary
LNC/LA32232-3|LNC/LA32232-3|UmlsVocabulary
LNC/LA4254-4|LNC/LA4254-4|UmlsVocabulary
LNC/LP206702-5|LNC/LP206702-5|UmlsVocabulary
LNC/LP7084-9|LNC/LP7084-9|UmlsVocabulary
LNC/MTHU002079|LNC/MTHU002079|UmlsVocabulary
MSH/D001921|MSH/D001921|UmlsVocabulary
MTH/U001761|MTH/U001761|UmlsVocabulary
NCI/C12439|NCI/C12439|UmlsVocabulary
FMA/79876|FMA/79876|UmlsVocabulary
LNC/LP207337-9|LNC/LP207337-9|UmlsVocabulary
MSH/D001933|MSH/D001933|UmlsVocabulary
MTH/U001762|MTH/U001762|UmlsVocabulary
NCI/C12441|NCI/C12441|UmlsVocabulary
HPO/HP:0012185|HPO/HP:0012185|UmlsVocabulary
ICD9CM/354.0|ICD9CM/354.0|UmlsVocabulary
MEDLINEPLUS/179|MEDLINEPLUS/179|UmlsVocabulary
MSH/D002349|MSH/D002349|UmlsVocabulary
NCI/C34450|NCI/C34450|UmlsVocabulary
OMIM/115430|OMIM/115430|UmlsVocabulary
OMIM/MTHU011164|OMIM/MTHU011164|UmlsVocabulary
ICD9CM/88.41|ICD9CM/88.41|UmlsVocabulary
MSH/D002533|MSH/D002533|UmlsVocabulary
LNC/LP15510-8|LNC/LP15510-8|UmlsVocabulary
LNC/MTHU006937|LNC/MTHU006937|UmlsVocabulary
MSH/D003402|MSH/D003402|UmlsVocabulary
MTH/U000246|MTH/U000246|UmlsVocabulary
NCI/C113245|NCI/C113245|UmlsVocabulary
LNC/LA16776-9|LNC/LA16776-9|UmlsVocabulary
LNC/LP16098-3|LNC/LP16098-3|UmlsVocabulary
LNC/MTHU062952|LNC/MTHU062952|UmlsVocabulary
MSH/D016572|MSH/D016572|UmlsVocabulary
NCI/C406|NCI/C406|UmlsVocabulary
RXNORM/3008|RXNORM/3008|UmlsVocabulary
VANDF/4018761|VANDF/4018761|UmlsVocabulary
MSH/D003524|MSH/D003524|UmlsVocabulary
MSH/D003711|MSH/D003711|UmlsVocabulary
NCI/C117277|NCI/C117277|UmlsVocabulary
OMIM/MTHU002306|OMIM/MTHU002306|UmlsVocabulary
FMA/24901|FMA/24901|UmlsVocabulary
FMA/322616|FMA/322616|UmlsVocabulary
LNC/LA16717-3|LNC/LA16717-3|UmlsVocabulary
LNC/LP199967-3|LNC/LP199967-3|UmlsVocabulary
LNC/LP221486-6|LNC/LP221486-6|UmlsVocabulary
LNC/LP7196-1|LNC/LP7196-1|UmlsVocabulary
LNC/MTHU002674|LNC/MTHU002674|UmlsVocabulary
LNC/MTHU053748|LNC/MTHU053748|UmlsVocabulary
MSH/D004550|MSH/D004550|UmlsVocabulary
FMA/321843|FMA/321843|UmlsVocabulary
FMA/35289|FMA/35289|UmlsVocabulary
MSH/D004551|MSH/D004551|UmlsVocabulary
NCI/C32497|NCI/C32497|UmlsVocabulary
LNC/LP19403-2|LNC/LP19403-2|UmlsVocabulary
LNC/MTHU008531|LNC/MTHU008531|UmlsVocabulary
MSH/D004573|MSH/D004573|UmlsVocabulary
NCI/C464|NCI/C464|UmlsVocabulary
VANDF/4022490|VANDF/4022490|UmlsVocabulary
MSH/D004578|MSH/D004578|UmlsVocabulary
NCI/C16534|NCI/C16534|UmlsVocabulary
HPO/HP:0000988|HPO/HP:0000988|UmlsVocabulary
HPO/HP:4000054|HPO/HP:4000054|UmlsVocabulary
ICD9CM/782.1|ICD9CM/782.1|UmlsVocabulary
LNC/LA29194-0|LNC/LA29194-0|UmlsVocabulary
LNC/LA7469-5|LNC/LA7469-5|UmlsVocabulary
LNC/LP30547-1|LNC/LP30547-1|UmlsVocabulary
LNC/LP75487-6|LNC/LP75487-6|UmlsVocabulary
LNC/MTHU015064|LNC/MTHU015064|UmlsVocabulary
LNC/MTHU020933|LNC/MTHU020933|UmlsVocabulary
MEDLINEPLUS/208|MEDLINEPLUS/208|UmlsVocabulary
MSH/D005076|MSH/D005076|UmlsVocabulary
MTH/638|MTH/638|UmlsVocabulary
MTH/U003405|MTH/U003405|UmlsVocabulary
NCI/C111884|NCI/C111884|UmlsVocabulary
NCI/C39594|NCI/C39594|UmlsVocabulary
OMIM/MTHU008860|OMIM/MTHU008860|UmlsVocabulary
OMIM/MTHU011109|OMIM/MTHU011109|UmlsVocabulary
OMIM/MTHU047706|OMIM/MTHU047706|UmlsVocabulary
HPO/HP:0012378|HPO/HP:0012378|UmlsVocabulary
LNC/LA7542-9|LNC/LA7542-9|UmlsVocabulary
LNC/LP74831-6|LNC/LP74831-6|UmlsVocabulary
LNC/MTHU013358|LNC/MTHU013358|UmlsVocabulary
MEDLINEPLUS/5324|MEDLINEPLUS/5324|UmlsVocabulary
MSH/D005221|MSH/D005221|UmlsVocabulary
NCI/C3036|NCI/C3036|UmlsVocabulary
OMIM/MTHU010062|OMIM/MTHU010062|UmlsVocabulary
LNC/LP100865-7|LNC/LP100865-7|UmlsVocabulary
LNC/LP30516-6|LNC/LP30516-6|UmlsVocabulary
LNC/MTHU015039|LNC/MTHU015039|UmlsVocabulary
LNC/MTHU035898|LNC/MTHU035898|UmlsVocabulary
MSH/D005684|MSH/D005684|UmlsVocabulary
NCI/C75445|NCI/C75445|UmlsVocabulary
MSH/D006082|MSH/D006082|UmlsVocabulary
FMA/9712|FMA/9712|UmlsVocabulary
LNC/LA16719-9|LNC/LA16719-9|UmlsVocabulary
LNC/LP221491-6|LNC/LP221491-6|UmlsVocabulary
LNC/LP7279-5|LNC/LP7279-5|UmlsVocabulary
LNC/MTHU002685|LNC/MTHU002685|UmlsVocabulary
MSH/D006225|MSH/D006225|UmlsVocabulary
NCI/C32712|NCI/C32712|UmlsVocabulary
OMIM/MTHU000072|OMIM/MTHU000072|UmlsVocabulary
FMA/24994|FMA/24994|UmlsVocabulary
FMA/326009|FMA/326009|UmlsVocabulary
LNC/LA25778-4|LNC/LA25778-4|UmlsVocabulary
MSH/D006365|MSH/D006365|UmlsVocabulary
MTH/U003296|MTH/U003296|UmlsVocabulary
LNC/LP28800-8|LNC/LP28800-8|UmlsVocabulary
MSH/D006386|MSH/D006386|UmlsVocabulary
NCI/C130173|NCI/C130173|UmlsVocabulary
HPO/HP:0000822|HPO/HP:0000822|UmlsVocabulary
ICD9CM/401-405.99|ICD9CM/401-405.99|UmlsVocabulary
ICD9CM/997.91|ICD9CM/997.91|UmlsVocabulary
LNC/LA14293-7|LNC/LA14293-7|UmlsVocabulary
LNC/LA7444-8|LNC/LA7444-8|UmlsVocabulary
LNC/LP74941-3|LNC/LP74941-3|UmlsVocabulary
LNC/MTHU020789|LNC/MTHU020789|UmlsVocabulary
MEDLINEPLUS/34|MEDLINEPLUS/34|UmlsVocabulary
MSH/D006973|MSH/D006973|UmlsVocabulary
MTH/005|MTH/005|UmlsVocabulary
NCI/C3117|NCI/C3117|UmlsVocabulary
OMIM/MTHU002068|OMIM/MTHU002068|UmlsVocabulary
OMIM/MTHU014957|OMIM/MTHU014957|UmlsVocabulary
OMIM/MTHU058377|OMIM/MTHU058377|UmlsVocabulary
OMIM/MTHU070458|OMIM/MTHU070458|UmlsVocabulary
HPO/HP:0003474|HPO/HP:0003474|UmlsVocabulary
HPO/HP:0033748|HPO/HP:0033748|UmlsVocabulary
MSH/D006987|MSH/D006987|UmlsVocabulary
NCI/C50445|NCI/C50445|UmlsVocabulary
OMIM/MTHU010221|OMIM/MTHU010221|UmlsVocabulary
LNC/LP31454-9|LNC/LP31454-9|UmlsVocabulary
MSH/D007166|MSH/D007166|UmlsVocabulary
MTH/U002004|MTH/U002004|UmlsVocabulary
NCI/C574|NCI/C574|UmlsVocabulary
VANDF/4021763|VANDF/4021763|UmlsVocabulary
LNC/LP29657-1|LNC/LP29657-1|UmlsVocabulary
MSH/D007577|MSH/D007577|UmlsVocabulary
NCI/C14229|NCI/C14229|UmlsVocabulary
FMA/24974|FMA/24974|UmlsVocabulary
LNC/LA22232-5|LNC/LA22232-5|UmlsVocabulary
LNC/LP199984-8|LNC/LP199984-8|UmlsVocabulary
LNC/LP7381-9|LNC/LP7381-9|UmlsVocabulary
LNC/MTHU002687|LNC/MTHU002687|UmlsVocabulary
MSH/D007717|MSH/D007717|UmlsVocabulary
FMA/35175|FMA/35175|UmlsVocabulary
FMA/35184|FMA/35184|UmlsVocabulary
MSH/D007719|MSH/D007719|UmlsVocabulary
NCI/C32898|NCI/C32898|UmlsVocabulary
MEDLINEPLUS/210|MEDLINEPLUS/210|UmlsVocabulary
NCI/C25294|NCI/C25294|UmlsVocabulary
LNC/LP15033-1|LNC/LP15033-1|UmlsVocabulary
LNC/MTHU002348|LNC/MTHU002348|UmlsVocabulary
MSH/D007770|MSH/D007770|UmlsVocabulary
MTH/U000295|MTH/U000295|UmlsVocabulary
MTH/U002030|MTH/U002030|UmlsVocabulary
NCI/C25184|NCI/C25184|UmlsVocabulary
FMA/7184|FMA/7184|UmlsVocabulary
LNC/LA18112-5|LNC/LA18112-5|UmlsVocabulary
LNC/LA30846-2|LNC/LA30846-2|UmlsVocabulary
LNC/LP199985-5|LNC/LP199985-5|UmlsVocabulary
LNC/LP29948-4|LNC/LP29948-4|UmlsVocabulary
LNC/MTHU011970|LNC/MTHU011970|UmlsVocabulary
MSH/D035002|MSH/D035002|UmlsVocabulary
MTH/U003308|MTH/U003308|UmlsVocabulary
NCI/C12742|NCI/C12742|UmlsVocabulary
NCI/C77625|NCI/C77625|UmlsVocabulary
FMA/61681|FMA/61681|UmlsVocabulary
LNC/LA22230-9|LNC/LA22230-9|UmlsVocabulary
MSH/D008161|MSH/D008161|UmlsVocabulary
NCI/C34004|NCI/C34004|UmlsVocabulary
LNC/LA24328-9|LNC/LA24328-9|UmlsVocabulary
LNC/LP206549-0|LNC/LP206549-0|UmlsVocabulary
LNC/LP206574-8|LNC/LP206574-8|UmlsVocabulary
LNC/LP6406-5|LNC/LP6406-5|UmlsVocabulary
MEDLINEPLUS/3953|MEDLINEPLUS/3953|UmlsVocabulary
MSH/D008279|MSH/D008279|UmlsVocabulary
NCI/C16809|NCI/C16809|UmlsVocabulary
LNC/LA14339-8|LNC/LA14339-8|UmlsVocabulary
LNC/LP16198-1|LNC/LP16198-1|UmlsVocabulary
LNC/MTHU005020|LNC/MTHU005020|UmlsVocabulary
MSH/D008727|MSH/D008727|UmlsVocabulary
NCI/C642|NCI/C642|UmlsVocabulary
RXNORM/6851|RXNORM/6851|UmlsVocabulary
VANDF/4019828|VANDF/4019828|UmlsVocabulary
LNC/LP89863-2|LNC/LP89863-2|UmlsVocabulary
LNC/MTHU031584|LNC/MTHU031584|UmlsVocabulary
MSH/D000339|MSH/D000339|UmlsVocabulary
NCI/C72883|NCI/C72883|UmlsVocabulary
MSH/D009048|MSH/D009048|UmlsVocabulary
LNC/LP96286-7|LNC/LP96286-7|UmlsVocabulary
LNC/MTHU034767|LNC/MTHU034767|UmlsVocabulary
MSH/D009068|MSH/D009068|UmlsVocabulary
NCI/C37994|NCI/C37994|UmlsVocabulary
OMIM/MTHU000756|OMIM/MTHU000756|UmlsVocabulary
LNC/LP199993-9|LNC/LP199993-9|UmlsVocabulary
LNC/LP32940-6|LNC/LP32940-6|UmlsVocabulary
LNC/LP33444-8|LNC/LP33444-8|UmlsVocabulary
LNC/MTHU016812|LNC/MTHU016812|UmlsVocabulary
MSH/D009132|MSH/D009132|UmlsVocabulary
NCI/C12435|NCI/C12435|UmlsVocabulary
HPO/HP:0002018|HPO/HP:0002018|UmlsVocabulary
LNC/LA15098-9|LNC/LA15098-9|UmlsVocabulary
LNC/LP36327-2|LNC/LP36327-2|UmlsVocabulary
LNC/MTHU013524|LNC/MTHU013524|UmlsVocabulary
MSH/D009325|MSH/D009325|UmlsVocabulary
NCI/C3258|NCI/C3258|UmlsVocabulary
OMIM/MTHU002455|OMIM/MTHU002455|UmlsVocabulary
LNC/LA9467-7|LNC/LA9467-7|UmlsVocabulary
LNC/LP200049-7|LNC/LP200049-7|UmlsVocabulary
MSH/D009407|MSH/D009407|UmlsVocabulary
NCI/C21072|NCI/C21072|UmlsVocabulary
HPO/HP:0030166|HPO/HP:0030166|UmlsVocabulary
LNC/LP75171-6|LNC/LP75171-6|UmlsVocabulary
LNC/MTHU013525|LNC/MTHU013525|UmlsVocabulary
NCI/C3279|NCI/C3279|UmlsVocabulary
OMIM/MTHU071582|OMIM/MTHU071582|UmlsVocabulary
LNC/LA30857-9|LNC/LA30857-9|UmlsVocabulary
NCI/C34857|NCI/C34857|UmlsVocabulary
OMIM/MTHU008008|OMIM/MTHU008008|UmlsVocabulary
FMA/67325|FMA/67325|UmlsVocabulary
MSH/D009778|MSH/D009778|UmlsVocabulary
MTH/U002117|MTH/U002117|UmlsVocabulary
NCI/C12355|NCI/C12355|UmlsVocabulary
HPO/HP:0033681|HPO/HP:0033681|UmlsVocabulary
MSH/D009837|MSH/D009837|UmlsVocabulary
NCI/C129319|NCI/C129319|UmlsVocabulary
OMIM/137800|OMIM/137800|UmlsVocabulary
OMIM/MTHU022890|OMIM/MTHU022890|UmlsVocabulary
OMIM/MTHU036793|OMIM/MTHU036793|UmlsVocabulary
FMA/58634|FMA/58634|UmlsVocabulary
FMA/58711|FMA/58711|UmlsVocabulary
MSH/D009898|MSH/D009898|UmlsVocabulary
NCI/C12760|NCI/C12760|UmlsVocabulary
MSH/D000773|MSH/D000773|UmlsVocabulary
HPO/HP:0003401|HPO/HP:0003401|UmlsVocabulary
LNC/LP202889-4|LNC/LP202889-4|UmlsVocabulary
LNC/MTHU051473|LNC/MTHU051473|UmlsVocabulary
MSH/D010292|MSH/D010292|UmlsVocabulary
MTH/556|MTH/556|UmlsVocabulary
NCI/C28177|NCI/C28177|UmlsVocabulary
OMIM/MTHU005827|OMIM/MTHU005827|UmlsVocabulary
OMIM/MTHU016055|OMIM/MTHU016055|UmlsVocabulary
OMIM/MTHU016084|OMIM/MTHU016084|UmlsVocabulary
FMA/61826|FMA/61826|UmlsVocabulary
MSH/D010296|MSH/D010296|UmlsVocabulary
MTH/U002145|MTH/U002145|UmlsVocabulary
NCI/C12354|NCI/C12354|UmlsVocabulary
MSH/D010314|MSH/D010314|UmlsVocabulary
MTH/U000019|MTH/U000019|UmlsVocabulary
MTH/U000082|MTH/U000082|UmlsVocabulary
MTH/U000083|MTH/U000083|UmlsVocabulary
MTH/U000084|MTH/U000084|UmlsVocabulary
NCI/C38462|NCI/C38462|UmlsVocabulary
FMA/24485|FMA/24485|UmlsVocabulary
LNC/LA16748-8|LNC/LA16748-8|UmlsVocabulary
LNC/LP221451-0|LNC/LP221451-0|UmlsVocabulary
LNC/LP30162-9|LNC/LP30162-9|UmlsVocabulary
LNC/LP30539-8|LNC/LP30539-8|UmlsVocabulary
LNC/MTHU014782|LNC/MTHU014782|UmlsVocabulary
LNC/MTHU053776|LNC/MTHU053776|UmlsVocabulary
MSH/D010329|MSH/D010329|UmlsVocabulary
NCI/C33282|NCI/C33282|UmlsVocabulary
MSH/D010465|MSH/D010465|UmlsVocabulary
NCI/C16967|NCI/C16967|UmlsVocabulary
LNC/LP14931-7|LNC/LP14931-7|UmlsVocabulary
LNC/MTHU002192|LNC/MTHU002192|UmlsVocabulary
MSH/D010984|MSH/D010984|UmlsVocabulary
MTH/U000086|MTH/U000086|UmlsVocabulary
NCI/C376|NCI/C376|UmlsVocabulary
NCI/C756|NCI/C756|UmlsVocabulary
RXNORM/1311280|RXNORM/1311280|UmlsVocabulary
HPO/HP:0033840|HPO/HP:0033840|UmlsVocabulary
ICD9CM/627.1|ICD9CM/627.1|UmlsVocabulary
NCI/C34937|NCI/C34937|UmlsVocabulary
LNC/LP18109-6|LNC/LP18109-6|UmlsVocabulary
LNC/MTHU062944|LNC/MTHU062944|UmlsVocabulary
MSH/D011241|MSH/D011241|UmlsVocabulary
NCI/C770|NCI/C770|UmlsVocabulary
RXNORM/8640|RXNORM/8640|UmlsVocabulary
VANDF/4017876|VANDF/4017876|UmlsVocabulary
MSH/D011517|MSH/D011517|UmlsVocabulary
MTH/U000023|MTH/U000023|UmlsVocabulary
NCI/C62656|NCI/C62656|UmlsVocabulary
LNC/LP263781-9|LNC/LP263781-9|UmlsVocabulary
MSH/D011677|MSH/D011677|UmlsVocabulary
MTH/U003461|MTH/U003461|UmlsVocabulary
FMA/58252|FMA/58252|UmlsVocabulary
LNC/LP30546-3|LNC/LP30546-3|UmlsVocabulary
LNC/MTHU015063|LNC/MTHU015063|UmlsVocabulary
MSH/D011680|MSH/D011680|UmlsVocabulary
NCI/C33429|NCI/C33429|UmlsVocabulary
MSH/D012018|MSH/D012018|UmlsVocabulary
MTH/U003465|MTH/U003465|UmlsVocabulary
NCI/C78342|NCI/C78342|UmlsVocabulary
HPO/HP:0001250|HPO/HP:0001250|UmlsVocabulary
LNC/LA15899-0|LNC/LA15899-0|UmlsVocabulary
LNC/LA7472-9|LNC/LA7472-9|UmlsVocabulary
MEDLINEPLUS/396|MEDLINEPLUS/396|UmlsVocabulary
MSH/D012640|MSH/D012640|UmlsVocabulary
MTH/673|MTH/673|UmlsVocabulary
NCI/C2962|NCI/C2962|UmlsVocabulary
OMIM/MTHU000242|OMIM/MTHU000242|UmlsVocabulary
OMIM/MTHU004223|OMIM/MTHU004223|UmlsVocabulary
GO/GO:0007600|GO/GO:0007600|UmlsVocabulary
LNC/LP34365-4|LNC/LP34365-4|UmlsVocabulary
LNC/MTHU017277|LNC/MTHU017277|UmlsVocabulary
MSH/D012677|MSH/D012677|UmlsVocabulary
MTH/527|MTH/527|UmlsVocabulary
MTH/U003464|MTH/U003464|UmlsVocabulary
MSH/D012683|MSH/D012683|UmlsVocabulary
LNC/LP74327-5|LNC/LP74327-5|UmlsVocabulary
LNC/MTHU008384|LNC/MTHU008384|UmlsVocabulary
MSH/D012698|MSH/D012698|UmlsVocabulary
HPO/HP:0000246|HPO/HP:0000246|UmlsVocabulary
MEDLINEPLUS/404|MEDLINEPLUS/404|UmlsVocabulary
MSH/D012852|MSH/D012852|UmlsVocabulary
NCI/C35024|NCI/C35024|UmlsVocabulary
OMIM/MTHU006260|OMIM/MTHU006260|UmlsVocabulary
LNC/LP121781-1|LNC/LP121781-1|UmlsVocabulary
LNC/LP251050-3|LNC/LP251050-3|UmlsVocabulary
LNC/MTHU039958|LNC/MTHU039958|UmlsVocabulary
MSH/D013060|MSH/D013060|UmlsVocabulary
NCI/C38025|NCI/C38025|UmlsVocabulary
MSH/D015524|MSH/D015524|UmlsVocabulary
NCI/C35031|NCI/C35031|UmlsVocabulary
HPO/HP:0001297|HPO/HP:0001297|UmlsVocabulary
LNC/LA22099-8|LNC/LA22099-8|UmlsVocabulary
LNC/LA22244-0|LNC/LA22244-0|UmlsVocabulary
LNC/LA9553-4|LNC/LA9553-4|UmlsVocabulary
LNC/LP74605-4|LNC/LP74605-4|UmlsVocabulary
LNC/MTHU020801|LNC/MTHU020801|UmlsVocabulary
MEDLINEPLUS/8|MEDLINEPLUS/8|UmlsVocabulary
MSH/D020521|MSH/D020521|UmlsVocabulary
MTH/U001797|MTH/U001797|UmlsVocabulary
NCI/C3390|NCI/C3390|UmlsVocabulary
OMIM/601367|OMIM/601367|UmlsVocabulary
OMIM/MTHU008085|OMIM/MTHU008085|UmlsVocabulary
OMIM/MTHU009877|OMIM/MTHU009877|UmlsVocabulary
OMIM/MTHU010049|OMIM/MTHU010049|UmlsVocabulary
OMIM/MTHU012420|OMIM/MTHU012420|UmlsVocabulary
OMIM/MTHU036565|OMIM/MTHU036565|UmlsVocabulary
OMIM/MTHU072910|OMIM/MTHU072910|UmlsVocabulary
ICD9CM/05.31|ICD9CM/05.31|UmlsVocabulary
MSH/D001340|MSH/D001340|UmlsVocabulary
NCI/C21110|NCI/C21110|UmlsVocabulary
LNC/LA21908-1|LNC/LA21908-1|UmlsVocabulary
LNC/LP136501-6|LNC/LP136501-6|UmlsVocabulary
MSH/D013607|MSH/D013607|UmlsVocabulary
NCI/C42998|NCI/C42998|UmlsVocabulary
VANDF/4024284|VANDF/4024284|UmlsVocabulary
LNC/LP15886-2|LNC/LP15886-2|UmlsVocabulary
LNC/LP31688-2|LNC/LP31688-2|UmlsVocabulary
LNC/MTHU008943|LNC/MTHU008943|UmlsVocabulary
MSH/D013831|MSH/D013831|UmlsVocabulary
NCI/C874|NCI/C874|UmlsVocabulary
RXNORM/10454|RXNORM/10454|UmlsVocabulary
VANDF/4017474|VANDF/4017474|UmlsVocabulary
VANDF/4017777|VANDF/4017777|UmlsVocabulary
LNC/LA31131-8|LNC/LA31131-8|UmlsVocabulary
MSH/D062789|MSH/D062789|UmlsVocabulary
NCI/C891|NCI/C891|UmlsVocabulary
VANDF/4017291|VANDF/4017291|UmlsVocabulary
VANDF/4024446|VANDF/4024446|UmlsVocabulary
LNC/LP32744-2|LNC/LP32744-2|UmlsVocabulary
LNC/LP74376-2|LNC/LP74376-2|UmlsVocabulary
LNC/LP7851-1|LNC/LP7851-1|UmlsVocabulary
LNC/MTHU000144|LNC/MTHU000144|UmlsVocabulary
LNC/MTHU008386|LNC/MTHU008386|UmlsVocabulary
MEDLINEPLUS/6355|MEDLINEPLUS/6355|UmlsVocabulary
MSH/D016482|MSH/D016482|UmlsVocabulary
MTH/U000062|MTH/U000062|UmlsVocabulary
NCI/C17241|NCI/C17241|UmlsVocabulary
ICD9CM/95.05|ICD9CM/95.05|UmlsVocabulary
MSH/D058609|MSH/D058609|UmlsVocabulary
HPO/HP:0002013|HPO/HP:0002013|UmlsVocabulary
LNC/LA15099-7|LNC/LA15099-7|UmlsVocabulary
LNC/LP75864-6|LNC/LP75864-6|UmlsVocabulary
LNC/MTHU013530|LNC/MTHU013530|UmlsVocabulary
MEDLINEPLUS/489|MEDLINEPLUS/489|UmlsVocabulary
MSH/D014839|MSH/D014839|UmlsVocabulary
NCI/C3442|NCI/C3442|UmlsVocabulary
OMIM/MTHU000225|OMIM/MTHU000225|UmlsVocabulary
LNC/LA10117-2|LNC/LA10117-2|UmlsVocabulary
MSH/D014853|MSH/D014853|UmlsVocabulary
FMA/24922|FMA/24922|UmlsVocabulary
LNC/LP221474-2|LNC/LP221474-2|UmlsVocabulary
LNC/LP7733-1|LNC/LP7733-1|UmlsVocabulary
LNC/MTHU002691|LNC/MTHU002691|UmlsVocabulary
MSH/D014953|MSH/D014953|UmlsVocabulary
NCI/C111033|NCI/C111033|UmlsVocabulary
MSH/C025417|MSH/C025417|UmlsVocabulary
NCI/C156702|NCI/C156702|UmlsVocabulary
MSH/C034368|MSH/C034368|UmlsVocabulary
HPO/HP:0025143|HPO/HP:0025143|UmlsVocabulary
LNC/LA30863-7|LNC/LA30863-7|UmlsVocabulary
LNC/LP74618-7|LNC/LP74618-7|UmlsVocabulary
LNC/MTHU013512|LNC/MTHU013512|UmlsVocabulary
MSH/D023341|MSH/D023341|UmlsVocabulary
NCI/C35143|NCI/C35143|UmlsVocabulary
HPO/HP:0000613|HPO/HP:0000613|UmlsVocabulary
LNC/LA15103-7|LNC/LA15103-7|UmlsVocabulary
LNC/LA24849-4|LNC/LA24849-4|UmlsVocabulary
MSH/D020795|MSH/D020795|UmlsVocabulary
NCI/C28210|NCI/C28210|UmlsVocabulary
OMIM/MTHU036378|OMIM/MTHU036378|UmlsVocabulary
ICD9CM/710.4|ICD9CM/710.4|UmlsVocabulary
MSH/D017285|MSH/D017285|UmlsVocabulary
NCI/C26925|NCI/C26925|UmlsVocabulary
OMIM/MTHU037341|OMIM/MTHU037341|UmlsVocabulary
LNC/LP15505-8|LNC/LP15505-8|UmlsVocabulary
LNC/LP268966-1|LNC/LP268966-1|UmlsVocabulary
LNC/MTHU004913|LNC/MTHU004913|UmlsVocabulary
LNC/MTHU005166|LNC/MTHU005166|UmlsVocabulary
MSH/D014805|MSH/D014805|UmlsVocabulary
NCI/C939|NCI/C939|UmlsVocabulary
RXNORM/42604|RXNORM/42604|UmlsVocabulary
VANDF/4017907|VANDF/4017907|UmlsVocabulary
MSH/D006515|MSH/D006515|UmlsVocabulary
LNC/LA28141-2|LNC/LA28141-2|UmlsVocabulary
LNC/LA29718-6|LNC/LA29718-6|UmlsVocabulary
LNC/LP99406-8|LNC/LP99406-8|UmlsVocabulary
LNC/MTHU035698|LNC/MTHU035698|UmlsVocabulary
MSH/D013287|MSH/D013287|UmlsVocabulary
LNC/LP31694-0|LNC/LP31694-0|UmlsVocabulary
MSH/D025101|MSH/D025101|UmlsVocabulary
NCI/C1334|NCI/C1334|UmlsVocabulary
RXNORM/42954|RXNORM/42954|UmlsVocabulary
VANDF/4017779|VANDF/4017779|UmlsVocabulary
HPO/HP:0002625|HPO/HP:0002625|UmlsVocabulary
LNC/LA7425-7|LNC/LA7425-7|UmlsVocabulary
LNC/LP266848-3|LNC/LP266848-3|UmlsVocabulary
LNC/LP74706-0|LNC/LP74706-0|UmlsVocabulary
LNC/MTHU020788|LNC/MTHU020788|UmlsVocabulary
MEDLINEPLUS/1683|MEDLINEPLUS/1683|UmlsVocabulary
MSH/D020246|MSH/D020246|UmlsVocabulary
NCI/C49343|NCI/C49343|UmlsVocabulary
OMIM/MTHU015932|OMIM/MTHU015932|UmlsVocabulary
OMIM/MTHU019524|OMIM/MTHU019524|UmlsVocabulary
FMA/61903|FMA/61903|UmlsVocabulary
MSH/D056228|MSH/D056228|UmlsVocabulary
LNC/LA14524-5|LNC/LA14524-5|UmlsVocabulary
LNC/LA19798-0|LNC/LA19798-0|UmlsVocabulary
LNC/LP74053-7|LNC/LP74053-7|UmlsVocabulary
LNC/LP7798-4|LNC/LP7798-4|UmlsVocabulary
LNC/MTHU000074|LNC/MTHU000074|UmlsVocabulary
LNC/MTHU008378|LNC/MTHU008378|UmlsVocabulary
NCI/C15413|NCI/C15413|UmlsVocabulary
LNC/LP30786-5|LNC/LP30786-5|UmlsVocabulary
LNC/LP74091-7|LNC/LP74091-7|UmlsVocabulary
LNC/MTHU008379|LNC/MTHU008379|UmlsVocabulary
MTH/U002917|MTH/U002917|UmlsVocabulary
FMA/74529|FMA/74529|UmlsVocabulary
FMA/74536|FMA/74536|UmlsVocabulary
LNC/LP266855-8|LNC/LP266855-8|UmlsVocabulary
NCI/C161325|NCI/C161325|UmlsVocabulary
LNC/LA12748-2|LNC/LA12748-2|UmlsVocabulary
NCI/C25401|NCI/C25401|UmlsVocabulary
NCI/C3824|NCI/C3824|UmlsVocabulary
FMA/38485|FMA/38485|UmlsVocabulary
LNC/LP30511-7|LNC/LP30511-7|UmlsVocabulary
LNC/MTHU014781|LNC/MTHU014781|UmlsVocabulary
NCI/C150849|NCI/C150849|UmlsVocabulary
FMA/61817|FMA/61817|UmlsVocabulary
MSH/D054022|MSH/D054022|UmlsVocabulary
NCI/C12351|NCI/C12351|UmlsVocabulary
FMA/83727|FMA/83727|UmlsVocabulary
NCI/C33005|NCI/C33005|UmlsVocabulary
FMA/77801|FMA/77801|UmlsVocabulary
NCI/C32615|NCI/C32615|UmlsVocabulary
FMA/76925|FMA/76925|UmlsVocabulary
NCI/C32726|NCI/C32726|UmlsVocabulary
LNC/LP29949-2|LNC/LP29949-2|UmlsVocabulary
LNC/MTHU012599|LNC/MTHU012599|UmlsVocabulary
HPO/HP:0004396|HPO/HP:0004396|UmlsVocabulary
LNC/LP121703-5|LNC/LP121703-5|UmlsVocabulary
LNC/MTHU039885|LNC/MTHU039885|UmlsVocabulary
OMIM/MTHU004224|OMIM/MTHU004224|UmlsVocabulary
OMIM/MTHU014773|OMIM/MTHU014773|UmlsVocabulary
LNC/LP207344-5|LNC/LP207344-5|UmlsVocabulary
LNC/LP30529-9|LNC/LP30529-9|UmlsVocabulary
LNC/MTHU015052|LNC/MTHU015052|UmlsVocabulary
MSH/D001072|MSH/D001072|UmlsVocabulary
MSH/D001219|MSH/D001219|UmlsVocabulary
MTH/U000327|MTH/U000327|UmlsVocabulary
NCI/C25202|NCI/C25202|UmlsVocabulary
HPO/HP:0030516|HPO/HP:0030516|UmlsVocabulary
ICD9CM/368.46|ICD9CM/368.46|UmlsVocabulary
MSH/D006423|MSH/D006423|UmlsVocabulary
LNC/LA26030-9|LNC/LA26030-9|UmlsVocabulary
NCI/C25754|NCI/C25754|UmlsVocabulary
MSH/D006261|MSH/D006261|UmlsVocabulary
OMIM/MTHU001298|OMIM/MTHU001298|UmlsVocabulary
OMIM/MTHU012550|OMIM/MTHU012550|UmlsVocabulary
GO/GO:0060004|GO/GO:0060004|UmlsVocabulary
MTH/U002855|MTH/U002855|UmlsVocabulary
LNC/LA9204-4|LNC/LA9204-4|UmlsVocabulary
NCI/C71482|NCI/C71482|UmlsVocabulary
ICD9CM/E929.0|ICD9CM/E929.0|UmlsVocabulary
HPO/HP:0002311|HPO/HP:0002311|UmlsVocabulary
ICD9CM/781.3|ICD9CM/781.3|UmlsVocabulary
OMIM/MTHU000948|OMIM/MTHU000948|UmlsVocabulary
OMIM/MTHU005124|OMIM/MTHU005124|UmlsVocabulary
OMIM/MTHU008070|OMIM/MTHU008070|UmlsVocabulary
OMIM/MTHU008853|OMIM/MTHU008853|UmlsVocabulary
OMIM/MTHU061012|OMIM/MTHU061012|UmlsVocabulary
OMIM/MTHU064975|OMIM/MTHU064975|UmlsVocabulary
LNC/LA31814-9|LNC/LA31814-9|UmlsVocabulary
LNC/LA7458-8|LNC/LA7458-8|UmlsVocabulary
MSH/D009461|MSH/D009461|UmlsVocabulary
NCI/C116600|NCI/C116600|UmlsVocabulary
OMIM/MTHU024651|OMIM/MTHU024651|UmlsVocabulary
OMIM/MTHU041954|OMIM/MTHU041954|UmlsVocabulary
MSH/C103292|MSH/C103292|UmlsVocabulary
FMA/37670|FMA/37670|UmlsVocabulary
LNC/LP30510-9|LNC/LP30510-9|UmlsVocabulary
LNC/MTHU014778|LNC/MTHU014778|UmlsVocabulary
NCI/C32200|NCI/C32200|UmlsVocabulary
NCI/C25305|NCI/C25305|UmlsVocabulary
MSH/D011899|MSH/D011899|UmlsVocabulary
NCI/C66506|NCI/C66506|UmlsVocabulary
RXNORM/152523|RXNORM/152523|UmlsVocabulary
FMA/83929|FMA/83929|UmlsVocabulary
MSH/D066127|MSH/D066127|UmlsVocabulary
NCI/C33892|NCI/C33892|UmlsVocabulary
NCI/C167441|NCI/C167441|UmlsVocabulary
OMIM/MTHU057264|OMIM/MTHU057264|UmlsVocabulary
MSH/D014859|MSH/D014859|UmlsVocabulary
NCI/C1658|NCI/C1658|UmlsVocabulary
RXNORM/202421|RXNORM/202421|UmlsVocabulary
MSH/D006886|MSH/D006886|UmlsVocabulary
NCI/C29101|NCI/C29101|UmlsVocabulary
RXNORM/202462|RXNORM/202462|UmlsVocabulary
MSH/D001379|MSH/D001379|UmlsVocabulary
NCI/C47961|NCI/C47961|UmlsVocabulary
RXNORM/202559|RXNORM/202559|UmlsVocabulary
LNC/LA14335-6|LNC/LA14335-6|UmlsVocabulary
MSH/D003520|MSH/D003520|UmlsVocabulary
MSH/D010672|MSH/D010672|UmlsVocabulary
NCI/C48011|NCI/C48011|UmlsVocabulary
RXNORM/202740|RXNORM/202740|UmlsVocabulary
MSH/D017258|MSH/D017258|UmlsVocabulary
NCI/C1155|NCI/C1155|UmlsVocabulary
RXNORM/202888|RXNORM/202888|UmlsVocabulary
MSH/D004966|MSH/D004966|UmlsVocabulary
NCI/C482|NCI/C482|UmlsVocabulary
RXNORM/202896|RXNORM/202896|UmlsVocabulary
ICD9CM/288.65|ICD9CM/288.65|UmlsVocabulary
MSH/D015773|MSH/D015773|UmlsVocabulary
NCI/C468|NCI/C468|UmlsVocabulary
RXNORM/224921|RXNORM/224921|UmlsVocabulary
NCI/C3288|NCI/C3288|UmlsVocabulary
HPO/HP:0002183|HPO/HP:0002183|UmlsVocabulary
MSH/D012001|MSH/D012001|UmlsVocabulary
NCI/C122579|NCI/C122579|UmlsVocabulary
OMIM/MTHU003238|OMIM/MTHU003238|UmlsVocabulary
HPO/HP:0031807|HPO/HP:0031807|UmlsVocabulary
NCI/C34414|NCI/C34414|UmlsVocabulary
HPO/HP:0011096|HPO/HP:0011096|UmlsVocabulary
MSH/C411282|MSH/C411282|UmlsVocabulary
LNC/LA9478-4|LNC/LA9478-4|UmlsVocabulary
MSH/D024803|MSH/D024803|UmlsVocabulary
FMA/7183|FMA/7183|UmlsVocabulary
LNC/LA18113-3|LNC/LA18113-3|UmlsVocabulary
LNC/LA30845-4|LNC/LA30845-4|UmlsVocabulary
LNC/LP200031-5|LNC/LP200031-5|UmlsVocabulary
LNC/LP29957-5|LNC/LP29957-5|UmlsVocabulary
LNC/MTHU011974|LNC/MTHU011974|UmlsVocabulary
MSH/D034941|MSH/D034941|UmlsVocabulary
NCI/C12671|NCI/C12671|UmlsVocabulary
FMA/63503|FMA/63503|UmlsVocabulary
FMA/63504|FMA/63504|UmlsVocabulary
FMA/74525|FMA/74525|UmlsVocabulary
NCI/C161326|NCI/C161326|UmlsVocabulary
HPO/HP:0001824|HPO/HP:0001824|UmlsVocabulary
HPO/HP:0004325|HPO/HP:0004325|UmlsVocabulary
ICD9CM/783.21|ICD9CM/783.21|UmlsVocabulary
LNC/LP75884-4|LNC/LP75884-4|UmlsVocabulary
LNC/MTHU020881|LNC/MTHU020881|UmlsVocabulary
MSH/D015431|MSH/D015431|UmlsVocabulary
NCI/C3445|NCI/C3445|UmlsVocabulary
OMIM/MTHU004026|OMIM/MTHU004026|UmlsVocabulary
OMIM/MTHU005164|OMIM/MTHU005164|UmlsVocabulary
OMIM/MTHU012809|OMIM/MTHU012809|UmlsVocabulary
OMIM/MTHU072943|OMIM/MTHU072943|UmlsVocabulary
NCI/C73432|NCI/C73432|UmlsVocabulary
FMA/321842|FMA/321842|UmlsVocabulary
MSH/D014955|MSH/D014955|UmlsVocabulary
NCI/C33894|NCI/C33894|UmlsVocabulary
HGNC/HGNC:1836|HGNC/HGNC:1836|UmlsVocabulary
NCI/C28532|NCI/C28532|UmlsVocabulary
OMIM/600749|OMIM/600749|UmlsVocabulary
HGNC/HGNC:2469|HGNC/HGNC:2469|UmlsVocabulary
OMIM/123876|OMIM/123876|UmlsVocabulary
HGNC/HGNC:3467|HGNC/HGNC:3467|UmlsVocabulary
NCI/C38349|NCI/C38349|UmlsVocabulary
OMIM/133430|OMIM/133430|UmlsVocabulary
HGNC/HGNC:4432|HGNC/HGNC:4432|UmlsVocabulary
NCI/C38499|NCI/C38499|UmlsVocabulary
OMIM/138180|OMIM/138180|UmlsVocabulary
HGNC/HGNC:9689|HGNC/HGNC:9689|UmlsVocabulary
OMIM/612719|OMIM/612719|UmlsVocabulary
HGNC/HGNC:10933|HGNC/HGNC:10933|UmlsVocabulary
LNC/LP208425-1|LNC/LP208425-1|UmlsVocabulary
OMIM/604322|OMIM/604322|UmlsVocabulary
NCI/C25246|NCI/C25246|UmlsVocabulary
MSH/D010129|MSH/D010129|UmlsVocabulary
HGNC/HGNC:4818|HGNC/HGNC:4818|UmlsVocabulary
OMIM/601463|OMIM/601463|UmlsVocabulary
LNC/LA11011-6|LNC/LA11011-6|UmlsVocabulary
LNC/LA14960-1|LNC/LA14960-1|UmlsVocabulary
LNC/LA32282-8|LNC/LA32282-8|UmlsVocabulary
LNC/LA66-6|LNC/LA66-6|UmlsVocabulary
NCI/C71686|NCI/C71686|UmlsVocabulary
ICD9CM/780-789.99|ICD9CM/780-789.99|UmlsVocabulary
LNC/LP185406-8|LNC/LP185406-8|UmlsVocabulary
LNC/LP75708-5|LNC/LP75708-5|UmlsVocabulary
LNC/MTHU021540|LNC/MTHU021540|UmlsVocabulary
LNC/MTHU048142|LNC/MTHU048142|UmlsVocabulary
NCI/C4876|NCI/C4876|UmlsVocabulary
NCI/C32727|NCI/C32727|UmlsVocabulary
LNC/LA26053-1|LNC/LA26053-1|UmlsVocabulary
LNC/LA6576-8|LNC/LA6576-8|UmlsVocabulary
NCI/C38758|NCI/C38758|UmlsVocabulary
NCI/C9440|NCI/C9440|UmlsVocabulary
NCI/C52527|NCI/C52527|UmlsVocabulary
NCI/C51574|NCI/C51574|UmlsVocabulary
NCI/C51051|NCI/C51051|UmlsVocabulary
NCI/C50103|NCI/C50103|UmlsVocabulary
LNC/LP200054-7|LNC/LP200054-7|UmlsVocabulary
NCI/C51654|NCI/C51654|UmlsVocabulary
OMIM/MTHU006304|OMIM/MTHU006304|UmlsVocabulary
MSH/C517212|MSH/C517212|UmlsVocabulary
NCI/C25920|NCI/C25920|UmlsVocabulary
OMIM/MTHU002946|OMIM/MTHU002946|UmlsVocabulary
NCI/C62777|NCI/C62777|UmlsVocabulary
FMA/32558|FMA/32558|UmlsVocabulary
LNC/LA30858-7|LNC/LA30858-7|UmlsVocabulary
NCI/C50771|NCI/C50771|UmlsVocabulary
OMIM/MTHU021951|OMIM/MTHU021951|UmlsVocabulary
OMIM/MTHU067008|OMIM/MTHU067008|UmlsVocabulary
MSH/D024505|MSH/D024505|UmlsVocabulary
LNC/52497-5|LNC/52497-5|UmlsVocabulary
NCI/C82853|NCI/C82853|UmlsVocabulary
LNC/LP7653-1|LNC/LP7653-1|UmlsVocabulary
LNC/MTHU014783|LNC/MTHU014783|UmlsVocabulary
NCI/C33812|NCI/C33812|UmlsVocabulary
RXNORM/1305201|RXNORM/1305201|UmlsVocabulary
ICD9CM/799.3|ICD9CM/799.3|UmlsVocabulary
LNC/LP75880-2|LNC/LP75880-2|UmlsVocabulary
LNC/MTHU013531|LNC/MTHU013531|UmlsVocabulary
MSH/D000073496|MSH/D000073496|UmlsVocabulary
NCI/C50809|NCI/C50809|UmlsVocabulary
OMIM/MTHU036428|OMIM/MTHU036428|UmlsVocabulary
OMIM/MTHU037795|OMIM/MTHU037795|UmlsVocabulary
OMIM/MTHU038351|OMIM/MTHU038351|UmlsVocabulary
FMA/55675|FMA/55675|UmlsVocabulary
LNC/LA22164-0|LNC/LA22164-0|UmlsVocabulary
LNC/LA4174-4|LNC/LA4174-4|UmlsVocabulary
LNC/LP422652-0|LNC/LP422652-0|UmlsVocabulary
LNC/MTHU065908|LNC/MTHU065908|UmlsVocabulary
MSH/D002490|MSH/D002490|UmlsVocabulary
NCI/C12438|NCI/C12438|UmlsVocabulary
OMIM/MTHU000058|OMIM/MTHU000058|UmlsVocabulary
LNC/LA14562-5|LNC/LA14562-5|UmlsVocabulary
LNC/LA11844-0|LNC/LA11844-0|UmlsVocabulary
HPO/HP:0001123|HPO/HP:0001123|UmlsVocabulary
ICD9CM/368.4|ICD9CM/368.4|UmlsVocabulary
ICD9CM/368.40|ICD9CM/368.40|UmlsVocabulary
LNC/LP201274-0|LNC/LP201274-0|UmlsVocabulary
LNC/MTHU051243|LNC/MTHU051243|UmlsVocabulary
NCI/C118727|NCI/C118727|UmlsVocabulary
OMIM/MTHU035290|OMIM/MTHU035290|UmlsVocabulary
OMIM/MTHU037111|OMIM/MTHU037111|UmlsVocabulary
OMIM/MTHU039065|OMIM/MTHU039065|UmlsVocabulary
OMIM/MTHU045031|OMIM/MTHU045031|UmlsVocabulary
LNC/LA6745-9|LNC/LA6745-9|UmlsVocabulary
NCI/C121777|NCI/C121777|UmlsVocabulary
LNC/LA25149-8|LNC/LA25149-8|UmlsVocabulary
LNC/LA25148-0|LNC/LA25148-0|UmlsVocabulary
FMA/30316|FMA/30316|UmlsVocabulary
FMA/5022|FMA/5022|UmlsVocabulary
LNC/LA24800-7|LNC/LA24800-7|UmlsVocabulary
LNC/LP234848-2|LNC/LP234848-2|UmlsVocabulary
NCI/C13056|NCI/C13056|UmlsVocabulary
NCI/C125461|NCI/C125461|UmlsVocabulary
OMIM/MTHU052802|OMIM/MTHU052802|UmlsVocabulary
OMIM/MTHU068777|OMIM/MTHU068777|UmlsVocabulary
LNC/LP206620-9|LNC/LP206620-9|UmlsVocabulary
LNC/MTHU051712|LNC/MTHU051712|UmlsVocabulary
HPO/HP:0003651|HPO/HP:0003651|UmlsVocabulary
LNC/LP221488-2|LNC/LP221488-2|UmlsVocabulary
LNC/MTHU053713|LNC/MTHU053713|UmlsVocabulary
LNC/LP220355-4|LNC/LP220355-4|UmlsVocabulary
LNC/LP220356-2|LNC/LP220356-2|UmlsVocabulary
LNC/MTHU054543|LNC/MTHU054543|UmlsVocabulary
NCI/C128235|NCI/C128235|UmlsVocabulary
LNC/LP221473-4|LNC/LP221473-4|UmlsVocabulary
LNC/MTHU053734|LNC/MTHU053734|UmlsVocabulary
LNC/LP221450-2|LNC/LP221450-2|UmlsVocabulary
LNC/MTHU053770|LNC/MTHU053770|UmlsVocabulary
OMIM/MTHU054974|OMIM/MTHU054974|UmlsVocabulary
OMIM/MTHU054858|OMIM/MTHU054858|UmlsVocabulary
NCI/C138177|NCI/C138177|UmlsVocabulary
LNC/LA21963-6|LNC/LA21963-6|UmlsVocabulary
NCI/C146686|NCI/C146686|UmlsVocabulary
OMIM/MTHU060428|OMIM/MTHU060428|UmlsVocabulary
NCI/C150215|NCI/C150215|UmlsVocabulary
NCI/C150217|NCI/C150217|UmlsVocabulary
NCI/C156447|NCI/C156447|UmlsVocabulary
OMIM/MTHU064668|OMIM/MTHU064668|UmlsVocabulary
LNC/LA6115-5|LNC/LA6115-5|UmlsVocabulary
NCI/C160918|NCI/C160918|UmlsVocabulary
NCI/C162076|NCI/C162076|UmlsVocabulary
NCI/C174212|NCI/C174212|UmlsVocabulary
NCI/C170564|NCI/C170564|UmlsVocabulary
NCI/C170797|NCI/C170797|UmlsVocabulary
OMIM/MTHU072954|OMIM/MTHU072954|UmlsVocabulary
LNC/LA15393-4|LNC/LA15393-4|UmlsVocabulary
LNC/LA3911-0|LNC/LA3911-0|UmlsVocabulary
LNC/LP200041-4|LNC/LP200041-4|UmlsVocabulary
LNC/LP68311-7|LNC/LP68311-7|UmlsVocabulary
LNC/MTHU028106|LNC/MTHU028106|UmlsVocabulary
MEDLINEPLUS/5921|MEDLINEPLUS/5921|UmlsVocabulary
MSH/D001706|MSH/D001706|UmlsVocabulary
NCI/C15189|NCI/C15189|UmlsVocabulary
HPO/HP:0003761|HPO/HP:0003761|UmlsVocabulary
MSH/D002114|MSH/D002114|UmlsVocabulary
NCI/C3672|NCI/C3672|UmlsVocabulary
OMIM/MTHU060902|OMIM/MTHU060902|UmlsVocabulary
FMA/50772|FMA/50772|UmlsVocabulary
MSH/D002426|MSH/D002426|UmlsVocabulary
NCI/C12690|NCI/C12690|UmlsVocabulary
MSH/D002459|MSH/D002459|UmlsVocabulary
NCI/C16401|NCI/C16401|UmlsVocabulary
MSH/D015928|MSH/D015928|UmlsVocabulary
NCI/C64345|NCI/C64345|UmlsVocabulary
HPO/HP:0000651|HPO/HP:0000651|UmlsVocabulary
ICD9CM/368.2|ICD9CM/368.2|UmlsVocabulary
LNC/LA15082-3|LNC/LA15082-3|UmlsVocabulary
MSH/D004172|MSH/D004172|UmlsVocabulary
NCI/C37941|NCI/C37941|UmlsVocabulary
OMIM/MTHU000786|OMIM/MTHU000786|UmlsVocabulary
OMIM/MTHU062371|OMIM/MTHU062371|UmlsVocabulary
NCI/C158758|NCI/C158758|UmlsVocabulary
HPO/HP:0000520|HPO/HP:0000520|UmlsVocabulary
ICD9CM/376.30|ICD9CM/376.30|UmlsVocabulary
MSH/D005094|MSH/D005094|UmlsVocabulary
NCI/C118763|NCI/C118763|UmlsVocabulary
NCI/C87114|NCI/C87114|UmlsVocabulary
OMIM/MTHU001173|OMIM/MTHU001173|UmlsVocabulary
OMIM/MTHU004615|OMIM/MTHU004615|UmlsVocabulary
OMIM/MTHU005786|OMIM/MTHU005786|UmlsVocabulary
OMIM/MTHU016288|OMIM/MTHU016288|UmlsVocabulary
OMIM/MTHU019358|OMIM/MTHU019358|UmlsVocabulary
FMA/12513|FMA/12513|UmlsVocabulary
LNC/LA14722-5|LNC/LA14722-5|UmlsVocabulary
LNC/LP117007-7|LNC/LP117007-7|UmlsVocabulary
LNC/LP207778-4|LNC/LP207778-4|UmlsVocabulary
LNC/LP7218-3|LNC/LP7218-3|UmlsVocabulary
LNC/LP7222-5|LNC/LP7222-5|UmlsVocabulary
LNC/LP7797-6|LNC/LP7797-6|UmlsVocabulary
LNC/MTHU000064|LNC/MTHU000064|UmlsVocabulary
LNC/MTHU001409|LNC/MTHU001409|UmlsVocabulary
LNC/MTHU001430|LNC/MTHU001430|UmlsVocabulary
LNC/MTHU038905|LNC/MTHU038905|UmlsVocabulary
MSH/D005123|MSH/D005123|UmlsVocabulary
MTH/U003284|MTH/U003284|UmlsVocabulary
NCI/C12401|NCI/C12401|UmlsVocabulary
OMIM/MTHU000020|OMIM/MTHU000020|UmlsVocabulary
HPO/HP:0002315|HPO/HP:0002315|UmlsVocabulary
ICD9CM/784.0|ICD9CM/784.0|UmlsVocabulary
LNC/LA15854-5|LNC/LA15854-5|UmlsVocabulary
LNC/LA15903-0|LNC/LA15903-0|UmlsVocabulary
LNC/LP217220-5|LNC/LP217220-5|UmlsVocabulary
LNC/LP74908-2|LNC/LP74908-2|UmlsVocabulary
LNC/MTHU020860|LNC/MTHU020860|UmlsVocabulary
LNC/MTHU053651|LNC/MTHU053651|UmlsVocabulary
MEDLINEPLUS/273|MEDLINEPLUS/273|UmlsVocabulary
NCI/C34661|NCI/C34661|UmlsVocabulary
OMIM/MTHU036348|OMIM/MTHU036348|UmlsVocabulary
OMIM/MTHU036635|OMIM/MTHU036635|UmlsVocabulary
HPO/HP:0002858|HPO/HP:0002858|UmlsVocabulary
MSH/D008579|MSH/D008579|UmlsVocabulary
NCI/C3230|NCI/C3230|UmlsVocabulary
OMIM/190040|OMIM/190040|UmlsVocabulary
OMIM/601728|OMIM/601728|UmlsVocabulary
OMIM/MTHU003590|OMIM/MTHU003590|UmlsVocabulary
OMIM/MTHU036996|OMIM/MTHU036996|UmlsVocabulary
HPO/HP:0002664|HPO/HP:0002664|UmlsVocabulary
ICD9CM/140-239.99|ICD9CM/140-239.99|UmlsVocabulary
LNC/LA16304-0|LNC/LA16304-0|UmlsVocabulary
LNC/LP207120-9|LNC/LP207120-9|UmlsVocabulary
LNC/LP7664-8|LNC/LP7664-8|UmlsVocabulary
LNC/MTHU010346|LNC/MTHU010346|UmlsVocabulary
MEDLINEPLUS/25|MEDLINEPLUS/25|UmlsVocabulary
MSH/D009369|MSH/D009369|UmlsVocabulary
MTH/471|MTH/471|UmlsVocabulary
MTH/755|MTH/755|UmlsVocabulary
NCI/C3262|NCI/C3262|UmlsVocabulary
OMIM/MTHU000126|OMIM/MTHU000126|UmlsVocabulary
FMA/50863|FMA/50863|UmlsVocabulary
LNC/LA24828-8|LNC/LA24828-8|UmlsVocabulary
LNC/LP201259-1|LNC/LP201259-1|UmlsVocabulary
MSH/D009900|MSH/D009900|UmlsVocabulary
MTH/U002120|MTH/U002120|UmlsVocabulary
NCI/C12761|NCI/C12761|UmlsVocabulary
MEDLINEPLUS/6427|MEDLINEPLUS/6427|UmlsVocabulary
MSH/D009901|MSH/D009901|UmlsVocabulary
NCI/C79698|NCI/C79698|UmlsVocabulary
HPO/HP:0012531|HPO/HP:0012531|UmlsVocabulary
ICD9CM/338-338.99|ICD9CM/338-338.99|UmlsVocabulary
LNC/LA17107-6|LNC/LA17107-6|UmlsVocabulary
LNC/LA27491-2|LNC/LA27491-2|UmlsVocabulary
LNC/LA7460-4|LNC/LA7460-4|UmlsVocabulary
LNC/LP75331-6|LNC/LP75331-6|UmlsVocabulary
LNC/LP75342-3|LNC/LP75342-3|UmlsVocabulary
LNC/MTHU021175|LNC/MTHU021175|UmlsVocabulary
LNC/MTHU029813|LNC/MTHU029813|UmlsVocabulary
MEDLINEPLUS/351|MEDLINEPLUS/351|UmlsVocabulary
MSH/D010146|MSH/D010146|UmlsVocabulary
MTH/306|MTH/306|UmlsVocabulary
NCI/C25271|NCI/C25271|UmlsVocabulary
NCI/C3303|NCI/C3303|UmlsVocabulary
OMIM/MTHU033713|OMIM/MTHU033713|UmlsVocabulary
FMA/54683|FMA/54683|UmlsVocabulary
MSH/D013101|MSH/D013101|UmlsVocabulary
NCI/C12278|NCI/C12278|UmlsVocabulary
ICD9CM/81.0|ICD9CM/81.0|UmlsVocabulary
ICD9CM/81.00|ICD9CM/81.00|UmlsVocabulary
MSH/D013123|MSH/D013123|UmlsVocabulary
NCI/C157986|NCI/C157986|UmlsVocabulary
LNC/LA24329-7|LNC/LA24329-7|UmlsVocabulary
LNC/LA9477-6|LNC/LA9477-6|UmlsVocabulary
LNC/LP200067-9|LNC/LP200067-9|UmlsVocabulary
LNC/LP6207-7|LNC/LP6207-7|UmlsVocabulary
MEDLINEPLUS/3951|MEDLINEPLUS/3951|UmlsVocabulary
MSH/D014057|MSH/D014057|UmlsVocabulary
NCI/C17204|NCI/C17204|UmlsVocabulary
LNC/LA29720-2|LNC/LA29720-2|UmlsVocabulary
MSH/D001289|MSH/D001289|UmlsVocabulary
OMIM/MTHU004474|OMIM/MTHU004474|UmlsVocabulary
OMIM/MTHU007687|OMIM/MTHU007687|UmlsVocabulary
OMIM/MTHU021250|OMIM/MTHU021250|UmlsVocabulary
OMIM/MTHU033846|OMIM/MTHU033846|UmlsVocabulary
OMIM/MTHU060591|OMIM/MTHU060591|UmlsVocabulary
GO/GO:0007601|GO/GO:0007601|UmlsVocabulary
LNC/LA28160-2|LNC/LA28160-2|UmlsVocabulary
LNC/LP30560-4|LNC/LP30560-4|UmlsVocabulary
LNC/LP75855-4|LNC/LP75855-4|UmlsVocabulary
LNC/MTHU014733|LNC/MTHU014733|UmlsVocabulary
LNC/MTHU051591|LNC/MTHU051591|UmlsVocabulary
MSH/D014785|MSH/D014785|UmlsVocabulary
NCI/C38533|NCI/C38533|UmlsVocabulary
HPO/HP:0030786|HPO/HP:0030786|UmlsVocabulary
LNC/LA16376-8|LNC/LA16376-8|UmlsVocabulary
OMIM/MTHU057995|OMIM/MTHU057995|UmlsVocabulary
OMIM/MTHU072494|OMIM/MTHU072494|UmlsVocabulary
ICD9CM/363.34|ICD9CM/363.34|UmlsVocabulary
ICD9CM/81.01|ICD9CM/81.01|UmlsVocabulary
MSH/C538196|MSH/C538196|UmlsVocabulary
ICD9CM/81.26|ICD9CM/81.26|UmlsVocabulary
ICD9CM/81.25|ICD9CM/81.25|UmlsVocabulary
LNC/LP6782-9|LNC/LP6782-9|UmlsVocabulary
LNC/LP72094-3|LNC/LP72094-3|UmlsVocabulary
LNC/MTHU009059|LNC/MTHU009059|UmlsVocabulary
NCI/C25244|NCI/C25244|UmlsVocabulary
LNC/LA4329-4|LNC/LA4329-4|UmlsVocabulary
LNC/LP208038-2|LNC/LP208038-2|UmlsVocabulary
LNC/LP234850-8|LNC/LP234850-8|UmlsVocabulary
LNC/LP30469-8|LNC/LP30469-8|UmlsVocabulary
NCI/C12471|NCI/C12471|UmlsVocabulary
FMA/54449|FMA/54449|UmlsVocabulary
LNC/LA14703-5|LNC/LA14703-5|UmlsVocabulary
LNC/LA16257-0|LNC/LA16257-0|UmlsVocabulary
LNC/LA18789-0|LNC/LA18789-0|UmlsVocabulary
LNC/LP7220-9|LNC/LP7220-9|UmlsVocabulary
LNC/MTHU013548|LNC/MTHU013548|UmlsVocabulary
NCI/C119333|NCI/C119333|UmlsVocabulary
LNC/LA15091-4|LNC/LA15091-4|UmlsVocabulary
LNC/LA16259-6|LNC/LA16259-6|UmlsVocabulary
LNC/LA18787-4|LNC/LA18787-4|UmlsVocabulary
NCI/C119335|NCI/C119335|UmlsVocabulary
HPO/HP:0002354|HPO/HP:0002354|UmlsVocabulary
LNC/LA56-7|LNC/LA56-7|UmlsVocabulary
LNC/LP36329-8|LNC/LP36329-8|UmlsVocabulary
LNC/MTHU019385|LNC/MTHU019385|UmlsVocabulary
MSH/D008569|MSH/D008569|UmlsVocabulary
NCI/C78444|NCI/C78444|UmlsVocabulary
OMIM/MTHU000534|OMIM/MTHU000534|UmlsVocabulary
OMIM/MTHU003336|OMIM/MTHU003336|UmlsVocabulary
OMIM/MTHU008726|OMIM/MTHU008726|UmlsVocabulary
HPO/HP:0011134|HPO/HP:0011134|UmlsVocabulary
NCI/C35292|NCI/C35292|UmlsVocabulary
LNC/LA15111-0|LNC/LA15111-0|UmlsVocabulary
LNC/LA24637-3|LNC/LA24637-3|UmlsVocabulary
MSH/D001284|MSH/D001284|UmlsVocabulary
NCI/C79748|NCI/C79748|UmlsVocabulary
OMIM/MTHU006850|OMIM/MTHU006850|UmlsVocabulary
HPO/HP:0100543|HPO/HP:0100543|UmlsVocabulary
LNC/LA15213-4|LNC/LA15213-4|UmlsVocabulary
LNC/LP128695-6|LNC/LP128695-6|UmlsVocabulary
LNC/MTHU040636|LNC/MTHU040636|UmlsVocabulary
MSH/D060825|MSH/D060825|UmlsVocabulary
NCI/C116921|NCI/C116921|UmlsVocabulary
NCI/C27101|NCI/C27101|UmlsVocabulary
NCI/C46083|NCI/C46083|UmlsVocabulary
OMIM/MTHU003329|OMIM/MTHU003329|UmlsVocabulary
OMIM/MTHU003399|OMIM/MTHU003399|UmlsVocabulary
OMIM/MTHU004473|OMIM/MTHU004473|UmlsVocabulary
OMIM/MTHU004914|OMIM/MTHU004914|UmlsVocabulary
OMIM/MTHU012485|OMIM/MTHU012485|UmlsVocabulary
OMIM/MTHU018589|OMIM/MTHU018589|UmlsVocabulary
OMIM/MTHU067784|OMIM/MTHU067784|UmlsVocabulary
HPO/HP:0000622|HPO/HP:0000622|UmlsVocabulary
LNC/LA15105-2|LNC/LA15105-2|UmlsVocabulary
NCI/C27123|NCI/C27123|UmlsVocabulary
OMIM/MTHU000785|OMIM/MTHU000785|UmlsVocabulary
HPO/HP:0000575|HPO/HP:0000575|UmlsVocabulary
LNC/LP15428-3|LNC/LP15428-3|UmlsVocabulary
LNC/MTHU008590|LNC/MTHU008590|UmlsVocabulary
NCI/C116552|NCI/C116552|UmlsVocabulary
FMA/302850|FMA/302850|UmlsVocabulary
FMA/302856|FMA/302856|UmlsVocabulary
FMA/54774|FMA/54774|UmlsVocabulary
LNC/LP230199-4|LNC/LP230199-4|UmlsVocabulary
LNC/LP30143-9|LNC/LP30143-9|UmlsVocabulary
LNC/MTHU053775|LNC/MTHU053775|UmlsVocabulary
HPO/HP:0000618|HPO/HP:0000618|UmlsVocabulary
LNC/LA17710-7|LNC/LA17710-7|UmlsVocabulary
MSH/D001766|MSH/D001766|UmlsVocabulary
NCI/C97109|NCI/C97109|UmlsVocabulary
OMIM/MTHU001370|OMIM/MTHU001370|UmlsVocabulary
HPO/HP:0000543|HPO/HP:0000543|UmlsVocabulary
OMIM/MTHU000685|OMIM/MTHU000685|UmlsVocabulary
OMIM/MTHU008076|OMIM/MTHU008076|UmlsVocabulary
OMIM/MTHU011096|OMIM/MTHU011096|UmlsVocabulary
OMIM/MTHU013743|OMIM/MTHU013743|UmlsVocabulary
OMIM/MTHU030342|OMIM/MTHU030342|UmlsVocabulary
OMIM/MTHU036072|OMIM/MTHU036072|UmlsVocabulary
OMIM/MTHU051310|OMIM/MTHU051310|UmlsVocabulary
OMIM/MTHU069605|OMIM/MTHU069605|UmlsVocabulary
OMIM/MTHU070605|OMIM/MTHU070605|UmlsVocabulary
NCI/C34808|NCI/C34808|UmlsVocabulary
LNC/LP266903-6|LNC/LP266903-6|UmlsVocabulary
NCI/C87143|NCI/C87143|UmlsVocabulary
FMA/54448|FMA/54448|UmlsVocabulary
MTH/U003315|MTH/U003315|UmlsVocabulary
LNC/LA17736-2|LNC/LA17736-2|UmlsVocabulary
LNC/LA8951-1|LNC/LA8951-1|UmlsVocabulary
LNC/LP207803-0|LNC/LP207803-0|UmlsVocabulary
LNC/MTHU052930|LNC/MTHU052930|UmlsVocabulary
NCI/C15232|NCI/C15232|UmlsVocabulary
NCI/C50640|NCI/C50640|UmlsVocabulary
LNC/LP29681-1|LNC/LP29681-1|UmlsVocabulary
LNC/MTHU000073|LNC/MTHU000073|UmlsVocabulary
OMIM/MTHU001863|OMIM/MTHU001863|UmlsVocabulary
OMIM/MTHU006842|OMIM/MTHU006842|UmlsVocabulary
OMIM/MTHU034731|OMIM/MTHU034731|UmlsVocabulary
OMIM/MTHU017793|OMIM/MTHU017793|UmlsVocabulary
MSH/C536916|MSH/C536916|UmlsVocabulary
OMIM/188560|OMIM/188560|UmlsVocabulary
OMIM/MTHU034013|OMIM/MTHU034013|UmlsVocabulary
LNC/54543-4|LNC/54543-4|UmlsVocabulary
OMIM/MTHU025210|OMIM/MTHU025210|UmlsVocabulary
MSH/C567932|MSH/C567932|UmlsVocabulary
OMIM/300000|OMIM/300000|UmlsVocabulary
OMIM/300552|OMIM/300552|UmlsVocabulary
NCI/C98275|NCI/C98275|UmlsVocabulary
MSH/C580095|MSH/C580095|UmlsVocabulary
OMIM/165800|OMIM/165800|UmlsVocabulary
HPO/HP:0001138|HPO/HP:0001138|UmlsVocabulary
NCI/C118711|NCI/C118711|UmlsVocabulary
OMIM/MTHU018978|OMIM/MTHU018978|UmlsVocabulary
GO/GO:0097683|GO/GO:0097683|UmlsVocabulary
LNC/LP207777-6|LNC/LP207777-6|UmlsVocabulary
LNC/MTHU051988|LNC/MTHU051988|UmlsVocabulary
LNC/LP262822-2|LNC/LP262822-2|UmlsVocabulary
LNC/MTHU059899|LNC/MTHU059899|UmlsVocabulary
LNC/LA19268-4|LNC/LA19268-4|UmlsVocabulary
LNC/LP309254-3|LNC/LP309254-3|UmlsVocabulary
LNC/LA7263-2|LNC/LA7263-2|UmlsVocabulary
LNC/LP156501-1|LNC/LP156501-1|UmlsVocabulary
LNC/MTHU044495|LNC/MTHU044495|UmlsVocabulary
NCI/C176714|NCI/C176714|UmlsVocabulary
FMA/50542|FMA/50542|UmlsVocabulary
MSH/D001488|MSH/D001488|UmlsVocabulary
NCI/C12676|NCI/C12676|UmlsVocabulary
FMA/9601|FMA/9601|UmlsVocabulary
LNC/LA4255-1|LNC/LA4255-1|UmlsVocabulary
LNC/LP199961-6|LNC/LP199961-6|UmlsVocabulary
LNC/LP29849-4|LNC/LP29849-4|UmlsVocabulary
LNC/LP7086-4|LNC/LP7086-4|UmlsVocabulary
LNC/MTHU001046|LNC/MTHU001046|UmlsVocabulary
LNC/MTHU011382|LNC/MTHU011382|UmlsVocabulary
MSH/D001940|MSH/D001940|UmlsVocabulary
MTH/U001764|MTH/U001764|UmlsVocabulary
NCI/C12971|NCI/C12971|UmlsVocabulary
NCI/C43595|NCI/C43595|UmlsVocabulary
OMIM/MTHU001433|OMIM/MTHU001433|UmlsVocabulary
FMA/322007|FMA/322007|UmlsVocabulary
LNC/LA24031-9|LNC/LA24031-9|UmlsVocabulary
LNC/LP200345-9|LNC/LP200345-9|UmlsVocabulary
LNC/LP208124-0|LNC/LP208124-0|UmlsVocabulary
LNC/LP230314-9|LNC/LP230314-9|UmlsVocabulary
LNC/LP29872-6|LNC/LP29872-6|UmlsVocabulary
MSH/D002339|MSH/D002339|UmlsVocabulary
NCI/C12687|NCI/C12687|UmlsVocabulary
FMA/275917|FMA/275917|UmlsVocabulary
LNC/LP7130-0|LNC/LP7130-0|UmlsVocabulary
LNC/MTHU024384|LNC/MTHU024384|UmlsVocabulary
MSH/D002552|MSH/D002552|UmlsVocabulary
NCI/C12356|NCI/C12356|UmlsVocabulary
FMA/50454|FMA/50454|UmlsVocabulary
LNC/LP200344-2|LNC/LP200344-2|UmlsVocabulary
LNC/LP33689-8|LNC/LP33689-8|UmlsVocabulary
MSH/D002941|MSH/D002941|UmlsVocabulary
FMA/50762|FMA/50762|UmlsVocabulary
FMA/76590|FMA/76590|UmlsVocabulary
MSH/D003392|MSH/D003392|UmlsVocabulary
NCI/C102627|NCI/C102627|UmlsVocabulary
FMA/7100|FMA/7100|UmlsVocabulary
LNC/LP217238-7|LNC/LP217238-7|UmlsVocabulary
LNC/LP7309-0|LNC/LP7309-0|UmlsVocabulary
LNC/LP7341-3|LNC/LP7341-3|UmlsVocabulary
LNC/MTHU024371|LNC/MTHU024371|UmlsVocabulary
LNC/MTHU024603|LNC/MTHU024603|UmlsVocabulary
MSH/D006352|MSH/D006352|UmlsVocabulary
NCI/C12730|NCI/C12730|UmlsVocabulary
MSH/D009362|MSH/D009362|UmlsVocabulary
NCI/C19151|NCI/C19151|UmlsVocabulary
FMA/13889|FMA/13889|UmlsVocabulary
LNC/LP113983-3|LNC/LP113983-3|UmlsVocabulary
LNC/LP199938-4|LNC/LP199938-4|UmlsVocabulary
MSH/D010902|MSH/D010902|UmlsVocabulary
MTH/U002169|MTH/U002169|UmlsVocabulary
NCI/C12399|NCI/C12399|UmlsVocabulary
FMA/83716|FMA/83716|UmlsVocabulary
MSH/D013346|MSH/D013346|UmlsVocabulary
NCI/C156507|NCI/C156507|UmlsVocabulary
FMA/52737|FMA/52737|UmlsVocabulary
LNC/LP200400-2|LNC/LP200400-2|UmlsVocabulary
LNC/LP200401-0|LNC/LP200401-0|UmlsVocabulary
LNC/LP33447-1|LNC/LP33447-1|UmlsVocabulary
LNC/MTHU040074|LNC/MTHU040074|UmlsVocabulary
LNC/MTHU050888|LNC/MTHU050888|UmlsVocabulary
MSH/D013701|MSH/D013701|UmlsVocabulary
NCI/C12797|NCI/C12797|UmlsVocabulary
FMA/62007|FMA/62007|UmlsVocabulary
MSH/D013788|MSH/D013788|UmlsVocabulary
NCI/C12459|NCI/C12459|UmlsVocabulary
FMA/52801|FMA/52801|UmlsVocabulary
LNC/LP200014-1|LNC/LP200014-1|UmlsVocabulary
LNC/LP33997-5|LNC/LP33997-5|UmlsVocabulary
MSH/D019291|MSH/D019291|UmlsVocabulary
NCI/C12493|NCI/C12493|UmlsVocabulary
FMA/61959|FMA/61959|UmlsVocabulary
MSH/D066271|MSH/D066271|UmlsVocabulary
NCI/C32550|NCI/C32550|UmlsVocabulary
FMA/72515|FMA/72515|UmlsVocabulary
MSH/D065837|MSH/D065837|UmlsVocabulary
FMA/3939|FMA/3939|UmlsVocabulary
MSH/D017536|MSH/D017536|UmlsVocabulary
NCI/C32352|NCI/C32352|UmlsVocabulary
FMA/78464|FMA/78464|UmlsVocabulary
ICD9CM/21.85|ICD9CM/21.85|UmlsVocabulary
ICD9CM/76.68|ICD9CM/76.68|UmlsVocabulary
ICD9CM/85.5|ICD9CM/85.5|UmlsVocabulary
ICD9CM/85.50|ICD9CM/85.50|UmlsVocabulary
NCI/C107225|NCI/C107225|UmlsVocabulary
HPO/HP:0012828|HPO/HP:0012828|UmlsVocabulary
LNC/LA28568-6|LNC/LA28568-6|UmlsVocabulary
LNC/LA32395-8|LNC/LA32395-8|UmlsVocabulary
LNC/LA6750-9|LNC/LA6750-9|UmlsVocabulary
NCI/C14158|NCI/C14158|UmlsVocabulary
NCI/C70667|NCI/C70667|UmlsVocabulary
FMA/52800|FMA/52800|UmlsVocabulary
MSH/D012886|MSH/D012886|UmlsVocabulary
NCI/C81188|NCI/C81188|UmlsVocabulary
FMA/20274|FMA/20274|UmlsVocabulary
NCI/C83196|NCI/C83196|UmlsVocabulary
FMA/323243|FMA/323243|UmlsVocabulary
FMA/323272|FMA/323272|UmlsVocabulary
MSH/D000077502|MSH/D000077502|UmlsVocabulary
FMA/61939|FMA/61939|UmlsVocabulary
FMA/62165|FMA/62165|UmlsVocabulary
MSH/D020646|MSH/D020646|UmlsVocabulary
NCI/C32284|NCI/C32284|UmlsVocabulary
FMA/72244|FMA/72244|UmlsVocabulary
NCI/C12970|NCI/C12970|UmlsVocabulary
FMA/58279|FMA/58279|UmlsVocabulary
NCI/C34119|NCI/C34119|UmlsVocabulary
HPO/HP:0002059|HPO/HP:0002059|UmlsVocabulary
NCI/C98273|NCI/C98273|UmlsVocabulary
OMIM/MTHU000199|OMIM/MTHU000199|UmlsVocabulary
MSH/D012594|MSH/D012594|UmlsVocabulary
NCI/C116780|NCI/C116780|UmlsVocabulary
HPO/HP:0033657|HPO/HP:0033657|UmlsVocabulary
MSH/D017499|MSH/D017499|UmlsVocabulary
OMIM/MTHU048674|OMIM/MTHU048674|UmlsVocabulary
MSH/D059409|MSH/D059409|UmlsVocabulary
OMIM/MTHU066215|OMIM/MTHU066215|UmlsVocabulary
FMA/67990|FMA/67990|UmlsVocabulary
FMA/72004|FMA/72004|UmlsVocabulary
FMA/63193|FMA/63193|UmlsVocabulary
LNC/LA20023-0|LNC/LA20023-0|UmlsVocabulary
NCI/C114132|NCI/C114132|UmlsVocabulary
HPO/HP:0012432|HPO/HP:0012432|UmlsVocabulary
OMIM/MTHU031698|OMIM/MTHU031698|UmlsVocabulary
OMIM/MTHU005168|OMIM/MTHU005168|UmlsVocabulary
HPO/HP:0020038|HPO/HP:0020038|UmlsVocabulary
MSH/D014715|MSH/D014715|UmlsVocabulary
FMA/76875|FMA/76875|UmlsVocabulary
ICD9CM/02.01|ICD9CM/02.01|UmlsVocabulary
NCI/C32389|NCI/C32389|UmlsVocabulary
NCI/C41612|NCI/C41612|UmlsVocabulary
NCI/C38055|NCI/C38055|UmlsVocabulary
HPO/HP:0000926|HPO/HP:0000926|UmlsVocabulary
OMIM/MTHU000585|OMIM/MTHU000585|UmlsVocabulary
OMIM/MTHU001100|OMIM/MTHU001100|UmlsVocabulary
OMIM/MTHU007862|OMIM/MTHU007862|UmlsVocabulary
OMIM/MTHU054255|OMIM/MTHU054255|UmlsVocabulary
OMIM/MTHU008239|OMIM/MTHU008239|UmlsVocabulary
OMIM/MTHU008675|OMIM/MTHU008675|UmlsVocabulary
OMIM/MTHU009829|OMIM/MTHU009829|UmlsVocabulary
HPO/HP:0002529|HPO/HP:0002529|UmlsVocabulary
OMIM/MTHU010666|OMIM/MTHU010666|UmlsVocabulary
OMIM/MTHU018123|OMIM/MTHU018123|UmlsVocabulary
HPO/HP:0012368|HPO/HP:0012368|UmlsVocabulary
OMIM/MTHU000257|OMIM/MTHU000257|UmlsVocabulary
OMIM/MTHU002154|OMIM/MTHU002154|UmlsVocabulary
OMIM/MTHU009599|OMIM/MTHU009599|UmlsVocabulary
OMIM/MTHU040980|OMIM/MTHU040980|UmlsVocabulary
OMIM/MTHU031699|OMIM/MTHU031699|UmlsVocabulary
FMA/82553|FMA/82553|UmlsVocabulary
NCBI/580880|NCBI/580880|UmlsVocabulary
OMIM/MTHU023532|OMIM/MTHU023532|UmlsVocabulary
OMIM/MTHU022249|OMIM/MTHU022249|UmlsVocabulary
MSH/D059345|MSH/D059345|UmlsVocabulary
OMIM/MTHU066216|OMIM/MTHU066216|UmlsVocabulary
OMIM/MTHU069686|OMIM/MTHU069686|UmlsVocabulary
NCI/C82934|NCI/C82934|UmlsVocabulary
HPO/HP:0030890|HPO/HP:0030890|UmlsVocabulary
OMIM/MTHU042927|OMIM/MTHU042927|UmlsVocabulary
OMIM/MTHU029626|OMIM/MTHU029626|UmlsVocabulary
HPO/HP:0007546|HPO/HP:0007546|UmlsVocabulary
OMIM/MTHU034034|OMIM/MTHU034034|UmlsVocabulary
OMIM/MTHU037525|OMIM/MTHU037525|UmlsVocabulary
OMIM/MTHU041139|OMIM/MTHU041139|UmlsVocabulary
LNC/LA10316-0|LNC/LA10316-0|UmlsVocabulary
OMIM/MTHU045470|OMIM/MTHU045470|UmlsVocabulary
HPO/HP:0012750|HPO/HP:0012750|UmlsVocabulary
HPO/HP:0012690|HPO/HP:0012690|UmlsVocabulary
LNC/LP200343-4|LNC/LP200343-4|UmlsVocabulary
LNC/MTHU059265|LNC/MTHU059265|UmlsVocabulary
LNC/LP200342-6|LNC/LP200342-6|UmlsVocabulary
