{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "d3ebe820-bc6d-4948-b668-8b81cd3cbf29",
   "metadata": {
    "jp-MarkdownHeadingCollapsed": true,
    "tags": []
   },
   "source": [
    "#  Setup stuff: Connectivity"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1ea957d6-30c6-427a-ae4e-15ecfba0c4f9",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "\n",
    "from katana import remote\n",
    "from katana.remote import import_data\n",
    "\n",
    "my_client = remote.Client()\n",
    "\n",
    "print(my_client)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "97571016-7c02-4e90-a75a-136a0dacd35f",
   "metadata": {},
   "outputs": [],
   "source": [
    "NUM_PARTITIONS = 3\n",
    "   #\n",
    "DB_NAME        = \"my_db\"\n",
    "GRAPH_NAME     = \"my_graph\"\n",
    "\n",
    "print(\"--\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8ed2d715-aaeb-4381-9216-46fa0dd421b6",
   "metadata": {},
   "outputs": [],
   "source": [
    "#  DELETE ALL GRAPHS\n",
    "\n",
    "for l_database in my_client.databases():\n",
    "   for l_graph in my_client.get_database(name=l_database.name).graphs_in_database():\n",
    "      l_handle=my_client.get_database(name=l_database.name).get_graph_by_id(id=l_graph.graph_id)\n",
    "      l_handle.delete()\n",
    "\n",
    "for l_graph in my_client.graphs():\n",
    "   print(\"GRAPH ID: \", l_graph.graph_id, \"      GRAPH Version: \", l_graph.version)\n",
    "\n",
    "print(\"--\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "cf9c16ec-913f-46a8-bccc-76fc92c54866",
   "metadata": {},
   "outputs": [],
   "source": [
    "#  DELETE ALL DATABASES\n",
    "\n",
    "for l_database in my_client.databases():\n",
    "   if (l_database.name != \"default\"):\n",
    "      my_client.get_database(name=l_database.name).delete_database()\n",
    "      print(\"--\")\n",
    "\n",
    "for l_database in my_client.databases():\n",
    "   print(\"DB ID: \", l_database.database_id, \"     DB Name: \", l_database.name)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6e72729c-265b-40e4-a3ee-674b793bed81",
   "metadata": {},
   "outputs": [],
   "source": [
    "#  CREATE DATABASE\n",
    "\n",
    "my_database = my_client.create_database(name=DB_NAME)\n",
    "\n",
    "print(my_database.database_id)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2fc31da4-44c3-4bd3-b160-b315766dcd88",
   "metadata": {},
   "outputs": [],
   "source": [
    "#  CREATE GRAPH\n",
    "#\n",
    "my_graph = my_client.get_database(name=DB_NAME).create_graph(name=GRAPH_NAME, num_partitions=NUM_PARTITIONS)\n",
    "\n",
    "print(my_graph)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c5db6505-7fc8-4779-b194-9ed8945b9a90",
   "metadata": {},
   "outputs": [],
   "source": [
    "#  CONNECT TO GRAPH\n",
    "\n",
    "for l_graph in my_client.get_database(name=DB_NAME).graphs_in_database():\n",
    "   if (l_graph.name == GRAPH_NAME):\n",
    "      my_graph=my_client.get_database(name=DB_NAME).get_graph_by_id(id=l_graph.graph_id)\n",
    "         #\n",
    "      break\n",
    "\n",
    "print(my_graph)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "61556ce5-9044-42bc-bb13-80b6a514ae27",
   "metadata": {
    "tags": []
   },
   "source": [
    "# Create: Vertices/nodes, edges .."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f7efb47b-3c7d-45f3-acc8-ae29c3e2a1bf",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "\n",
    "print(\"--\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8e7ecf31-d69e-4b5a-8a37-0cfb4c32fd33",
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "#  Vertices/Nodes ..\n",
    "#\n",
    "#  Person;              id, name\n",
    "#  Order;               id, date_placed, date_shipped\n",
    "#  Stock;               id, name\n",
    "#  Store;               id, city\n",
    "#  DistributionCenter;  id, city\n",
    "#  Reviewer;            id, name, city\n",
    "\n",
    "df_persons    = pd.DataFrame([\n",
    "      #\n",
    "   [\"P_101\" , \"Justin\"                  , \"Person\"],\n",
    "   [\"P_102\" , \"Anand\"                   , \"Person\"],\n",
    "   [\"P_103\" , \"Brian\"                   , \"Person\"],\n",
    "   [\"P_104\" , \"Sameer\"                  , \"Person\"],\n",
    "       #\n",
    "   ], columns = [\"id\", \"name\", \"LABEL\"])\n",
    "      #\n",
    "display(df_persons.head(2))\n",
    "\n",
    "df_orders     = pd.DataFrame([\n",
    "      #\n",
    "   [\"O_101\" , \"2022-09-01\", \"\"           , \"Order\"],\n",
    "   [\"O_102\" , \"2022-09-02\", \"\"           , \"Order\"],\n",
    "   [\"O_103\" , \"2022-09-01\", \"2022-09-06\" , \"Order\"],\n",
    "   [\"O_104\" , \"2022-09-02\", \"\"           , \"Order\"],\n",
    "   [\"O_105\" , \"2022-09-01\", \"\"           , \"Order\"],\n",
    "   [\"O_106\" , \"2022-09-02\", \"\"           , \"Order\"],\n",
    "   [\"O_107\" , \"2022-09-01\", \"\"           , \"Order\"],\n",
    "   [\"O_108\" , \"2022-09-02\", \"\"           , \"Order\"],\n",
    "       #\n",
    "   ], columns = [\"id\", \"date_placed\", \"date_shipped\", \"LABEL\"])\n",
    "      #\n",
    "display(df_orders.head(2))\n",
    "\n",
    "df_items      = pd.DataFrame([\n",
    "      #\n",
    "   [\"I_101\" , \"Shoes\"                   , \"Item\"],\n",
    "   [\"I_102\" , \"Blanket\"                 , \"Item\"],\n",
    "   [\"I_103\" , \"Pants\"                   , \"Item\"],\n",
    "   [\"I_104\" , \"Hat\"                     , \"Item\"],\n",
    "       #\n",
    "   ], columns = [\"id\", \"name\", \"LABEL\"])\n",
    "      #\n",
    "display(df_items.head(2))\n",
    "\n",
    "df_stores     = pd.DataFrame([\n",
    "      #\n",
    "   [\"S_101\" , \"Milwaukee\"               , \"Store\"],\n",
    "   [\"S_102\" , \"Denver\"                  , \"Store\"],\n",
    "   [\"S_103\" , \"San Jose\"                , \"Store\"],\n",
    "   [\"S_104\" , \"Houston\"                 , \"Store\"],\n",
    "       #\n",
    "   ], columns = [\"id\", \"city\", \"LABEL\"])\n",
    "      #\n",
    "display(df_stores.head(2))\n",
    "\n",
    "df_dist_centers = pd.DataFrame([\n",
    "      #\n",
    "   [\"D_101\" , \"Reno\"                    , \"Dist_Center\"],\n",
    "   [\"D_102\" , \"Houston\"                 , \"Dist_Center\"],\n",
    "      #\n",
    "   ], columns = [\"id\", \"city\", \"LABEL\"])\n",
    "      #\n",
    "display(df_dist_centers.head(2))\n",
    "\n",
    "df_reviewers  = pd.DataFrame([\n",
    "      #\n",
    "   [\"R_101\" , \"Mary\"      , \"Dallas\"     , \"Reviewer\"],\n",
    "   [\"R_102\" , \"Allen\"     , \"Houston\"    , \"Reviewer\"],\n",
    "      #\n",
    "   ], columns = [\"id\", \"name\", \"city\", \"LABEL\"])\n",
    "      #\n",
    "display(df_reviewers.head(2))\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "60eaac88-4dd5-47d3-94b3-0f5fd0b243f2",
   "metadata": {},
   "outputs": [],
   "source": [
    "#  Create the edges ..\n",
    "\n",
    "#  Person  P_101-104  -  PLACED  -  Order  O_101-108\n",
    "#\n",
    "df_placed = pd.DataFrame([\n",
    "      #\n",
    "   [\"P_101\" , \"O_101\" ,        \"PLACED\" ],\n",
    "   [\"P_101\" , \"O_102\" ,        \"PLACED\" ],\n",
    "   [\"P_102\" , \"O_103\" ,        \"PLACED\" ],\n",
    "   [\"P_102\" , \"O_104\" ,        \"PLACED\" ],\n",
    "   [\"P_103\" , \"O_105\" ,        \"PLACED\" ],\n",
    "   [\"P_103\" , \"O_106\" ,        \"PLACED\" ],\n",
    "   [\"P_104\" , \"O_107\" ,        \"PLACED\" ],\n",
    "   [\"P_104\" , \"O_108\" ,        \"PLACED\" ],\n",
    "      #\n",
    "   ], columns = [\"START_ID\", \"END_ID\", \"TYPE\"])\n",
    "      #\n",
    "display(df_placed.head(2))\n",
    "\n",
    "#  Order  O_101-108  -  REVIEWED_BY  -  Reviewer  R_101-102     Reviewer 2 is Houston\n",
    "#                                                               Which makes Order 108 a Houston Order\n",
    "#\n",
    "df_reviewed_by = pd.DataFrame([\n",
    "      #\n",
    "   [\"O_101\" , \"R_101\" ,        \"REVIEWED_BY\" ],\n",
    "   [\"O_102\" , \"R_101\" ,        \"REVIEWED_BY\" ],\n",
    "   [\"O_103\" , \"R_101\" ,        \"REVIEWED_BY\" ],\n",
    "   [\"O_104\" , \"R_101\" ,        \"REVIEWED_BY\" ],\n",
    "   [\"O_105\" , \"R_101\" ,        \"REVIEWED_BY\" ],\n",
    "   [\"O_106\" , \"R_101\" ,        \"REVIEWED_BY\" ],\n",
    "   [\"O_107\" , \"R_101\" ,        \"REVIEWED_BY\" ],\n",
    "   [\"O_108\" , \"R_102\" ,        \"REVIEWED_BY\" ],\n",
    "      #\n",
    "   ], columns = [\"START_ID\", \"END_ID\", \"TYPE\"])\n",
    "      #\n",
    "display(df_reviewed_by.head(2))\n",
    "\n",
    "#  Order  O_101-108  -  COMPRISED_OF  -  Item  I_101-104 \n",
    "#\n",
    "df_comprised_of = pd.DataFrame([\n",
    "      #\n",
    "   [\"O_101\" , \"I_101\" ,        \"COMPRISED_OF\" ],\n",
    "   [\"O_102\" , \"I_102\" ,        \"COMPRISED_OF\" ],\n",
    "   [\"O_103\" , \"I_103\" ,        \"COMPRISED_OF\" ],\n",
    "   [\"O_104\" , \"I_104\" ,        \"COMPRISED_OF\" ],\n",
    "   [\"O_105\" , \"I_101\" ,        \"COMPRISED_OF\" ],\n",
    "   [\"O_106\" , \"I_102\" ,        \"COMPRISED_OF\" ],\n",
    "   [\"O_107\" , \"I_103\" ,        \"COMPRISED_OF\" ],\n",
    "   [\"O_108\" , \"I_104\" ,        \"COMPRISED_OF\" ],\n",
    "      #\n",
    "   ], columns = [\"START_ID\", \"END_ID\", \"TYPE\"])\n",
    "      #\n",
    "display(df_comprised_of.head(2))\n",
    "\n",
    "\n",
    "#  Stock  K_101-104  -  FOUND_AT  -  Store  S_101-104           Store 4 is Houston\n",
    "#                                                               Which makes Stock 104 a Houston Stock (Item)\n",
    "#\n",
    "df_found_at_store = pd.DataFrame([\n",
    "      #\n",
    "   [\"S_101\" , \"I_101\" , 5 ,    \"FOUND_AT_STORE\" ],\n",
    "   [\"S_101\" , \"I_102\" , 5 ,    \"FOUND_AT_STORE\" ],\n",
    "   [\"S_101\" , \"I_103\" , 5 ,    \"FOUND_AT_STORE\" ],\n",
    "      #\n",
    "   [\"S_102\" , \"I_102\" , 5 ,    \"FOUND_AT_STORE\" ],\n",
    "   [\"S_102\" , \"I_103\" , 5 ,    \"FOUND_AT_STORE\" ],\n",
    "      #\n",
    "   [\"S_103\" , \"I_101\" , 5 ,    \"FOUND_AT_STORE\" ],\n",
    "   [\"S_103\" , \"I_102\" , 5 ,    \"FOUND_AT_STORE\" ],\n",
    "   [\"S_103\" , \"I_103\" , 5 ,    \"FOUND_AT_STORE\" ],\n",
    "      #\n",
    "   [\"S_104\" , \"I_101\" , 0 ,    \"FOUND_AT_STORE\" ],\n",
    "   [\"S_104\" , \"I_102\" , 0 ,    \"FOUND_AT_STORE\" ],\n",
    "   [\"S_104\" , \"I_103\" , 0 ,    \"FOUND_AT_STORE\" ],\n",
    "   [\"S_104\" , \"I_104\" , 0 ,    \"FOUND_AT_STORE\" ],\n",
    "      #\n",
    "   ], columns = [\"START_ID\", \"END_ID\", \"QUANTITY\", \"TYPE\"])\n",
    "      #\n",
    "display(df_found_at_store.head(2))\n",
    "\n",
    "\n",
    "#  Stock  K_101-104  -  FOUND_AT  -  Dist_Center  S_101-102     Dist_Center 2 is Houston\n",
    "#                                                               Which makes Stock 103 and 104 a Houston Stock (Item)\n",
    "#\n",
    "df_found_at_dist_center = pd.DataFrame([\n",
    "      #\n",
    "   [\"D_101\" , \"I_101\" , 5 ,    \"FOUND_AT_DIST_CENTER\" ],\n",
    "   [\"D_101\" , \"I_102\" , 5 ,    \"FOUND_AT_DIST_CENTER\" ],\n",
    "   [\"D_101\" , \"I_103\" , 5 ,    \"FOUND_AT_DIST_CENTER\" ],\n",
    "   [\"D_101\" , \"I_104\" , 5 ,    \"FOUND_AT_DIST_CENTER\" ],\n",
    "      #\n",
    "   [\"D_102\" , \"I_103\" , 0 ,    \"FOUND_AT_DIST_CENTER\" ],\n",
    "   [\"D_102\" , \"I_104\" , 5 ,    \"FOUND_AT_DIST_CENTER\" ],\n",
    "      #\n",
    "   ], columns = [\"START_ID\", \"END_ID\", \"QUANTITY\", \"TYPE\"])\n",
    "      #\n",
    "display(df_found_at_dist_center.head(2))\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2f22872f-dbea-4852-a5bb-1e515937cd85",
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "# Import the previously created Python DataFrames into KatanaGraph ..\n",
    "\n",
    "with import_data.DataFrameImporter(my_graph) as df_importer:   \n",
    "    \n",
    "   df_importer.nodes_dataframe(df_persons, \n",
    "      id_column             = \"id\",\n",
    "      id_space              = \"Person\",  \n",
    "      label                 = \"Person\",  \n",
    "      )\n",
    "   df_importer.nodes_dataframe(df_orders, \n",
    "      id_column             = \"id\",\n",
    "      id_space              = \"Order\",  \n",
    "      label                 = \"Order\",  \n",
    "      )\n",
    "   df_importer.nodes_dataframe(df_items, \n",
    "      id_column             = \"id\",\n",
    "      id_space              = \"Item\",  \n",
    "      label                 = \"Item\",  \n",
    "      )\n",
    "   df_importer.nodes_dataframe(df_stores, \n",
    "      id_column             = \"id\",\n",
    "      id_space              = \"Store\",  \n",
    "      label                 = \"Store\",  \n",
    "      )\n",
    "   df_importer.nodes_dataframe(df_dist_centers, \n",
    "      id_column             = \"id\",\n",
    "      id_space              = \"Dist_Center\",  \n",
    "      label                 = \"Dist_Center\",  \n",
    "      )\n",
    "   df_importer.nodes_dataframe(df_reviewers, \n",
    "      id_column             = \"id\",\n",
    "      id_space              = \"Reviewer\",  \n",
    "      label                 = \"Reviewer\",  \n",
    "      )\n",
    "\n",
    "         ### ############################################\n",
    "    \n",
    "   df_importer.edges_dataframe(df_placed,\n",
    "      source_id_space       = \"Person\", \n",
    "      destination_id_space  = \"Order\",   \n",
    "      source_column         = \"START_ID\",\n",
    "      destination_column    = \"END_ID\",\n",
    "      type                  = \"PLACED\"\n",
    "      )\n",
    "   df_importer.edges_dataframe(df_placed,\n",
    "      source_id_space       = \"Person\", \n",
    "      destination_id_space  = \"Order\",   \n",
    "      source_column         = \"END_ID\",\n",
    "      destination_column    = \"START_ID\",\n",
    "      type                  = \"PLACED\"\n",
    "      )\n",
    "    \n",
    "   df_importer.edges_dataframe(df_comprised_of,\n",
    "      source_id_space       = \"Order\", \n",
    "      destination_id_space  = \"Item\",   \n",
    "      source_column         = \"START_ID\",\n",
    "      destination_column    = \"END_ID\",\n",
    "      type                  = \"COMPRISED_OF\"\n",
    "      )\n",
    "   df_importer.edges_dataframe(df_comprised_of,\n",
    "      source_id_space       = \"Order\", \n",
    "      destination_id_space  = \"Item\",   \n",
    "      source_column         = \"END_ID\",\n",
    "      destination_column    = \"START_ID\",\n",
    "      type                  = \"COMPRISED_OF\"\n",
    "      )\n",
    "    \n",
    "   df_importer.edges_dataframe(df_reviewed_by,\n",
    "      source_id_space       = \"Order\", \n",
    "      destination_id_space  = \"Reviewer\",   \n",
    "      source_column         = \"START_ID\",\n",
    "      destination_column    = \"END_ID\",\n",
    "      type                  = \"REVIEWED_BY\"\n",
    "      )\n",
    "   df_importer.edges_dataframe(df_reviewed_by,\n",
    "      source_id_space       = \"Order\", \n",
    "      destination_id_space  = \"Reviewer\",   \n",
    "      source_column         = \"END_ID\",\n",
    "      destination_column    = \"START_ID\",\n",
    "      type                  = \"REVIEWED_BY\"\n",
    "      )\n",
    "    \n",
    "   df_importer.edges_dataframe(df_found_at_store,\n",
    "      source_id_space       = \"Item\", \n",
    "      destination_id_space  = \"Store\",   \n",
    "      source_column         = \"START_ID\",\n",
    "      destination_column    = \"END_ID\",\n",
    "      type                  = \"FOUND_AT_STORE\"\n",
    "      )\n",
    "   df_importer.edges_dataframe(df_found_at_store,\n",
    "      source_id_space       = \"Item\", \n",
    "      destination_id_space  = \"Store\",   \n",
    "      source_column         = \"END_ID\",\n",
    "      destination_column    = \"START_ID\",\n",
    "      type                  = \"FOUND_AT_STORE\"\n",
    "      )\n",
    "    \n",
    "   df_importer.edges_dataframe(df_found_at_dist_center,\n",
    "      source_id_space       = \"Item\", \n",
    "      destination_id_space  = \"Dist_Center\",   \n",
    "      source_column         = \"START_ID\",\n",
    "      destination_column    = \"END_ID\",\n",
    "      type                  = \"FOUND_AT_DIST_CENTER\"\n",
    "      )\n",
    "   df_importer.edges_dataframe(df_found_at_dist_center,\n",
    "      source_id_space       = \"Item\", \n",
    "      destination_id_space  = \"Dist_Center\",   \n",
    "      source_column         = \"END_ID\",\n",
    "      destination_column    = \"START_ID\",\n",
    "      type                  = \"FOUND_AT_DIST_CENTER\"\n",
    "      )\n",
    "    \n",
    "\n",
    "print(\"--\")\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "40558f94-74e6-413e-9376-c6a89982a9d0",
   "metadata": {},
   "source": [
    "#  Setup stuff: Debugging"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ce3ecfbe-cca0-41dd-bb15-594f2d545365",
   "metadata": {},
   "outputs": [],
   "source": [
    "display(my_graph.num_nodes())\n",
    "display(my_graph.num_edges())\n",
    "\n",
    "#  Outputted values,\n",
    "#\n",
    "#  24\n",
    "#  42\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "793186d1-d998-4662-b5f6-958a1a752892",
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "l_result = my_graph.query(\"\"\"\n",
    "\n",
    "   MATCH (n) - [ r ] -> (m)\n",
    "   RETURN n, m, r\n",
    "   \n",
    "   \"\"\", contextualize=True)\n",
    "\n",
    "l_result.view()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "14304446-5b53-4f14-aee4-78bde94c2e40",
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "l_result = my_graph.query(\"\"\"\n",
    "\n",
    "   MATCH (a) \n",
    "   WITH DISTINCT LABELS(a) AS temp, COUNT(a) AS tempCnt\n",
    "   UNWIND temp AS label\n",
    "   RETURN label, SUM(tempCnt) AS cnt\n",
    "   ORDER BY label\n",
    "   \n",
    "   \"\"\")\n",
    "\n",
    "display(print(l_result))\n",
    "\n",
    "#  Outputted values\n",
    "#\n",
    "#     cnt        label\n",
    "#  0    2  Dist_Center\n",
    "#  1    4         Item\n",
    "#  2    8        Order\n",
    "#  3    4       Person\n",
    "#  4    2     Reviewer\n",
    "#  5    4        Store\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "aff03cac-68ee-445a-9df2-ca72aad64ca5",
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "l_result = my_graph.query(\"\"\"\n",
    "\n",
    "   MATCH (m)-[r]->(n) \n",
    "   WITH DISTINCT TYPE(r) AS temp, COUNT(r) AS tempCnt\n",
    "   RETURN temp, tempCnt\n",
    "   ORDER BY temp\n",
    "\n",
    "   \"\"\")\n",
    "\n",
    "display(print(l_result))\n",
    "\n",
    "#  Outputted values,\n",
    "#\n",
    "#                     temp  tempCnt\n",
    "#  0          COMPRISED_OF        8\n",
    "#  1  FOUND_AT_DIST_CENTER        6\n",
    "#  2        FOUND_AT_STORE       12\n",
    "#  3                PLACED        8\n",
    "#  4           REVIEWED_BY        8\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "16c47d1b-a0a4-4eae-b079-7eabf4e1c099",
   "metadata": {},
   "source": [
    "#  Analytics: Why we are here"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4aae001c-b926-4e3b-b22a-8c2f77941da3",
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "l_result = my_graph.query(\"\"\"\n",
    "\n",
    "   MATCH (m: Person)-[r]->(n) \n",
    "   WHERE\n",
    "      n.city = 'Houston'\n",
    "   RETURN *\n",
    "\n",
    "   \"\"\")\n",
    "\n",
    "display(print(l_result))\n",
    "\n",
    "#  Outputted value,\n",
    "#\n",
    "#  Empty DataFrame\n",
    "#  Columns: []\n",
    "#  Index: []\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "id": "193a18f4-4c95-45d2-a2c4-3b9ede13ce8a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "7ae8f7c753514070a9ae28894dec82e1",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "          0/? [?op/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "ename": "OperationError",
     "evalue": "FZSoWndtUBvHNquRkos1tkw5DS9CwvH6NF4X5Ady2WfZ-43CxYsTPwbyPAsoQQ backtrace (QueryClient.cpp:575): opgraph check failed (OpGraph.cpp:564): Unimplemented Features Pass (OpGraphErrorChecker.cpp:12): backtrace (UnimplementedFeaturesChecker.cpp:376): backtrace (OpGraph.cpp:822): backtrace (OpGraph.cpp:822): backtrace (OpGraph.cpp:798): returning named variable paths not yet supported (UnimplementedFeaturesChecker.cpp:197): InternalError:NotImplemented: InternalError:NotImplemented",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mOperationError\u001b[0m                            Traceback (most recent call last)",
      "Input \u001b[0;32mIn [46]\u001b[0m, in \u001b[0;36m<cell line: 1>\u001b[0;34m()\u001b[0m\n\u001b[0;32m----> 1\u001b[0m l_result \u001b[38;5;241m=\u001b[39m \u001b[43mmy_graph\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mquery\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;124;43m\"\"\"\u001b[39;49m\n\u001b[1;32m      2\u001b[0m \n\u001b[1;32m      3\u001b[0m \u001b[38;5;124;43m   MATCH (m: Person)-[r *]->(n) \u001b[39;49m\n\u001b[1;32m      4\u001b[0m \u001b[38;5;124;43m   WHERE\u001b[39;49m\n\u001b[1;32m      5\u001b[0m \u001b[38;5;124;43m      n.city = \u001b[39;49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[38;5;124;43mHouston\u001b[39;49m\u001b[38;5;124;43m'\u001b[39;49m\n\u001b[1;32m      6\u001b[0m \u001b[38;5;124;43m   RETURN *\u001b[39;49m\n\u001b[1;32m      7\u001b[0m \n\u001b[1;32m      8\u001b[0m \u001b[38;5;124;43m   \u001b[39;49m\u001b[38;5;124;43m\"\"\"\u001b[39;49m\u001b[43m)\u001b[49m\n\u001b[1;32m     10\u001b[0m display(\u001b[38;5;28mprint\u001b[39m(l_result))\n",
      "File \u001b[0;32m/opt/conda/lib/python3.8/site-packages/katana_enterprise/async_to_sync.py:249\u001b[0m, in \u001b[0;36mAsyncToSync.<locals>.do_wrap.<locals>.wrapper\u001b[0;34m(self, *args, **kwargs)\u001b[0m\n\u001b[1;32m    246\u001b[0m \u001b[38;5;129m@wraps\u001b[39m(underlying_func)\n\u001b[1;32m    247\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21mwrapper\u001b[39m(\u001b[38;5;28mself\u001b[39m, \u001b[38;5;241m*\u001b[39margs, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs):\n\u001b[1;32m    248\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m registry\u001b[38;5;241m.\u001b[39masync_to_sync(\n\u001b[0;32m--> 249\u001b[0m         \u001b[43munderlying_func\u001b[49m\u001b[43m(\u001b[49m\n\u001b[1;32m    250\u001b[0m \u001b[43m            \u001b[49m\u001b[43mget_self_func\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[43m)\u001b[49m\u001b[43m,\u001b[49m\n\u001b[1;32m    251\u001b[0m \u001b[43m            \u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43m(\u001b[49m\u001b[43mregistry\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43msync_to_async\u001b[49m\u001b[43m(\u001b[49m\u001b[43ma\u001b[49m\u001b[43m)\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43;01mfor\u001b[39;49;00m\u001b[43m \u001b[49m\u001b[43ma\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;129;43;01min\u001b[39;49;00m\u001b[43m \u001b[49m\u001b[43margs\u001b[49m\u001b[43m)\u001b[49m\u001b[43m,\u001b[49m\n\u001b[1;32m    252\u001b[0m \u001b[43m            \u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43m{\u001b[49m\u001b[43mk\u001b[49m\u001b[43m:\u001b[49m\u001b[43m \u001b[49m\u001b[43mregistry\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43msync_to_async\u001b[49m\u001b[43m(\u001b[49m\u001b[43mv\u001b[49m\u001b[43m)\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43;01mfor\u001b[39;49;00m\u001b[43m \u001b[49m\u001b[43mk\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mv\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;129;43;01min\u001b[39;49;00m\u001b[43m \u001b[49m\u001b[43mkwargs\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mitems\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\u001b[43m}\u001b[49m\u001b[43m,\u001b[49m\n\u001b[1;32m    253\u001b[0m \u001b[43m        \u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    254\u001b[0m     )\n",
      "File \u001b[0;32m/opt/conda/lib/python3.8/site-packages/katana_enterprise/async_to_sync.py:176\u001b[0m, in \u001b[0;36masync_to_sync.<locals>.wrapper\u001b[0;34m(timeout, *args, **kwargs)\u001b[0m\n\u001b[1;32m    166\u001b[0m     registry \u001b[38;5;241m=\u001b[39m AsyncToSyncClassRegistry\u001b[38;5;241m.\u001b[39mget()\n\u001b[1;32m    167\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m registry\u001b[38;5;241m.\u001b[39masync_to_sync(\n\u001b[1;32m    168\u001b[0m         wait_for(\n\u001b[1;32m    169\u001b[0m             async_func(\n\u001b[0;32m   (...)\u001b[0m\n\u001b[1;32m    174\u001b[0m         )\n\u001b[1;32m    175\u001b[0m     )\n\u001b[0;32m--> 176\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[43mwait_for\u001b[49m\u001b[43m(\u001b[49m\u001b[43masync_func\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43margs\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43mkwargs\u001b[49m\u001b[43m)\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mtimeout\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mtimeout\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[0;32m/opt/conda/lib/python3.8/site-packages/katana_enterprise/async_to_sync.py:147\u001b[0m, in \u001b[0;36mwait_for\u001b[0;34m(coro, timeout)\u001b[0m\n\u001b[1;32m    145\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[1;32m    146\u001b[0m     future \u001b[38;5;241m=\u001b[39m asyncio\u001b[38;5;241m.\u001b[39mrun_coroutine_threadsafe(timeout_coro, loop\u001b[38;5;241m=\u001b[39mAsyncRunnerThread\u001b[38;5;241m.\u001b[39mget()\u001b[38;5;241m.\u001b[39mloop)\n\u001b[0;32m--> 147\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[43mfuture\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mresult\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    148\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m \u001b[38;5;167;01mKeyboardInterrupt\u001b[39;00m:\n\u001b[1;32m    149\u001b[0m     inner_future\u001b[38;5;241m.\u001b[39mcancel()\n",
      "File \u001b[0;32m/opt/conda/lib/python3.8/concurrent/futures/_base.py:444\u001b[0m, in \u001b[0;36mFuture.result\u001b[0;34m(self, timeout)\u001b[0m\n\u001b[1;32m    442\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m CancelledError()\n\u001b[1;32m    443\u001b[0m \u001b[38;5;28;01melif\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_state \u001b[38;5;241m==\u001b[39m FINISHED:\n\u001b[0;32m--> 444\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m__get_result\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    445\u001b[0m \u001b[38;5;28;01melse\u001b[39;00m:\n\u001b[1;32m    446\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;167;01mTimeoutError\u001b[39;00m()\n",
      "File \u001b[0;32m/opt/conda/lib/python3.8/concurrent/futures/_base.py:389\u001b[0m, in \u001b[0;36mFuture.__get_result\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    387\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_exception:\n\u001b[1;32m    388\u001b[0m     \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[0;32m--> 389\u001b[0m         \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_exception\n\u001b[1;32m    390\u001b[0m     \u001b[38;5;28;01mfinally\u001b[39;00m:\n\u001b[1;32m    391\u001b[0m         \u001b[38;5;66;03m# Break a reference cycle with the exception in self._exception\u001b[39;00m\n\u001b[1;32m    392\u001b[0m         \u001b[38;5;28mself\u001b[39m \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;01mNone\u001b[39;00m\n",
      "File \u001b[0;32m/opt/conda/lib/python3.8/asyncio/tasks.py:455\u001b[0m, in \u001b[0;36mwait_for\u001b[0;34m(fut, timeout, loop)\u001b[0m\n\u001b[1;32m    450\u001b[0m     warnings\u001b[38;5;241m.\u001b[39mwarn(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mThe loop argument is deprecated since Python 3.8, \u001b[39m\u001b[38;5;124m\"\u001b[39m\n\u001b[1;32m    451\u001b[0m                   \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mand scheduled for removal in Python 3.10.\u001b[39m\u001b[38;5;124m\"\u001b[39m,\n\u001b[1;32m    452\u001b[0m                   \u001b[38;5;167;01mDeprecationWarning\u001b[39;00m, stacklevel\u001b[38;5;241m=\u001b[39m\u001b[38;5;241m2\u001b[39m)\n\u001b[1;32m    454\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m timeout \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;28;01mNone\u001b[39;00m:\n\u001b[0;32m--> 455\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;01mawait\u001b[39;00m fut\n\u001b[1;32m    457\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m timeout \u001b[38;5;241m<\u001b[39m\u001b[38;5;241m=\u001b[39m \u001b[38;5;241m0\u001b[39m:\n\u001b[1;32m    458\u001b[0m     fut \u001b[38;5;241m=\u001b[39m ensure_future(fut, loop\u001b[38;5;241m=\u001b[39mloop)\n",
      "File \u001b[0;32m/opt/conda/lib/python3.8/site-packages/katana_enterprise/remote/aio/graph.py:298\u001b[0m, in \u001b[0;36mGraph.query\u001b[0;34m(self, query, memory_usage_factor, contextualize, **parameters)\u001b[0m\n\u001b[1;32m    295\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m memory_usage_factor:\n\u001b[1;32m    296\u001b[0m     parameters[\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124m__katana_internal_match_batch_limit_scale_factor\u001b[39m\u001b[38;5;124m\"\u001b[39m] \u001b[38;5;241m=\u001b[39m memory_usage_factor\n\u001b[0;32m--> 298\u001b[0m response \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;01mawait\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_run_query(query, parameters\u001b[38;5;241m=\u001b[39mparameters)\n\u001b[1;32m    299\u001b[0m rows \u001b[38;5;241m=\u001b[39m response[\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mresult\u001b[39m\u001b[38;5;124m\"\u001b[39m][\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mrows\u001b[39m\u001b[38;5;124m\"\u001b[39m]\n\u001b[1;32m    300\u001b[0m columns \u001b[38;5;241m=\u001b[39m response[\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mresult\u001b[39m\u001b[38;5;124m\"\u001b[39m][\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mcolumns\u001b[39m\u001b[38;5;124m\"\u001b[39m]\n",
      "File \u001b[0;32m/opt/conda/lib/python3.8/site-packages/katana_enterprise/remote/aio/graph.py:276\u001b[0m, in \u001b[0;36mGraph._run_query\u001b[0;34m(self, query, parameters, parquet)\u001b[0m\n\u001b[1;32m    272\u001b[0m     data[\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mcypher\u001b[39m\u001b[38;5;124m\"\u001b[39m][\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124moutput_type\u001b[39m\u001b[38;5;124m\"\u001b[39m] \u001b[38;5;241m=\u001b[39m \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mParquet\u001b[39m\u001b[38;5;124m\"\u001b[39m\n\u001b[1;32m    274\u001b[0m data \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_add_operation_metadata(data)\n\u001b[0;32m--> 276\u001b[0m res \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;01mawait\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_client\u001b[38;5;241m.\u001b[39m_run_on_graph_and_wait(\u001b[38;5;28mself\u001b[39m, data)\n\u001b[1;32m    278\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m res\n",
      "File \u001b[0;32m/opt/conda/lib/python3.8/site-packages/katana_enterprise/remote/aio/client.py:319\u001b[0m, in \u001b[0;36mDatabase._run_on_graph_and_wait\u001b[0;34m(self, graph, data)\u001b[0m\n\u001b[1;32m    317\u001b[0m \u001b[38;5;28;01masync\u001b[39;00m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21m_run_on_graph_and_wait\u001b[39m(\u001b[38;5;28mself\u001b[39m, graph: Graph, data) \u001b[38;5;241m-\u001b[39m\u001b[38;5;241m>\u001b[39m \u001b[38;5;28mdict\u001b[39m:\n\u001b[1;32m    318\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_check_graph_from_myself(graph)\n\u001b[0;32m--> 319\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;01mawait\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_wait_op(\u001b[38;5;28;01mawait\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_run_on_graph(graph, data))\n",
      "File \u001b[0;32m/opt/conda/lib/python3.8/site-packages/katana_enterprise/remote/aio/client.py:261\u001b[0m, in \u001b[0;36mDatabase._wait_op\u001b[0;34m(self, op)\u001b[0m\n\u001b[1;32m    259\u001b[0m \u001b[38;5;28;01masync\u001b[39;00m \u001b[38;5;28;01mwith\u001b[39;00m _progress_bar() \u001b[38;5;28;01mas\u001b[39;00m pbar:\n\u001b[1;32m    260\u001b[0m     \u001b[38;5;28;01masync\u001b[39;00m \u001b[38;5;28;01mwith\u001b[39;00m wait_fn(operation_id) \u001b[38;5;28;01mas\u001b[39;00m stream:\n\u001b[0;32m--> 261\u001b[0m         \u001b[38;5;28;01masync\u001b[39;00m \u001b[38;5;28;01mfor\u001b[39;00m update \u001b[38;5;129;01min\u001b[39;00m stream:\n\u001b[1;32m    262\u001b[0m             status \u001b[38;5;241m=\u001b[39m update[\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mstatus\u001b[39m\u001b[38;5;124m\"\u001b[39m]\n\u001b[1;32m    264\u001b[0m             \u001b[38;5;28;01mfor\u001b[39;00m entry \u001b[38;5;129;01min\u001b[39;00m update\u001b[38;5;241m.\u001b[39mget(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mprogress\u001b[39m\u001b[38;5;124m\"\u001b[39m, []):\n",
      "File \u001b[0;32m/opt/conda/lib/python3.8/site-packages/asyncstdlib/builtins.py:445\u001b[0m, in \u001b[0;36mmap\u001b[0;34m(function, *iterable)\u001b[0m\n\u001b[1;32m    443\u001b[0m \u001b[38;5;28;01masync\u001b[39;00m \u001b[38;5;28;01mfor\u001b[39;00m args \u001b[38;5;129;01min\u001b[39;00m args_iter:\n\u001b[1;32m    444\u001b[0m     result \u001b[38;5;241m=\u001b[39m function(\u001b[38;5;241m*\u001b[39margs)\n\u001b[0;32m--> 445\u001b[0m     \u001b[38;5;28;01myield\u001b[39;00m \u001b[38;5;28;01mawait\u001b[39;00m result\n",
      "File \u001b[0;32m/opt/conda/lib/python3.8/site-packages/asyncstdlib/_core.py:134\u001b[0m, in \u001b[0;36mforce_async.<locals>.async_wrapped\u001b[0;34m(*args, **kwargs)\u001b[0m\n\u001b[1;32m    133\u001b[0m \u001b[38;5;28;01masync\u001b[39;00m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21masync_wrapped\u001b[39m(\u001b[38;5;241m*\u001b[39margs: Any, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs: Any) \u001b[38;5;241m-\u001b[39m\u001b[38;5;241m>\u001b[39m T:\n\u001b[0;32m--> 134\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[43mcall\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43margs\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43mkwargs\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[0;32m/opt/conda/lib/python3.8/site-packages/katana_enterprise/rpc/client.py:142\u001b[0m, in \u001b[0;36m_OperationClient._event_stream.<locals>.parse_stream\u001b[0;34m(line)\u001b[0m\n\u001b[1;32m    139\u001b[0m status \u001b[38;5;241m=\u001b[39m data[\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mstatus\u001b[39m\u001b[38;5;124m\"\u001b[39m]\n\u001b[1;32m    141\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m status \u001b[38;5;241m==\u001b[39m \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mFailed\u001b[39m\u001b[38;5;124m\"\u001b[39m:\n\u001b[0;32m--> 142\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m errors\u001b[38;5;241m.\u001b[39mOperationError(operation_id \u001b[38;5;241m+\u001b[39m \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124m \u001b[39m\u001b[38;5;124m\"\u001b[39m \u001b[38;5;241m+\u001b[39m data[\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mstatus_message\u001b[39m\u001b[38;5;124m\"\u001b[39m])\n\u001b[1;32m    143\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m status \u001b[38;5;241m==\u001b[39m \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mCanceled\u001b[39m\u001b[38;5;124m\"\u001b[39m:\n\u001b[1;32m    144\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m errors\u001b[38;5;241m.\u001b[39mCanceledError()\n",
      "\u001b[0;31mOperationError\u001b[0m: FZSoWndtUBvHNquRkos1tkw5DS9CwvH6NF4X5Ady2WfZ-43CxYsTPwbyPAsoQQ backtrace (QueryClient.cpp:575): opgraph check failed (OpGraph.cpp:564): Unimplemented Features Pass (OpGraphErrorChecker.cpp:12): backtrace (UnimplementedFeaturesChecker.cpp:376): backtrace (OpGraph.cpp:822): backtrace (OpGraph.cpp:822): backtrace (OpGraph.cpp:798): returning named variable paths not yet supported (UnimplementedFeaturesChecker.cpp:197): InternalError:NotImplemented: InternalError:NotImplemented"
     ]
    }
   ],
   "source": [
    "\n",
    "\n",
    "l_result = my_graph.query(\"\"\"\n",
    "\n",
    "   MATCH (m: Person)-[r *]->(n) \n",
    "   WHERE\n",
    "      n.city = 'Houston'\n",
    "   RETURN *\n",
    "\n",
    "   \"\"\")\n",
    "\n",
    "display(print(l_result))\n",
    "\n",
    "#  Outputted value,\n",
    "#\n",
    "OperationError: FZSoWndtUBvHNquRkos1tkw5DS9CwvH6NF4X5Ady2WfZ-43CxYsTPwbyPAsoQQ backtrace (QueryClient.cpp:575):\n",
    "opgraph check failed (OpGraph.cpp:564): Unimplemented Features Pass (OpGraphErrorChecker.cpp:12):\n",
    "backtrace (UnimplementedFeaturesChecker.cpp:376): backtrace (OpGraph.cpp:822):\n",
    "backtrace (OpGraph.cpp:822): backtrace (OpGraph.cpp:798):\n",
    "returning named variable paths not yet supported (UnimplementedFeaturesChecker.cpp:197): InternalError:NotImplemented: InternalError:NotImplemented\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "20764f78-b38c-4750-84a2-1971a247b0c0",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a0fe19d6-8df9-464e-9e02-93ba82a773e8",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6160bd57-15aa-4ff0-9269-9431e6f7dd2b",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
